;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.1.LTS *
;* Date/Time created: Wed Sep 16 12:09:21 2020                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on --endian=little --float_support=none --hll_source=on --object_format=elf --quiet --section_sizes=on --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slnetifwifi.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/ccs/Release")
	.global	gIfID
	.common	gIfID,2,2
$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("gIfID")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("gIfID")
	.dwattr $C$DW$1, DW_AT_location[DW_OP_addr gIfID]
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$246)
	.dwattr $C$DW$1, DW_AT_external
	.dwattr $C$DW$1, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slnetifwifi.c")
	.dwattr $C$DW$1, DW_AT_decl_line(0x3e)


	.dwattr $C$DW$T$585, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetif.h")
	.dwattr $C$DW$T$585, DW_AT_decl_line(0x61)
	.dwattr $C$DW$T$585, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$585

$C$DW$T$586	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$586, DW_AT_name("SlNetIfState_e")
	.dwattr $C$DW$T$586, DW_AT_type(*$C$DW$T$585)
	.dwattr $C$DW$T$586, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$586, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetif.h")
	.dwattr $C$DW$T$586, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$586, DW_AT_decl_column(0x03)


$C$DW$T$587	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$587, DW_AT_byte_size(0x01)
$C$DW$730	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$730, DW_AT_name("WifiConnEvent_POWERED_UP")
	.dwattr $C$DW$730, DW_AT_const_value(0x00)
	.dwattr $C$DW$730, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$730, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$730, DW_AT_decl_column(0x05)

$C$DW$731	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$731, DW_AT_name("WifiConnEvent_POWERED_DOWN")
	.dwattr $C$DW$731, DW_AT_const_value(0x01)
	.dwattr $C$DW$731, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$731, DW_AT_decl_line(0x43)
	.dwattr $C$DW$731, DW_AT_decl_column(0x05)

$C$DW$732	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$732, DW_AT_name("WifiConnEvent_PROVISIONING_STARTED")
	.dwattr $C$DW$732, DW_AT_const_value(0x02)
	.dwattr $C$DW$732, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$732, DW_AT_decl_line(0x49)
	.dwattr $C$DW$732, DW_AT_decl_column(0x05)

$C$DW$733	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$733, DW_AT_name("WifiConnEvent_PROVISIONING_STOPPED")
	.dwattr $C$DW$733, DW_AT_const_value(0x03)
	.dwattr $C$DW$733, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$733, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$733, DW_AT_decl_column(0x05)

$C$DW$734	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$734, DW_AT_name("WifiConnEvent_EXTERNAL_PROVISIONING_START_REQ")
	.dwattr $C$DW$734, DW_AT_const_value(0x04)
	.dwattr $C$DW$734, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$734, DW_AT_decl_line(0x57)
	.dwattr $C$DW$734, DW_AT_decl_column(0x05)

$C$DW$735	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$735, DW_AT_name("WifiConnEvent_EXTERNAL_PROVISIONING_STOP_REQ")
	.dwattr $C$DW$735, DW_AT_const_value(0x05)
	.dwattr $C$DW$735, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$735, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$735, DW_AT_decl_column(0x05)

$C$DW$736	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$736, DW_AT_name("WifiConnEvent_CLOUD_CONFIRMATION_START_REQ")
	.dwattr $C$DW$736, DW_AT_const_value(0x06)
	.dwattr $C$DW$736, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$736, DW_AT_decl_line(0x66)
	.dwattr $C$DW$736, DW_AT_decl_column(0x05)

$C$DW$737	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$737, DW_AT_name("WifiConnEvent_CLOUD_CONFIRMATION_STOP_REQ")
	.dwattr $C$DW$737, DW_AT_const_value(0x07)
	.dwattr $C$DW$737, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$737, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$737, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$587, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$T$587, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$587, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$587

$C$DW$T$588	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$588, DW_AT_name("WifiConnEventId_e")
	.dwattr $C$DW$T$588, DW_AT_type(*$C$DW$T$587)
	.dwattr $C$DW$T$588, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$588, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$T$588, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$T$588, DW_AT_decl_column(0x03)


$C$DW$T$589	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$589, DW_AT_byte_size(0x01)
$C$DW$738	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$738, DW_AT_name("WifiProvMode_OFF")
	.dwattr $C$DW$738, DW_AT_const_value(0x00)
	.dwattr $C$DW$738, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$738, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$738, DW_AT_decl_column(0x05)

$C$DW$739	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$739, DW_AT_name("WifiProvMode_ONE_SHOT")
	.dwattr $C$DW$739, DW_AT_const_value(0x01)
	.dwattr $C$DW$739, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$739, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$739, DW_AT_decl_column(0x05)

$C$DW$740	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$740, DW_AT_name("WifiProvMode_ON")
	.dwattr $C$DW$740, DW_AT_const_value(0x02)
	.dwattr $C$DW$740, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$740, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$740, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$589, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$T$589, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$T$589, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$589

$C$DW$T$590	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$590, DW_AT_name("WifiConnProvMode_e")
	.dwattr $C$DW$T$590, DW_AT_type(*$C$DW$T$589)
	.dwattr $C$DW$T$590, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$590, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$T$590, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$T$590, DW_AT_decl_column(0x03)


$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_byte_size(0x20)
$C$DW$741	.dwtag  DW_TAG_member
	.dwattr $C$DW$741, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$741, DW_AT_name("PingIntervalTime")
	.dwattr $C$DW$741, DW_AT_TI_symbol_name("PingIntervalTime")
	.dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$741, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$741, DW_AT_decl_line(0x140)
	.dwattr $C$DW$741, DW_AT_decl_column(0x0d)

$C$DW$742	.dwtag  DW_TAG_member
	.dwattr $C$DW$742, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$742, DW_AT_name("PingSize")
	.dwattr $C$DW$742, DW_AT_TI_symbol_name("PingSize")
	.dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$742, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$742, DW_AT_decl_line(0x141)
	.dwattr $C$DW$742, DW_AT_decl_column(0x0d)

$C$DW$743	.dwtag  DW_TAG_member
	.dwattr $C$DW$743, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$743, DW_AT_name("PingRequestTimeout")
	.dwattr $C$DW$743, DW_AT_TI_symbol_name("PingRequestTimeout")
	.dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$743, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$743, DW_AT_decl_line(0x142)
	.dwattr $C$DW$743, DW_AT_decl_column(0x0d)

$C$DW$744	.dwtag  DW_TAG_member
	.dwattr $C$DW$744, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$744, DW_AT_name("TotalNumberOfAttempts")
	.dwattr $C$DW$744, DW_AT_TI_symbol_name("TotalNumberOfAttempts")
	.dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$744, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$744, DW_AT_decl_line(0x143)
	.dwattr $C$DW$744, DW_AT_decl_column(0x0d)

$C$DW$745	.dwtag  DW_TAG_member
	.dwattr $C$DW$745, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$745, DW_AT_name("Flags")
	.dwattr $C$DW$745, DW_AT_TI_symbol_name("Flags")
	.dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$745, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$745, DW_AT_decl_line(0x144)
	.dwattr $C$DW$745, DW_AT_decl_column(0x0d)

$C$DW$746	.dwtag  DW_TAG_member
	.dwattr $C$DW$746, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$746, DW_AT_name("Ip")
	.dwattr $C$DW$746, DW_AT_TI_symbol_name("Ip")
	.dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$746, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$746, DW_AT_decl_line(0x145)
	.dwattr $C$DW$746, DW_AT_decl_column(0x0d)

$C$DW$747	.dwtag  DW_TAG_member
	.dwattr $C$DW$747, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$747, DW_AT_name("Ip1OrPadding")
	.dwattr $C$DW$747, DW_AT_TI_symbol_name("Ip1OrPadding")
	.dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$747, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$747, DW_AT_decl_line(0x146)
	.dwattr $C$DW$747, DW_AT_decl_column(0x0d)

$C$DW$748	.dwtag  DW_TAG_member
	.dwattr $C$DW$748, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$748, DW_AT_name("Ip2OrPadding")
	.dwattr $C$DW$748, DW_AT_TI_symbol_name("Ip2OrPadding")
	.dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$748, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$748, DW_AT_decl_line(0x147)
	.dwattr $C$DW$748, DW_AT_decl_column(0x0d)

$C$DW$749	.dwtag  DW_TAG_member
	.dwattr $C$DW$749, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$749, DW_AT_name("Ip3OrPadding")
	.dwattr $C$DW$749, DW_AT_TI_symbol_name("Ip3OrPadding")
	.dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$749, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$749, DW_AT_decl_line(0x148)
	.dwattr $C$DW$749, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$24, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x13f)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$24

$C$DW$T$591	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$591, DW_AT_name("SlNetAppPingCommand_t")
	.dwattr $C$DW$T$591, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$591, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$591, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$591, DW_AT_decl_line(0x149)
	.dwattr $C$DW$T$591, DW_AT_decl_column(0x02)

$C$DW$T$592	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$592, DW_AT_type(*$C$DW$T$591)

$C$DW$T$593	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$593, DW_AT_type(*$C$DW$T$592)
	.dwattr $C$DW$T$593, DW_AT_address_class(0x20)


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
$C$DW$750	.dwtag  DW_TAG_member
	.dwattr $C$DW$750, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$750, DW_AT_name("PacketsSent")
	.dwattr $C$DW$750, DW_AT_TI_symbol_name("PacketsSent")
	.dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$750, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$750, DW_AT_decl_line(0x136)
	.dwattr $C$DW$750, DW_AT_decl_column(0x0d)

$C$DW$751	.dwtag  DW_TAG_member
	.dwattr $C$DW$751, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$751, DW_AT_name("PacketsReceived")
	.dwattr $C$DW$751, DW_AT_TI_symbol_name("PacketsReceived")
	.dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$751, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$751, DW_AT_decl_line(0x137)
	.dwattr $C$DW$751, DW_AT_decl_column(0x0d)

$C$DW$752	.dwtag  DW_TAG_member
	.dwattr $C$DW$752, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$752, DW_AT_name("MinRoundTime")
	.dwattr $C$DW$752, DW_AT_TI_symbol_name("MinRoundTime")
	.dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$752, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$752, DW_AT_decl_line(0x138)
	.dwattr $C$DW$752, DW_AT_decl_column(0x0d)

$C$DW$753	.dwtag  DW_TAG_member
	.dwattr $C$DW$753, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$753, DW_AT_name("MaxRoundTime")
	.dwattr $C$DW$753, DW_AT_TI_symbol_name("MaxRoundTime")
	.dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$753, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$753, DW_AT_decl_line(0x139)
	.dwattr $C$DW$753, DW_AT_decl_column(0x0d)

$C$DW$754	.dwtag  DW_TAG_member
	.dwattr $C$DW$754, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$754, DW_AT_name("AvgRoundTime")
	.dwattr $C$DW$754, DW_AT_TI_symbol_name("AvgRoundTime")
	.dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$754, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$754, DW_AT_decl_line(0x13a)
	.dwattr $C$DW$754, DW_AT_decl_column(0x0d)

$C$DW$755	.dwtag  DW_TAG_member
	.dwattr $C$DW$755, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$755, DW_AT_name("TestTime")
	.dwattr $C$DW$755, DW_AT_TI_symbol_name("TestTime")
	.dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$755, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$755, DW_AT_decl_line(0x13b)
	.dwattr $C$DW$755, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x135)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$25

$C$DW$T$595	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$595, DW_AT_name("SlNetAppPingReport_t")
	.dwattr $C$DW$T$595, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$595, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$595, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$595, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$T$595, DW_AT_decl_column(0x02)

$C$DW$T$596	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$596, DW_AT_type(*$C$DW$T$595)
	.dwattr $C$DW$T$596, DW_AT_address_class(0x20)


$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_byte_size(0x28)
$C$DW$756	.dwtag  DW_TAG_member
	.dwattr $C$DW$756, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$756, DW_AT_name("SsidLen")
	.dwattr $C$DW$756, DW_AT_TI_symbol_name("SsidLen")
	.dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$756, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$756, DW_AT_decl_line(0x249)
	.dwattr $C$DW$756, DW_AT_decl_column(0x0d)

$C$DW$757	.dwtag  DW_TAG_member
	.dwattr $C$DW$757, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$757, DW_AT_name("SsidName")
	.dwattr $C$DW$757, DW_AT_TI_symbol_name("SsidName")
	.dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$757, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$757, DW_AT_decl_line(0x24a)
	.dwattr $C$DW$757, DW_AT_decl_column(0x0d)

$C$DW$758	.dwtag  DW_TAG_member
	.dwattr $C$DW$758, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$758, DW_AT_name("Bssid")
	.dwattr $C$DW$758, DW_AT_TI_symbol_name("Bssid")
	.dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$758, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$758, DW_AT_decl_line(0x24b)
	.dwattr $C$DW$758, DW_AT_decl_column(0x0d)

$C$DW$759	.dwtag  DW_TAG_member
	.dwattr $C$DW$759, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$759, DW_AT_name("Channel")
	.dwattr $C$DW$759, DW_AT_TI_symbol_name("Channel")
	.dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$759, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$759, DW_AT_decl_line(0x24c)
	.dwattr $C$DW$759, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$28, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x248)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$28

$C$DW$T$255	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$255, DW_AT_name("SlWlanEventConnect_t")
	.dwattr $C$DW$T$255, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$255, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$255, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$255, DW_AT_decl_line(0x24d)
	.dwattr $C$DW$T$255, DW_AT_decl_column(0x03)


$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_byte_size(0x4c)
$C$DW$760	.dwtag  DW_TAG_member
	.dwattr $C$DW$760, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$760, DW_AT_name("SsidLen")
	.dwattr $C$DW$760, DW_AT_TI_symbol_name("SsidLen")
	.dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$760, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$760, DW_AT_decl_line(0x260)
	.dwattr $C$DW$760, DW_AT_decl_column(0x0d)

$C$DW$761	.dwtag  DW_TAG_member
	.dwattr $C$DW$761, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$761, DW_AT_name("SsidName")
	.dwattr $C$DW$761, DW_AT_TI_symbol_name("SsidName")
	.dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$761, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$761, DW_AT_decl_line(0x261)
	.dwattr $C$DW$761, DW_AT_decl_column(0x0d)

$C$DW$762	.dwtag  DW_TAG_member
	.dwattr $C$DW$762, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$762, DW_AT_name("Bssid")
	.dwattr $C$DW$762, DW_AT_TI_symbol_name("Bssid")
	.dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$762, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$762, DW_AT_decl_line(0x262)
	.dwattr $C$DW$762, DW_AT_decl_column(0x0d)

$C$DW$763	.dwtag  DW_TAG_member
	.dwattr $C$DW$763, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$763, DW_AT_name("Reserved")
	.dwattr $C$DW$763, DW_AT_TI_symbol_name("Reserved")
	.dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$763, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$763, DW_AT_decl_line(0x263)
	.dwattr $C$DW$763, DW_AT_decl_column(0x0d)

$C$DW$764	.dwtag  DW_TAG_member
	.dwattr $C$DW$764, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$764, DW_AT_name("GoDeviceNameLen")
	.dwattr $C$DW$764, DW_AT_TI_symbol_name("GoDeviceNameLen")
	.dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$764, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$764, DW_AT_decl_line(0x264)
	.dwattr $C$DW$764, DW_AT_decl_column(0x0d)

$C$DW$765	.dwtag  DW_TAG_member
	.dwattr $C$DW$765, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$765, DW_AT_name("GoDeviceName")
	.dwattr $C$DW$765, DW_AT_TI_symbol_name("GoDeviceName")
	.dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$765, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$765, DW_AT_decl_line(0x265)
	.dwattr $C$DW$765, DW_AT_decl_column(0x0d)

$C$DW$766	.dwtag  DW_TAG_member
	.dwattr $C$DW$766, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$766, DW_AT_name("Padding")
	.dwattr $C$DW$766, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$766, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$766, DW_AT_decl_line(0x266)
	.dwattr $C$DW$766, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$30, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x25f)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$30

$C$DW$T$256	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$256, DW_AT_name("SlWlanEventP2PConnect_t")
	.dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$256, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$256, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$256, DW_AT_decl_line(0x267)
	.dwattr $C$DW$T$256, DW_AT_decl_column(0x03)


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x50)
$C$DW$767	.dwtag  DW_TAG_member
	.dwattr $C$DW$767, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$767, DW_AT_name("Mode")
	.dwattr $C$DW$767, DW_AT_TI_symbol_name("Mode")
	.dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$767, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$767, DW_AT_decl_line(0x315)
	.dwattr $C$DW$767, DW_AT_decl_column(0x09)

$C$DW$768	.dwtag  DW_TAG_member
	.dwattr $C$DW$768, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$768, DW_AT_name("ConnStatus")
	.dwattr $C$DW$768, DW_AT_TI_symbol_name("ConnStatus")
	.dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$768, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$768, DW_AT_decl_line(0x316)
	.dwattr $C$DW$768, DW_AT_decl_column(0x09)

$C$DW$769	.dwtag  DW_TAG_member
	.dwattr $C$DW$769, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$769, DW_AT_name("SecType")
	.dwattr $C$DW$769, DW_AT_TI_symbol_name("SecType")
	.dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$769, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$769, DW_AT_decl_line(0x317)
	.dwattr $C$DW$769, DW_AT_decl_column(0x09)

$C$DW$770	.dwtag  DW_TAG_member
	.dwattr $C$DW$770, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$770, DW_AT_name("Reserved")
	.dwattr $C$DW$770, DW_AT_TI_symbol_name("Reserved")
	.dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$770, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$770, DW_AT_decl_line(0x318)
	.dwattr $C$DW$770, DW_AT_decl_column(0x09)

$C$DW$771	.dwtag  DW_TAG_member
	.dwattr $C$DW$771, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$771, DW_AT_name("ConnectionInfo")
	.dwattr $C$DW$771, DW_AT_TI_symbol_name("ConnectionInfo")
	.dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$771, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$771, DW_AT_decl_line(0x319)
	.dwattr $C$DW$771, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$32, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x314)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$32

$C$DW$T$597	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$597, DW_AT_name("SlWlanConnStatusParam_t")
	.dwattr $C$DW$T$597, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$597, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$597, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$597, DW_AT_decl_line(0x31a)
	.dwattr $C$DW$T$597, DW_AT_decl_column(0x02)


$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
$C$DW$772	.dwtag  DW_TAG_member
	.dwattr $C$DW$772, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$772, DW_AT_name("__max_align1")
	.dwattr $C$DW$772, DW_AT_TI_symbol_name("__max_align1")
	.dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$772, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$772, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$772, DW_AT_decl_column(0x0c)

$C$DW$773	.dwtag  DW_TAG_member
	.dwattr $C$DW$773, DW_AT_type(*$C$DW$T$18)
	.dwattr $C$DW$773, DW_AT_name("__max_align2")
	.dwattr $C$DW$773, DW_AT_TI_symbol_name("__max_align2")
	.dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$773, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$773, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$773, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$33, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$33

$C$DW$T$599	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$599, DW_AT_name("__max_align_t")
	.dwattr $C$DW$T$599, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$599, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$599, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/sys/_types.h")
	.dwattr $C$DW$T$599, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$T$599, DW_AT_decl_column(0x03)


$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
$C$DW$774	.dwtag  DW_TAG_member
	.dwattr $C$DW$774, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$774, DW_AT_name("hi")
	.dwattr $C$DW$774, DW_AT_TI_symbol_name("hi")
	.dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$774, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h")
	.dwattr $C$DW$774, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$774, DW_AT_decl_column(0x0e)

$C$DW$775	.dwtag  DW_TAG_member
	.dwattr $C$DW$775, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$775, DW_AT_name("lo")
	.dwattr $C$DW$775, DW_AT_TI_symbol_name("lo")
	.dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$775, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h")
	.dwattr $C$DW$775, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$775, DW_AT_decl_column(0x0e)

	.dwattr $C$DW$T$36, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$36

$C$DW$T$600	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$600, DW_AT_name("ClockP_FreqHz")
	.dwattr $C$DW$T$600, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$600, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$600, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h")
	.dwattr $C$DW$T$600, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$T$600, DW_AT_decl_column(0x03)


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
$C$DW$776	.dwtag  DW_TAG_member
	.dwattr $C$DW$776, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$776, DW_AT_name("startFlag")
	.dwattr $C$DW$776, DW_AT_TI_symbol_name("startFlag")
	.dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$776, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h")
	.dwattr $C$DW$776, DW_AT_decl_line(0x8c)
	.dwattr $C$DW$776, DW_AT_decl_column(0x0f)

$C$DW$777	.dwtag  DW_TAG_member
	.dwattr $C$DW$777, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$777, DW_AT_name("period")
	.dwattr $C$DW$777, DW_AT_TI_symbol_name("period")
	.dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$777, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h")
	.dwattr $C$DW$777, DW_AT_decl_line(0x8d)
	.dwattr $C$DW$777, DW_AT_decl_column(0x0f)

$C$DW$778	.dwtag  DW_TAG_member
	.dwattr $C$DW$778, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$778, DW_AT_name("arg")
	.dwattr $C$DW$778, DW_AT_TI_symbol_name("arg")
	.dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$778, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h")
	.dwattr $C$DW$778, DW_AT_decl_line(0x8e)
	.dwattr $C$DW$778, DW_AT_decl_column(0x0f)

	.dwattr $C$DW$T$40, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x8b)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$40

$C$DW$T$601	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$601, DW_AT_name("ClockP_Params")
	.dwattr $C$DW$T$601, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$601, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$601, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h")
	.dwattr $C$DW$T$601, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$601, DW_AT_decl_column(0x03)


$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x10)
$C$DW$779	.dwtag  DW_TAG_member
	.dwattr $C$DW$779, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$779, DW_AT_name("daylight")
	.dwattr $C$DW$779, DW_AT_TI_symbol_name("daylight")
	.dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$779, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/../include/time.h")
	.dwattr $C$DW$779, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$779, DW_AT_decl_column(0x0b)

$C$DW$780	.dwtag  DW_TAG_member
	.dwattr $C$DW$780, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$780, DW_AT_name("timezone")
	.dwattr $C$DW$780, DW_AT_TI_symbol_name("timezone")
	.dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$780, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/../include/time.h")
	.dwattr $C$DW$780, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$780, DW_AT_decl_column(0x0b)

$C$DW$781	.dwtag  DW_TAG_member
	.dwattr $C$DW$781, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$781, DW_AT_name("tzname")
	.dwattr $C$DW$781, DW_AT_TI_symbol_name("tzname")
	.dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$781, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/../include/time.h")
	.dwattr $C$DW$781, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$781, DW_AT_decl_column(0x0b)

$C$DW$782	.dwtag  DW_TAG_member
	.dwattr $C$DW$782, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$782, DW_AT_name("dstname")
	.dwattr $C$DW$782, DW_AT_TI_symbol_name("dstname")
	.dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$782, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/../include/time.h")
	.dwattr $C$DW$782, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$782, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$43, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/../include/time.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x9a)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$43

$C$DW$T$602	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$602, DW_AT_name("TZ")
	.dwattr $C$DW$T$602, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$602, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$602, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/../include/time.h")
	.dwattr $C$DW$T$602, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$T$602, DW_AT_decl_column(0x03)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x08)
$C$DW$783	.dwtag  DW_TAG_member
	.dwattr $C$DW$783, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$783, DW_AT_name("pEntry")
	.dwattr $C$DW$783, DW_AT_TI_symbol_name("pEntry")
	.dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$783, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/porting/cc_pal.h")
	.dwattr $C$DW$783, DW_AT_decl_line(0x80)
	.dwattr $C$DW$783, DW_AT_decl_column(0x16)

$C$DW$784	.dwtag  DW_TAG_member
	.dwattr $C$DW$784, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$784, DW_AT_name("pValue")
	.dwattr $C$DW$784, DW_AT_TI_symbol_name("pValue")
	.dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$784, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/porting/cc_pal.h")
	.dwattr $C$DW$784, DW_AT_decl_line(0x81)
	.dwattr $C$DW$784, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$47, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/porting/cc_pal.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$47

$C$DW$T$603	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$603, DW_AT_name("tSimpleLinkSpawnMsg")
	.dwattr $C$DW$T$603, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$603, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$603, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/porting/cc_pal.h")
	.dwattr $C$DW$T$603, DW_AT_decl_line(0x82)
	.dwattr $C$DW$T$603, DW_AT_decl_column(0x02)


$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x08)
$C$DW$785	.dwtag  DW_TAG_member
	.dwattr $C$DW$785, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$785, DW_AT_name("quot")
	.dwattr $C$DW$785, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$785, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$785, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$785, DW_AT_decl_column(0x16)

$C$DW$786	.dwtag  DW_TAG_member
	.dwattr $C$DW$786, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$786, DW_AT_name("rem")
	.dwattr $C$DW$786, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$786, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$786, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$786, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$48, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$48

$C$DW$T$604	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$604, DW_AT_name("div_t")
	.dwattr $C$DW$T$604, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$604, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$604, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$604, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$604, DW_AT_decl_column(0x23)


$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x08)
$C$DW$787	.dwtag  DW_TAG_member
	.dwattr $C$DW$787, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$787, DW_AT_name("quot")
	.dwattr $C$DW$787, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$787, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$787, DW_AT_decl_line(0x53)
	.dwattr $C$DW$787, DW_AT_decl_column(0x16)

$C$DW$788	.dwtag  DW_TAG_member
	.dwattr $C$DW$788, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$788, DW_AT_name("rem")
	.dwattr $C$DW$788, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$788, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$788, DW_AT_decl_line(0x53)
	.dwattr $C$DW$788, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$49, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$49

$C$DW$T$605	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$605, DW_AT_name("ldiv_t")
	.dwattr $C$DW$T$605, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$605, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$605, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$605, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$605, DW_AT_decl_column(0x23)


$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x10)
$C$DW$789	.dwtag  DW_TAG_member
	.dwattr $C$DW$789, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$789, DW_AT_name("quot")
	.dwattr $C$DW$789, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$789, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$789, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$789, DW_AT_decl_column(0x1c)

$C$DW$790	.dwtag  DW_TAG_member
	.dwattr $C$DW$790, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$790, DW_AT_name("rem")
	.dwattr $C$DW$790, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$790, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$790, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$790, DW_AT_decl_column(0x22)

	.dwattr $C$DW$T$50, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
	.dwendtag $C$DW$T$50

$C$DW$T$606	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$606, DW_AT_name("lldiv_t")
	.dwattr $C$DW$T$606, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$606, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$606, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LTS/include/stdlib.h")
	.dwattr $C$DW$T$606, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$606, DW_AT_decl_column(0x29)


$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x24)
$C$DW$791	.dwtag  DW_TAG_member
	.dwattr $C$DW$791, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$791, DW_AT_name("Flags")
	.dwattr $C$DW$791, DW_AT_TI_symbol_name("Flags")
	.dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$791, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$791, DW_AT_decl_line(0x90)
	.dwattr $C$DW$791, DW_AT_decl_column(0x0b)

$C$DW$792	.dwtag  DW_TAG_member
	.dwattr $C$DW$792, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$792, DW_AT_name("Len")
	.dwattr $C$DW$792, DW_AT_TI_symbol_name("Len")
	.dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$792, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$792, DW_AT_decl_line(0x91)
	.dwattr $C$DW$792, DW_AT_decl_column(0x0b)

$C$DW$793	.dwtag  DW_TAG_member
	.dwattr $C$DW$793, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$793, DW_AT_name("MaxSize")
	.dwattr $C$DW$793, DW_AT_TI_symbol_name("MaxSize")
	.dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$793, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$793, DW_AT_decl_line(0x92)
	.dwattr $C$DW$793, DW_AT_decl_column(0x0b)

$C$DW$794	.dwtag  DW_TAG_member
	.dwattr $C$DW$794, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$794, DW_AT_name("Token")
	.dwattr $C$DW$794, DW_AT_TI_symbol_name("Token")
	.dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$794, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$794, DW_AT_decl_line(0x93)
	.dwattr $C$DW$794, DW_AT_decl_column(0x0b)

$C$DW$795	.dwtag  DW_TAG_member
	.dwattr $C$DW$795, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$795, DW_AT_name("StorageSize")
	.dwattr $C$DW$795, DW_AT_TI_symbol_name("StorageSize")
	.dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$795, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$795, DW_AT_decl_line(0x94)
	.dwattr $C$DW$795, DW_AT_decl_column(0x0b)

$C$DW$796	.dwtag  DW_TAG_member
	.dwattr $C$DW$796, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$796, DW_AT_name("WriteCounter")
	.dwattr $C$DW$796, DW_AT_TI_symbol_name("WriteCounter")
	.dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$796, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$796, DW_AT_decl_line(0x95)
	.dwattr $C$DW$796, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$52, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x8f)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$52

$C$DW$T$607	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$607, DW_AT_name("SlFsFileInfo_t")
	.dwattr $C$DW$T$607, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$607, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$607, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$607, DW_AT_decl_line(0x96)
	.dwattr $C$DW$T$607, DW_AT_decl_column(0x02)


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x10)
$C$DW$797	.dwtag  DW_TAG_member
	.dwattr $C$DW$797, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$797, DW_AT_name("Key")
	.dwattr $C$DW$797, DW_AT_TI_symbol_name("Key")
	.dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$797, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$797, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$797, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$53, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0xb0)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$53

$C$DW$T$608	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$608, DW_AT_name("SlFsKey_t")
	.dwattr $C$DW$T$608, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$608, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$608, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$608, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$T$608, DW_AT_decl_column(0x02)


$C$DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
$C$DW$798	.dwtag  DW_TAG_member
	.dwattr $C$DW$798, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$798, DW_AT_name("Index")
	.dwattr $C$DW$798, DW_AT_TI_symbol_name("Index")
	.dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$798, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$798, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$798, DW_AT_decl_column(0x09)

	.dwattr $C$DW$T$54, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$54

$C$DW$T$263	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$263, DW_AT_name("SlFsFileNameIndex_t")
	.dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$263, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$263, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$T$263, DW_AT_decl_column(0x02)


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
$C$DW$799	.dwtag  DW_TAG_member
	.dwattr $C$DW$799, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$799, DW_AT_name("Operation")
	.dwattr $C$DW$799, DW_AT_TI_symbol_name("Operation")
	.dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$799, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$799, DW_AT_decl_line(0xca)
	.dwattr $C$DW$799, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$55, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$55

$C$DW$T$609	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$609, DW_AT_name("SlFsRetToFactoryCommand_t")
	.dwattr $C$DW$T$609, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$609, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$609, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$609, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$T$609, DW_AT_decl_column(0x02)


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
$C$DW$800	.dwtag  DW_TAG_member
	.dwattr $C$DW$800, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$800, DW_AT_name("IncludeFilters")
	.dwattr $C$DW$800, DW_AT_TI_symbol_name("IncludeFilters")
	.dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$800, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$800, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$800, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$56, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0xd0)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$56

$C$DW$T$610	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$610, DW_AT_name("SlFsControl_t")
	.dwattr $C$DW$T$610, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$610, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$610, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$610, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$610, DW_AT_decl_column(0x02)


$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
$C$DW$801	.dwtag  DW_TAG_member
	.dwattr $C$DW$801, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$801, DW_AT_name("DeviceBlockSize")
	.dwattr $C$DW$801, DW_AT_TI_symbol_name("DeviceBlockSize")
	.dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$801, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$801, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$801, DW_AT_decl_column(0x08)

$C$DW$802	.dwtag  DW_TAG_member
	.dwattr $C$DW$802, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$802, DW_AT_name("DeviceBlocksCapacity")
	.dwattr $C$DW$802, DW_AT_TI_symbol_name("DeviceBlocksCapacity")
	.dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$802, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$802, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$802, DW_AT_decl_column(0x08)

$C$DW$803	.dwtag  DW_TAG_member
	.dwattr $C$DW$803, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$803, DW_AT_name("NumOfAllocatedBlocks")
	.dwattr $C$DW$803, DW_AT_TI_symbol_name("NumOfAllocatedBlocks")
	.dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$803, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$803, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$803, DW_AT_decl_column(0x08)

$C$DW$804	.dwtag  DW_TAG_member
	.dwattr $C$DW$804, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$804, DW_AT_name("NumOfReservedBlocks")
	.dwattr $C$DW$804, DW_AT_TI_symbol_name("NumOfReservedBlocks")
	.dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$804, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$804, DW_AT_decl_line(0xda)
	.dwattr $C$DW$804, DW_AT_decl_column(0x08)

$C$DW$805	.dwtag  DW_TAG_member
	.dwattr $C$DW$805, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$805, DW_AT_name("NumOfReservedBlocksForSystemfiles")
	.dwattr $C$DW$805, DW_AT_TI_symbol_name("NumOfReservedBlocksForSystemfiles")
	.dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$805, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$805, DW_AT_decl_line(0xdb)
	.dwattr $C$DW$805, DW_AT_decl_column(0x08)

$C$DW$806	.dwtag  DW_TAG_member
	.dwattr $C$DW$806, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$806, DW_AT_name("LargestAllocatedGapInBlocks")
	.dwattr $C$DW$806, DW_AT_TI_symbol_name("LargestAllocatedGapInBlocks")
	.dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$806, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$806, DW_AT_decl_line(0xdc)
	.dwattr $C$DW$806, DW_AT_decl_column(0x08)

$C$DW$807	.dwtag  DW_TAG_member
	.dwattr $C$DW$807, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$807, DW_AT_name("NumOfAvailableBlocksForUserFiles")
	.dwattr $C$DW$807, DW_AT_TI_symbol_name("NumOfAvailableBlocksForUserFiles")
	.dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$807, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$807, DW_AT_decl_line(0xdd)
	.dwattr $C$DW$807, DW_AT_decl_column(0x08)

$C$DW$808	.dwtag  DW_TAG_member
	.dwattr $C$DW$808, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$808, DW_AT_name("Padding")
	.dwattr $C$DW$808, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$808, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$808, DW_AT_decl_line(0xde)
	.dwattr $C$DW$808, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$58, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$58

$C$DW$T$60	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$60, DW_AT_name("SlFsControlDeviceUsage_t")
	.dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$60, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0xdf)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x03)


$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x14)
$C$DW$809	.dwtag  DW_TAG_member
	.dwattr $C$DW$809, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$809, DW_AT_name("MaxFsFiles")
	.dwattr $C$DW$809, DW_AT_TI_symbol_name("MaxFsFiles")
	.dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$809, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$809, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$809, DW_AT_decl_column(0x08)

$C$DW$810	.dwtag  DW_TAG_member
	.dwattr $C$DW$810, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$810, DW_AT_name("IsDevlopmentFormatType")
	.dwattr $C$DW$810, DW_AT_TI_symbol_name("IsDevlopmentFormatType")
	.dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$810, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$810, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$810, DW_AT_decl_column(0x08)

$C$DW$811	.dwtag  DW_TAG_member
	.dwattr $C$DW$811, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$811, DW_AT_name("Bundlestate")
	.dwattr $C$DW$811, DW_AT_TI_symbol_name("Bundlestate")
	.dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$811, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$811, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$811, DW_AT_decl_column(0x08)

$C$DW$812	.dwtag  DW_TAG_member
	.dwattr $C$DW$812, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$812, DW_AT_name("Reserved")
	.dwattr $C$DW$812, DW_AT_TI_symbol_name("Reserved")
	.dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$812, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$812, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$812, DW_AT_decl_column(0x08)

$C$DW$813	.dwtag  DW_TAG_member
	.dwattr $C$DW$813, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$813, DW_AT_name("MaxFsFilesReservedForSysFiles")
	.dwattr $C$DW$813, DW_AT_TI_symbol_name("MaxFsFilesReservedForSysFiles")
	.dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$813, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$813, DW_AT_decl_line(0xe7)
	.dwattr $C$DW$813, DW_AT_decl_column(0x08)

$C$DW$814	.dwtag  DW_TAG_member
	.dwattr $C$DW$814, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$814, DW_AT_name("ActualNumOfUserFiles")
	.dwattr $C$DW$814, DW_AT_TI_symbol_name("ActualNumOfUserFiles")
	.dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$814, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$814, DW_AT_decl_line(0xe8)
	.dwattr $C$DW$814, DW_AT_decl_column(0x08)

$C$DW$815	.dwtag  DW_TAG_member
	.dwattr $C$DW$815, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$815, DW_AT_name("ActualNumOfSysFiles")
	.dwattr $C$DW$815, DW_AT_TI_symbol_name("ActualNumOfSysFiles")
	.dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$815, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$815, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$815, DW_AT_decl_column(0x08)

$C$DW$816	.dwtag  DW_TAG_member
	.dwattr $C$DW$816, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$816, DW_AT_name("Padding")
	.dwattr $C$DW$816, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$816, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$816, DW_AT_decl_line(0xea)
	.dwattr $C$DW$816, DW_AT_decl_column(0x08)

$C$DW$817	.dwtag  DW_TAG_member
	.dwattr $C$DW$817, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$817, DW_AT_name("NumOfAlerts")
	.dwattr $C$DW$817, DW_AT_TI_symbol_name("NumOfAlerts")
	.dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$817, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$817, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$817, DW_AT_decl_column(0x08)

$C$DW$818	.dwtag  DW_TAG_member
	.dwattr $C$DW$818, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$818, DW_AT_name("NumOfAlertsThreshold")
	.dwattr $C$DW$818, DW_AT_TI_symbol_name("NumOfAlertsThreshold")
	.dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$818, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$818, DW_AT_decl_line(0xec)
	.dwattr $C$DW$818, DW_AT_decl_column(0x08)

$C$DW$819	.dwtag  DW_TAG_member
	.dwattr $C$DW$819, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$819, DW_AT_name("FATWriteCounter")
	.dwattr $C$DW$819, DW_AT_TI_symbol_name("FATWriteCounter")
	.dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$819, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$819, DW_AT_decl_line(0xed)
	.dwattr $C$DW$819, DW_AT_decl_column(0x08)

$C$DW$820	.dwtag  DW_TAG_member
	.dwattr $C$DW$820, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$820, DW_AT_name("Padding2")
	.dwattr $C$DW$820, DW_AT_TI_symbol_name("Padding2")
	.dwattr $C$DW$820, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
	.dwattr $C$DW$820, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$820, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$820, DW_AT_decl_line(0xee)
	.dwattr $C$DW$820, DW_AT_decl_column(0x08)

	.dwattr $C$DW$T$59, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0xe2)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$59

$C$DW$T$61	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$61, DW_AT_name("SlFsControlFilesUsage_t")
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$61, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$61, DW_AT_decl_line(0xef)
	.dwattr $C$DW$T$61, DW_AT_decl_column(0x02)


$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x24)
$C$DW$821	.dwtag  DW_TAG_member
	.dwattr $C$DW$821, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$821, DW_AT_name("DeviceUsage")
	.dwattr $C$DW$821, DW_AT_TI_symbol_name("DeviceUsage")
	.dwattr $C$DW$821, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$821, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$821, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$821, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$821, DW_AT_decl_column(0x1e)

$C$DW$822	.dwtag  DW_TAG_member
	.dwattr $C$DW$822, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$822, DW_AT_name("FilesUsage")
	.dwattr $C$DW$822, DW_AT_TI_symbol_name("FilesUsage")
	.dwattr $C$DW$822, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$822, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$822, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$822, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$822, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$62, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$62

$C$DW$T$611	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$611, DW_AT_name("SlFsControlGetStorageInfoResponse_t")
	.dwattr $C$DW$T$611, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$611, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$611, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$611, DW_AT_decl_line(0xf6)
	.dwattr $C$DW$T$611, DW_AT_decl_column(0x03)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x0c)
$C$DW$823	.dwtag  DW_TAG_member
	.dwattr $C$DW$823, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$823, DW_AT_name("IncludeFilters")
	.dwattr $C$DW$823, DW_AT_TI_symbol_name("IncludeFilters")
	.dwattr $C$DW$823, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$823, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$823, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$823, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$823, DW_AT_decl_column(0x0b)

$C$DW$824	.dwtag  DW_TAG_member
	.dwattr $C$DW$824, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$824, DW_AT_name("OpenedForWriteCnt")
	.dwattr $C$DW$824, DW_AT_TI_symbol_name("OpenedForWriteCnt")
	.dwattr $C$DW$824, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$824, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$824, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$824, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$824, DW_AT_decl_column(0x0b)

$C$DW$825	.dwtag  DW_TAG_member
	.dwattr $C$DW$825, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$825, DW_AT_name("OpeneForReadCnt")
	.dwattr $C$DW$825, DW_AT_TI_symbol_name("OpeneForReadCnt")
	.dwattr $C$DW$825, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
	.dwattr $C$DW$825, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$825, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$825, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$825, DW_AT_decl_column(0x0b)

$C$DW$826	.dwtag  DW_TAG_member
	.dwattr $C$DW$826, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$826, DW_AT_name("ClosedFilesCnt")
	.dwattr $C$DW$826, DW_AT_TI_symbol_name("ClosedFilesCnt")
	.dwattr $C$DW$826, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$826, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$826, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$826, DW_AT_decl_line(0xfd)
	.dwattr $C$DW$826, DW_AT_decl_column(0x0b)

$C$DW$827	.dwtag  DW_TAG_member
	.dwattr $C$DW$827, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$827, DW_AT_name("OpenedForWriteCntWithValidFailSafeImage")
	.dwattr $C$DW$827, DW_AT_TI_symbol_name("OpenedForWriteCntWithValidFailSafeImage")
	.dwattr $C$DW$827, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$827, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$827, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$827, DW_AT_decl_line(0xfe)
	.dwattr $C$DW$827, DW_AT_decl_column(0x0b)

$C$DW$828	.dwtag  DW_TAG_member
	.dwattr $C$DW$828, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$828, DW_AT_name("OpeneForReadCntWithValidFailSafeImage")
	.dwattr $C$DW$828, DW_AT_TI_symbol_name("OpeneForReadCntWithValidFailSafeImage")
	.dwattr $C$DW$828, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$828, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$828, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$828, DW_AT_decl_line(0xff)
	.dwattr $C$DW$828, DW_AT_decl_column(0x0b)

$C$DW$829	.dwtag  DW_TAG_member
	.dwattr $C$DW$829, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$829, DW_AT_name("ClosedFilesCntWithValidFailSafeImage")
	.dwattr $C$DW$829, DW_AT_TI_symbol_name("ClosedFilesCntWithValidFailSafeImage")
	.dwattr $C$DW$829, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
	.dwattr $C$DW$829, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$829, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$829, DW_AT_decl_line(0x100)
	.dwattr $C$DW$829, DW_AT_decl_column(0x0b)

$C$DW$830	.dwtag  DW_TAG_member
	.dwattr $C$DW$830, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$830, DW_AT_name("padding")
	.dwattr $C$DW$830, DW_AT_TI_symbol_name("padding")
	.dwattr $C$DW$830, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$830, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$830, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$830, DW_AT_decl_line(0x101)
	.dwattr $C$DW$830, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$63, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$63

$C$DW$T$612	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$612, DW_AT_name("SlFsControlGetCountersResponse_t")
	.dwattr $C$DW$T$612, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$612, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$612, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$612, DW_AT_decl_line(0x102)
	.dwattr $C$DW$T$612, DW_AT_decl_column(0x03)


$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_byte_size(0x0c)
$C$DW$831	.dwtag  DW_TAG_member
	.dwattr $C$DW$831, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$831, DW_AT_name("FileMaxSize")
	.dwattr $C$DW$831, DW_AT_TI_symbol_name("FileMaxSize")
	.dwattr $C$DW$831, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$831, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$831, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$831, DW_AT_decl_line(0x111)
	.dwattr $C$DW$831, DW_AT_decl_column(0x0a)

$C$DW$832	.dwtag  DW_TAG_member
	.dwattr $C$DW$832, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$832, DW_AT_name("Properties")
	.dwattr $C$DW$832, DW_AT_TI_symbol_name("Properties")
	.dwattr $C$DW$832, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$832, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$832, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$832, DW_AT_decl_line(0x112)
	.dwattr $C$DW$832, DW_AT_decl_column(0x0a)

$C$DW$833	.dwtag  DW_TAG_member
	.dwattr $C$DW$833, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$833, DW_AT_name("FileAllocatedBlocks")
	.dwattr $C$DW$833, DW_AT_TI_symbol_name("FileAllocatedBlocks")
	.dwattr $C$DW$833, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$833, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$833, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$833, DW_AT_decl_line(0x113)
	.dwattr $C$DW$833, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$64, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$64, DW_AT_decl_line(0x110)
	.dwattr $C$DW$T$64, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$64

$C$DW$T$613	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$613, DW_AT_name("SlFileAttributes_t")
	.dwattr $C$DW$T$613, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$T$613, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$613, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.h")
	.dwattr $C$DW$T$613, DW_AT_decl_line(0x114)
	.dwattr $C$DW$T$613, DW_AT_decl_column(0x02)


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
$C$DW$834	.dwtag  DW_TAG_member
	.dwattr $C$DW$834, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$834, DW_AT_name("KeepaliveEnabled")
	.dwattr $C$DW$834, DW_AT_TI_symbol_name("KeepaliveEnabled")
	.dwattr $C$DW$834, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$834, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$834, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$834, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$834, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$65, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$65

$C$DW$T$614	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$614, DW_AT_name("SlSockKeepalive_t")
	.dwattr $C$DW$T$614, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$614, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$614, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$614, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$614, DW_AT_decl_column(0x02)


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_byte_size(0x04)
$C$DW$835	.dwtag  DW_TAG_member
	.dwattr $C$DW$835, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$835, DW_AT_name("ReuseaddrEnabled")
	.dwattr $C$DW$835, DW_AT_TI_symbol_name("ReuseaddrEnabled")
	.dwattr $C$DW$835, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$835, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$835, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$835, DW_AT_decl_line(0x100)
	.dwattr $C$DW$835, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$66, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$66, DW_AT_decl_line(0xff)
	.dwattr $C$DW$T$66, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$66

$C$DW$T$615	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$615, DW_AT_name("SlSockReuseaddr_t")
	.dwattr $C$DW$T$615, DW_AT_type(*$C$DW$T$66)
	.dwattr $C$DW$T$615, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$615, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$615, DW_AT_decl_line(0x101)
	.dwattr $C$DW$T$615, DW_AT_decl_column(0x02)


$C$DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x04)
$C$DW$836	.dwtag  DW_TAG_member
	.dwattr $C$DW$836, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$836, DW_AT_name("RxIpNoBoundaryEnabled")
	.dwattr $C$DW$836, DW_AT_TI_symbol_name("RxIpNoBoundaryEnabled")
	.dwattr $C$DW$836, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$836, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$836, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$836, DW_AT_decl_line(0x105)
	.dwattr $C$DW$836, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$67, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$67, DW_AT_decl_line(0x104)
	.dwattr $C$DW$T$67, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$67

$C$DW$T$616	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$616, DW_AT_name("SlSockRxNoIpBoundary_t")
	.dwattr $C$DW$T$616, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$T$616, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$616, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$616, DW_AT_decl_line(0x106)
	.dwattr $C$DW$T$616, DW_AT_decl_column(0x03)


$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x04)
$C$DW$837	.dwtag  DW_TAG_member
	.dwattr $C$DW$837, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$837, DW_AT_name("WinSize")
	.dwattr $C$DW$837, DW_AT_TI_symbol_name("WinSize")
	.dwattr $C$DW$837, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$837, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$837, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$837, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$837, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$68, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0x109)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$68

$C$DW$T$617	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$617, DW_AT_name("SlSockWinsize_t")
	.dwattr $C$DW$T$617, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$617, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$617, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$617, DW_AT_decl_line(0x10b)
	.dwattr $C$DW$T$617, DW_AT_decl_column(0x02)


$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x04)
$C$DW$838	.dwtag  DW_TAG_member
	.dwattr $C$DW$838, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$838, DW_AT_name("NonBlockingEnabled")
	.dwattr $C$DW$838, DW_AT_TI_symbol_name("NonBlockingEnabled")
	.dwattr $C$DW$838, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$838, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$838, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$838, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$838, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$69, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x10e)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$69

$C$DW$T$618	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$618, DW_AT_name("SlSockNonblocking_t")
	.dwattr $C$DW$T$618, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$618, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$618, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$618, DW_AT_decl_line(0x110)
	.dwattr $C$DW$T$618, DW_AT_decl_column(0x02)


$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x84)
$C$DW$839	.dwtag  DW_TAG_member
	.dwattr $C$DW$839, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$839, DW_AT_name("Sd")
	.dwattr $C$DW$839, DW_AT_TI_symbol_name("Sd")
	.dwattr $C$DW$839, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$839, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$839, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$839, DW_AT_decl_line(0x114)
	.dwattr $C$DW$839, DW_AT_decl_column(0x0b)

$C$DW$840	.dwtag  DW_TAG_member
	.dwattr $C$DW$840, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$840, DW_AT_name("Type")
	.dwattr $C$DW$840, DW_AT_TI_symbol_name("Type")
	.dwattr $C$DW$840, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$840, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$840, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$840, DW_AT_decl_line(0x115)
	.dwattr $C$DW$840, DW_AT_decl_column(0x0b)

$C$DW$841	.dwtag  DW_TAG_member
	.dwattr $C$DW$841, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$841, DW_AT_name("Val")
	.dwattr $C$DW$841, DW_AT_TI_symbol_name("Val")
	.dwattr $C$DW$841, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$841, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$841, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$841, DW_AT_decl_line(0x116)
	.dwattr $C$DW$841, DW_AT_decl_column(0x0b)

$C$DW$842	.dwtag  DW_TAG_member
	.dwattr $C$DW$842, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$842, DW_AT_name("pExtraInfo")
	.dwattr $C$DW$842, DW_AT_TI_symbol_name("pExtraInfo")
	.dwattr $C$DW$842, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$842, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$842, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$842, DW_AT_decl_line(0x117)
	.dwattr $C$DW$842, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$71, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x113)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$71

$C$DW$T$267	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$267, DW_AT_name("SlSocketAsyncEvent_t")
	.dwattr $C$DW$T$267, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$T$267, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$267, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$267, DW_AT_decl_line(0x118)
	.dwattr $C$DW$T$267, DW_AT_decl_column(0x03)


$C$DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x04)
$C$DW$843	.dwtag  DW_TAG_member
	.dwattr $C$DW$843, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$843, DW_AT_name("Status")
	.dwattr $C$DW$843, DW_AT_TI_symbol_name("Status")
	.dwattr $C$DW$843, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$843, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$843, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$843, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$843, DW_AT_decl_column(0x10)

$C$DW$844	.dwtag  DW_TAG_member
	.dwattr $C$DW$844, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$844, DW_AT_name("Sd")
	.dwattr $C$DW$844, DW_AT_TI_symbol_name("Sd")
	.dwattr $C$DW$844, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$844, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$844, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$844, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$844, DW_AT_decl_column(0x10)

$C$DW$845	.dwtag  DW_TAG_member
	.dwattr $C$DW$845, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$845, DW_AT_name("Padding")
	.dwattr $C$DW$845, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$845, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$845, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$845, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$845, DW_AT_decl_line(0x11e)
	.dwattr $C$DW$845, DW_AT_decl_column(0x10)

	.dwattr $C$DW$T$72, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$72

$C$DW$T$266	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$266, DW_AT_name("SlSockTxFailEventData_t")
	.dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$266, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$266, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$266, DW_AT_decl_line(0x11f)
	.dwattr $C$DW$T$266, DW_AT_decl_column(0x03)


$C$DW$T$74	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$74, DW_AT_byte_size(0x88)
$C$DW$846	.dwtag  DW_TAG_member
	.dwattr $C$DW$846, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$846, DW_AT_name("Event")
	.dwattr $C$DW$846, DW_AT_TI_symbol_name("Event")
	.dwattr $C$DW$846, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$846, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$846, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$846, DW_AT_decl_line(0x12b)
	.dwattr $C$DW$846, DW_AT_decl_column(0x1c)

$C$DW$847	.dwtag  DW_TAG_member
	.dwattr $C$DW$847, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$847, DW_AT_name("SocketAsyncEvent")
	.dwattr $C$DW$847, DW_AT_TI_symbol_name("SocketAsyncEvent")
	.dwattr $C$DW$847, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$847, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$847, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$847, DW_AT_decl_line(0x12c)
	.dwattr $C$DW$847, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$74, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x12a)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$74

$C$DW$T$619	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$619, DW_AT_name("SlSockEvent_t")
	.dwattr $C$DW$T$619, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$619, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$619, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$619, DW_AT_decl_line(0x12d)
	.dwattr $C$DW$T$619, DW_AT_decl_column(0x03)


$C$DW$T$75	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$75, DW_AT_byte_size(0x08)
$C$DW$848	.dwtag  DW_TAG_member
	.dwattr $C$DW$848, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$848, DW_AT_name("Event")
	.dwattr $C$DW$848, DW_AT_TI_symbol_name("Event")
	.dwattr $C$DW$848, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$848, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$848, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$848, DW_AT_decl_line(0x131)
	.dwattr $C$DW$848, DW_AT_decl_column(0x11)

$C$DW$849	.dwtag  DW_TAG_member
	.dwattr $C$DW$849, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$849, DW_AT_name("EventData")
	.dwattr $C$DW$849, DW_AT_TI_symbol_name("EventData")
	.dwattr $C$DW$849, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$849, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$849, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$849, DW_AT_decl_line(0x132)
	.dwattr $C$DW$849, DW_AT_decl_column(0x11)

	.dwattr $C$DW$T$75, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x130)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$75

$C$DW$T$620	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$620, DW_AT_name("SlSockTriggerEvent_t")
	.dwattr $C$DW$T$620, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$620, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$620, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$620, DW_AT_decl_line(0x133)
	.dwattr $C$DW$T$620, DW_AT_decl_column(0x03)


$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x04)
$C$DW$850	.dwtag  DW_TAG_member
	.dwattr $C$DW$850, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$850, DW_AT_name("SecureALPN")
	.dwattr $C$DW$850, DW_AT_TI_symbol_name("SecureALPN")
	.dwattr $C$DW$850, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$850, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$850, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$850, DW_AT_decl_line(0x138)
	.dwattr $C$DW$850, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$76, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0x137)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$76

$C$DW$T$621	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$621, DW_AT_name("SlSockSecureALPN_t")
	.dwattr $C$DW$T$621, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$621, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$621, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$621, DW_AT_decl_line(0x139)
	.dwattr $C$DW$T$621, DW_AT_decl_column(0x03)


$C$DW$T$77	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$77, DW_AT_byte_size(0x04)
$C$DW$851	.dwtag  DW_TAG_member
	.dwattr $C$DW$851, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$851, DW_AT_name("SecureMask")
	.dwattr $C$DW$851, DW_AT_TI_symbol_name("SecureMask")
	.dwattr $C$DW$851, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$851, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$851, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$851, DW_AT_decl_line(0x13d)
	.dwattr $C$DW$851, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$77, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$77, DW_AT_decl_line(0x13c)
	.dwattr $C$DW$T$77, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$77

$C$DW$T$622	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$622, DW_AT_name("SlSockSecureMask_t")
	.dwattr $C$DW$T$622, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$622, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$622, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$622, DW_AT_decl_line(0x13e)
	.dwattr $C$DW$T$622, DW_AT_decl_column(0x03)


$C$DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$78, DW_AT_byte_size(0x01)
$C$DW$852	.dwtag  DW_TAG_member
	.dwattr $C$DW$852, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$852, DW_AT_name("SecureMethod")
	.dwattr $C$DW$852, DW_AT_TI_symbol_name("SecureMethod")
	.dwattr $C$DW$852, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$852, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$852, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$852, DW_AT_decl_line(0x142)
	.dwattr $C$DW$852, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$78, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x141)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$78

$C$DW$T$623	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$623, DW_AT_name("SlSockSecureMethod_t")
	.dwattr $C$DW$T$623, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$T$623, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$623, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$623, DW_AT_decl_line(0x143)
	.dwattr $C$DW$T$623, DW_AT_decl_column(0x03)


$C$DW$T$82	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$82, DW_AT_byte_size(0x38)
$C$DW$853	.dwtag  DW_TAG_member
	.dwattr $C$DW$853, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$853, DW_AT_name("SubjectNameXoredSha1")
	.dwattr $C$DW$853, DW_AT_TI_symbol_name("SubjectNameXoredSha1")
	.dwattr $C$DW$853, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$853, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$853, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$853, DW_AT_decl_line(0x147)
	.dwattr $C$DW$853, DW_AT_decl_column(0x0a)

$C$DW$854	.dwtag  DW_TAG_member
	.dwattr $C$DW$854, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$854, DW_AT_name("IssuerNameXoredSha1")
	.dwattr $C$DW$854, DW_AT_TI_symbol_name("IssuerNameXoredSha1")
	.dwattr $C$DW$854, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$854, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$854, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$854, DW_AT_decl_line(0x148)
	.dwattr $C$DW$854, DW_AT_decl_column(0x0a)

$C$DW$855	.dwtag  DW_TAG_member
	.dwattr $C$DW$855, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$855, DW_AT_name("FromDate")
	.dwattr $C$DW$855, DW_AT_TI_symbol_name("FromDate")
	.dwattr $C$DW$855, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$855, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$855, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$855, DW_AT_decl_line(0x149)
	.dwattr $C$DW$855, DW_AT_decl_column(0x0a)

$C$DW$856	.dwtag  DW_TAG_member
	.dwattr $C$DW$856, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$856, DW_AT_name("ToDate")
	.dwattr $C$DW$856, DW_AT_TI_symbol_name("ToDate")
	.dwattr $C$DW$856, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$856, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$856, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$856, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$856, DW_AT_decl_column(0x0a)

$C$DW$857	.dwtag  DW_TAG_member
	.dwattr $C$DW$857, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$857, DW_AT_name("SubjectName")
	.dwattr $C$DW$857, DW_AT_TI_symbol_name("SubjectName")
	.dwattr $C$DW$857, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$857, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$857, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$857, DW_AT_decl_line(0x14b)
	.dwattr $C$DW$857, DW_AT_decl_column(0x0a)

$C$DW$858	.dwtag  DW_TAG_member
	.dwattr $C$DW$858, DW_AT_type(*$C$DW$T$80)
	.dwattr $C$DW$858, DW_AT_name("IssuerName")
	.dwattr $C$DW$858, DW_AT_TI_symbol_name("IssuerName")
	.dwattr $C$DW$858, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$858, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$858, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$858, DW_AT_decl_line(0x14c)
	.dwattr $C$DW$858, DW_AT_decl_column(0x0a)

$C$DW$859	.dwtag  DW_TAG_member
	.dwattr $C$DW$859, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$859, DW_AT_name("SubjectNameLen")
	.dwattr $C$DW$859, DW_AT_TI_symbol_name("SubjectNameLen")
	.dwattr $C$DW$859, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$859, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$859, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$859, DW_AT_decl_line(0x14d)
	.dwattr $C$DW$859, DW_AT_decl_column(0x0a)

$C$DW$860	.dwtag  DW_TAG_member
	.dwattr $C$DW$860, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$860, DW_AT_name("IssuerNameLen")
	.dwattr $C$DW$860, DW_AT_TI_symbol_name("IssuerNameLen")
	.dwattr $C$DW$860, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
	.dwattr $C$DW$860, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$860, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$860, DW_AT_decl_line(0x14e)
	.dwattr $C$DW$860, DW_AT_decl_column(0x0a)

$C$DW$861	.dwtag  DW_TAG_member
	.dwattr $C$DW$861, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$861, DW_AT_name("Padding")
	.dwattr $C$DW$861, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$861, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr $C$DW$861, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$861, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$861, DW_AT_decl_line(0x14f)
	.dwattr $C$DW$861, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$82, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x146)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$82

$C$DW$T$83	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$83, DW_AT_name("SlSockSSLCertInfo_t")
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$83, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$83, DW_AT_decl_line(0x150)
	.dwattr $C$DW$T$83, DW_AT_decl_column(0x03)


$C$DW$T$84	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$84, DW_AT_byte_size(0x48)
$C$DW$862	.dwtag  DW_TAG_member
	.dwattr $C$DW$862, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$862, DW_AT_name("SecureVersion")
	.dwattr $C$DW$862, DW_AT_TI_symbol_name("SecureVersion")
	.dwattr $C$DW$862, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$862, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$862, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$862, DW_AT_decl_line(0x155)
	.dwattr $C$DW$862, DW_AT_decl_column(0x0e)

$C$DW$863	.dwtag  DW_TAG_member
	.dwattr $C$DW$863, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$863, DW_AT_name("SecureCipherSuit")
	.dwattr $C$DW$863, DW_AT_TI_symbol_name("SecureCipherSuit")
	.dwattr $C$DW$863, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$863, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$863, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$863, DW_AT_decl_line(0x156)
	.dwattr $C$DW$863, DW_AT_decl_column(0x0e)

$C$DW$864	.dwtag  DW_TAG_member
	.dwattr $C$DW$864, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$864, DW_AT_name("SecureIsPeerValidated")
	.dwattr $C$DW$864, DW_AT_TI_symbol_name("SecureIsPeerValidated")
	.dwattr $C$DW$864, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$864, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$864, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$864, DW_AT_decl_line(0x157)
	.dwattr $C$DW$864, DW_AT_decl_column(0x0e)

$C$DW$865	.dwtag  DW_TAG_member
	.dwattr $C$DW$865, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$865, DW_AT_name("SecureALPNChosenProtocol")
	.dwattr $C$DW$865, DW_AT_TI_symbol_name("SecureALPNChosenProtocol")
	.dwattr $C$DW$865, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$865, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$865, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$865, DW_AT_decl_line(0x158)
	.dwattr $C$DW$865, DW_AT_decl_column(0x0e)

$C$DW$866	.dwtag  DW_TAG_member
	.dwattr $C$DW$866, DW_AT_type(*$C$DW$T$83)
	.dwattr $C$DW$866, DW_AT_name("SecurePeerCertinfo")
	.dwattr $C$DW$866, DW_AT_TI_symbol_name("SecurePeerCertinfo")
	.dwattr $C$DW$866, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$866, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$866, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$866, DW_AT_decl_line(0x15f)
	.dwattr $C$DW$866, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$84, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$84, DW_AT_decl_line(0x154)
	.dwattr $C$DW$T$84, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$84

$C$DW$T$624	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$624, DW_AT_name("SlSockSSLConnectionParams_t")
	.dwattr $C$DW$T$624, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$T$624, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$624, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$624, DW_AT_decl_line(0x160)
	.dwattr $C$DW$T$624, DW_AT_decl_column(0x03)


$C$DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$85, DW_AT_byte_size(0x04)
$C$DW$867	.dwtag  DW_TAG_member
	.dwattr $C$DW$867, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$867, DW_AT_name("type")
	.dwattr $C$DW$867, DW_AT_TI_symbol_name("type")
	.dwattr $C$DW$867, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$867, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$867, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$867, DW_AT_decl_line(0x165)
	.dwattr $C$DW$867, DW_AT_decl_column(0x0a)

$C$DW$868	.dwtag  DW_TAG_member
	.dwattr $C$DW$868, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$868, DW_AT_name("length")
	.dwattr $C$DW$868, DW_AT_TI_symbol_name("length")
	.dwattr $C$DW$868, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$868, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$868, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$868, DW_AT_decl_line(0x166)
	.dwattr $C$DW$868, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$85, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0x164)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$85

$C$DW$T$625	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$625, DW_AT_name("SlRxMetrics_TLV_t")
	.dwattr $C$DW$T$625, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$625, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$625, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$625, DW_AT_decl_line(0x167)
	.dwattr $C$DW$T$625, DW_AT_decl_column(0x02)


$C$DW$T$87	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$87, DW_AT_byte_size(0x08)
$C$DW$869	.dwtag  DW_TAG_member
	.dwattr $C$DW$869, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$869, DW_AT_name("imr_multiaddr")
	.dwattr $C$DW$869, DW_AT_TI_symbol_name("imr_multiaddr")
	.dwattr $C$DW$869, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$869, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$869, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$869, DW_AT_decl_line(0x1a8)
	.dwattr $C$DW$869, DW_AT_decl_column(0x12)

$C$DW$870	.dwtag  DW_TAG_member
	.dwattr $C$DW$870, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$870, DW_AT_name("imr_interface")
	.dwattr $C$DW$870, DW_AT_TI_symbol_name("imr_interface")
	.dwattr $C$DW$870, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$870, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$870, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$870, DW_AT_decl_line(0x1a9)
	.dwattr $C$DW$870, DW_AT_decl_column(0x12)

	.dwattr $C$DW$T$87, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$87, DW_AT_decl_line(0x1a7)
	.dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$87

$C$DW$T$626	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$626, DW_AT_name("SlSockIpMreq_t")
	.dwattr $C$DW$T$626, DW_AT_type(*$C$DW$T$87)
	.dwattr $C$DW$T$626, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$626, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$T$626, DW_AT_decl_line(0x1aa)
	.dwattr $C$DW$T$626, DW_AT_decl_column(0x02)


$C$DW$T$89	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$89, DW_AT_byte_size(0x14)
$C$DW$871	.dwtag  DW_TAG_member
	.dwattr $C$DW$871, DW_AT_type(*$C$DW$T$88)
	.dwattr $C$DW$871, DW_AT_name("ipv6mr_multiaddr")
	.dwattr $C$DW$871, DW_AT_TI_symbol_name("ipv6mr_multiaddr")
	.dwattr $C$DW$871, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$871, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$871, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/sl_socket.h")
	.dwattr $C$DW$871, DW_AT_decl_line(0x1ad)
	.dwattr $C$DW$871, DW_AT_decl_column(0x11)

$C$DW$872	.dwtag  DW_TAG_member
	.dwattr $C$DW$872, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$872, DW_AT_name("ipv6mr_interface")
	.dwattr $C$DW$872, DW_AT_TI_symbol_name("ipv6mr_interface")
	.dwattr $C$DW$872, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$872, DW_AT_accessibility(DW_ACCESS_public)
