TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.1.LTS *
       3                    ;* Date/Time created: Wed Sep 16 12:09:21 2020                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/s
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.1.LTS Copyright (c) 19
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnet
      13                            .global gIfID
      14                            .common gIfID,2,2

TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  149

    8137                    
    8138                    $C$DW$736       .dwtag  DW_TAG_enumerator
    8139                            .dwattr $C$DW$736, DW_AT_name("WifiConnEvent_CLOUD_CONFIRMATION_START_REQ")
    8140                            .dwattr $C$DW$736, DW_AT_const_value(0x06)
    8141                            .dwattr $C$DW$736, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slw
    8142                            .dwattr $C$DW$736, DW_AT_decl_line(0x66)
    8143                            .dwattr $C$DW$736, DW_AT_decl_column(0x05)
    8144                    
    8145                    $C$DW$737       .dwtag  DW_TAG_enumerator
    8146                            .dwattr $C$DW$737, DW_AT_name("WifiConnEvent_CLOUD_CONFIRMATION_STOP_REQ")
    8147                            .dwattr $C$DW$737, DW_AT_const_value(0x07)
    8148                            .dwattr $C$DW$737, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slw
    8149                            .dwattr $C$DW$737, DW_AT_decl_line(0x6e)
    8150                            .dwattr $C$DW$737, DW_AT_decl_column(0x05)
    8151                    
    8152                            .dwattr $C$DW$T$587, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/s
    8153                            .dwattr $C$DW$T$587, DW_AT_decl_line(0x39)
    8154                            .dwattr $C$DW$T$587, DW_AT_decl_column(0x01)
    8155                            .dwendtag $C$DW$T$587
    8156                    
    8157                    $C$DW$T$588     .dwtag  DW_TAG_typedef
    8158                            .dwattr $C$DW$T$588, DW_AT_name("WifiConnEventId_e")
    8159                            .dwattr $C$DW$T$588, DW_AT_type(*$C$DW$T$587)
    8160                            .dwattr $C$DW$T$588, DW_AT_language(DW_LANG_C)
    8161                            .dwattr $C$DW$T$588, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/s
    8162                            .dwattr $C$DW$T$588, DW_AT_decl_line(0x6f)
    8163                            .dwattr $C$DW$T$588, DW_AT_decl_column(0x03)
    8164                    
    8165                    
    8166                    $C$DW$T$589     .dwtag  DW_TAG_enumeration_type
    8167                            .dwattr $C$DW$T$589, DW_AT_byte_size(0x01)
    8168                    $C$DW$738       .dwtag  DW_TAG_enumerator
    8169                            .dwattr $C$DW$738, DW_AT_name("WifiProvMode_OFF")
    8170                            .dwattr $C$DW$738, DW_AT_const_value(0x00)
    8171                            .dwattr $C$DW$738, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slw
    8172                            .dwattr $C$DW$738, DW_AT_decl_line(0x7c)
    8173                            .dwattr $C$DW$738, DW_AT_decl_column(0x05)
    8174                    
    8175                    $C$DW$739       .dwtag  DW_TAG_enumerator
    8176                            .dwattr $C$DW$739, DW_AT_name("WifiProvMode_ONE_SHOT")
    8177                            .dwattr $C$DW$739, DW_AT_const_value(0x01)
    8178                            .dwattr $C$DW$739, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slw
    8179                            .dwattr $C$DW$739, DW_AT_decl_line(0x7d)
    8180                            .dwattr $C$DW$739, DW_AT_decl_column(0x05)
    8181                    
    8182                    $C$DW$740       .dwtag  DW_TAG_enumerator
    8183                            .dwattr $C$DW$740, DW_AT_name("WifiProvMode_ON")
    8184                            .dwattr $C$DW$740, DW_AT_const_value(0x02)
    8185                            .dwattr $C$DW$740, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slw
    8186                            .dwattr $C$DW$740, DW_AT_decl_line(0x7e)
    8187                            .dwattr $C$DW$740, DW_AT_decl_column(0x05)
    8188                    
    8189                            .dwattr $C$DW$T$589, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/s
    8190                            .dwattr $C$DW$T$589, DW_AT_decl_line(0x7b)
    8191                            .dwattr $C$DW$T$589, DW_AT_decl_column(0x01)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  150

    8192                            .dwendtag $C$DW$T$589
    8193                    
    8194                    $C$DW$T$590     .dwtag  DW_TAG_typedef
    8195                            .dwattr $C$DW$T$590, DW_AT_name("WifiConnProvMode_e")
    8196                            .dwattr $C$DW$T$590, DW_AT_type(*$C$DW$T$589)
    8197                            .dwattr $C$DW$T$590, DW_AT_language(DW_LANG_C)
    8198                            .dwattr $C$DW$T$590, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/s
    8199                            .dwattr $C$DW$T$590, DW_AT_decl_line(0x7f)
    8200                            .dwattr $C$DW$T$590, DW_AT_decl_column(0x03)
    8201                    
    8202                    
    8203                    $C$DW$T$24      .dwtag  DW_TAG_structure_type
    8204                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x20)
    8205                    $C$DW$741       .dwtag  DW_TAG_member
    8206                            .dwattr $C$DW$741, DW_AT_type(*$C$DW$T$13)
    8207                            .dwattr $C$DW$741, DW_AT_name("PingIntervalTime")
    8208                            .dwattr $C$DW$741, DW_AT_TI_symbol_name("PingIntervalTime")
    8209                            .dwattr $C$DW$741, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8210                            .dwattr $C$DW$741, DW_AT_accessibility(DW_ACCESS_public)
    8211                            .dwattr $C$DW$741, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8212                            .dwattr $C$DW$741, DW_AT_decl_line(0x140)
    8213                            .dwattr $C$DW$741, DW_AT_decl_column(0x0d)
    8214                    
    8215                    $C$DW$742       .dwtag  DW_TAG_member
    8216                            .dwattr $C$DW$742, DW_AT_type(*$C$DW$T$9)
    8217                            .dwattr $C$DW$742, DW_AT_name("PingSize")
    8218                            .dwattr $C$DW$742, DW_AT_TI_symbol_name("PingSize")
    8219                            .dwattr $C$DW$742, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8220                            .dwattr $C$DW$742, DW_AT_accessibility(DW_ACCESS_public)
    8221                            .dwattr $C$DW$742, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8222                            .dwattr $C$DW$742, DW_AT_decl_line(0x141)
    8223                            .dwattr $C$DW$742, DW_AT_decl_column(0x0d)
    8224                    
    8225                    $C$DW$743       .dwtag  DW_TAG_member
    8226                            .dwattr $C$DW$743, DW_AT_type(*$C$DW$T$9)
    8227                            .dwattr $C$DW$743, DW_AT_name("PingRequestTimeout")
    8228                            .dwattr $C$DW$743, DW_AT_TI_symbol_name("PingRequestTimeout")
    8229                            .dwattr $C$DW$743, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8230                            .dwattr $C$DW$743, DW_AT_accessibility(DW_ACCESS_public)
    8231                            .dwattr $C$DW$743, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8232                            .dwattr $C$DW$743, DW_AT_decl_line(0x142)
    8233                            .dwattr $C$DW$743, DW_AT_decl_column(0x0d)
    8234                    
    8235                    $C$DW$744       .dwtag  DW_TAG_member
    8236                            .dwattr $C$DW$744, DW_AT_type(*$C$DW$T$13)
    8237                            .dwattr $C$DW$744, DW_AT_name("TotalNumberOfAttempts")
    8238                            .dwattr $C$DW$744, DW_AT_TI_symbol_name("TotalNumberOfAttempts")
    8239                            .dwattr $C$DW$744, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8240                            .dwattr $C$DW$744, DW_AT_accessibility(DW_ACCESS_public)
    8241                            .dwattr $C$DW$744, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8242                            .dwattr $C$DW$744, DW_AT_decl_line(0x143)
    8243                            .dwattr $C$DW$744, DW_AT_decl_column(0x0d)
    8244                    
    8245                    $C$DW$745       .dwtag  DW_TAG_member
    8246                            .dwattr $C$DW$745, DW_AT_type(*$C$DW$T$13)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  151

    8247                            .dwattr $C$DW$745, DW_AT_name("Flags")
    8248                            .dwattr $C$DW$745, DW_AT_TI_symbol_name("Flags")
    8249                            .dwattr $C$DW$745, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8250                            .dwattr $C$DW$745, DW_AT_accessibility(DW_ACCESS_public)
    8251                            .dwattr $C$DW$745, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8252                            .dwattr $C$DW$745, DW_AT_decl_line(0x144)
    8253                            .dwattr $C$DW$745, DW_AT_decl_column(0x0d)
    8254                    
    8255                    $C$DW$746       .dwtag  DW_TAG_member
    8256                            .dwattr $C$DW$746, DW_AT_type(*$C$DW$T$13)
    8257                            .dwattr $C$DW$746, DW_AT_name("Ip")
    8258                            .dwattr $C$DW$746, DW_AT_TI_symbol_name("Ip")
    8259                            .dwattr $C$DW$746, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8260                            .dwattr $C$DW$746, DW_AT_accessibility(DW_ACCESS_public)
    8261                            .dwattr $C$DW$746, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8262                            .dwattr $C$DW$746, DW_AT_decl_line(0x145)
    8263                            .dwattr $C$DW$746, DW_AT_decl_column(0x0d)
    8264                    
    8265                    $C$DW$747       .dwtag  DW_TAG_member
    8266                            .dwattr $C$DW$747, DW_AT_type(*$C$DW$T$13)
    8267                            .dwattr $C$DW$747, DW_AT_name("Ip1OrPadding")
    8268                            .dwattr $C$DW$747, DW_AT_TI_symbol_name("Ip1OrPadding")
    8269                            .dwattr $C$DW$747, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8270                            .dwattr $C$DW$747, DW_AT_accessibility(DW_ACCESS_public)
    8271                            .dwattr $C$DW$747, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8272                            .dwattr $C$DW$747, DW_AT_decl_line(0x146)
    8273                            .dwattr $C$DW$747, DW_AT_decl_column(0x0d)
    8274                    
    8275                    $C$DW$748       .dwtag  DW_TAG_member
    8276                            .dwattr $C$DW$748, DW_AT_type(*$C$DW$T$13)
    8277                            .dwattr $C$DW$748, DW_AT_name("Ip2OrPadding")
    8278                            .dwattr $C$DW$748, DW_AT_TI_symbol_name("Ip2OrPadding")
    8279                            .dwattr $C$DW$748, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8280                            .dwattr $C$DW$748, DW_AT_accessibility(DW_ACCESS_public)
    8281                            .dwattr $C$DW$748, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8282                            .dwattr $C$DW$748, DW_AT_decl_line(0x147)
    8283                            .dwattr $C$DW$748, DW_AT_decl_column(0x0d)
    8284                    
    8285                    $C$DW$749       .dwtag  DW_TAG_member
    8286                            .dwattr $C$DW$749, DW_AT_type(*$C$DW$T$13)
    8287                            .dwattr $C$DW$749, DW_AT_name("Ip3OrPadding")
    8288                            .dwattr $C$DW$749, DW_AT_TI_symbol_name("Ip3OrPadding")
    8289                            .dwattr $C$DW$749, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8290                            .dwattr $C$DW$749, DW_AT_accessibility(DW_ACCESS_public)
    8291                            .dwattr $C$DW$749, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8292                            .dwattr $C$DW$749, DW_AT_decl_line(0x148)
    8293                            .dwattr $C$DW$749, DW_AT_decl_column(0x0d)
    8294                    
    8295                            .dwattr $C$DW$T$24, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
    8296                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x13f)
    8297                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x01)
    8298                            .dwendtag $C$DW$T$24
    8299                    
    8300                    $C$DW$T$591     .dwtag  DW_TAG_typedef
    8301                            .dwattr $C$DW$T$591, DW_AT_name("SlNetAppPingCommand_t")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  152

    8302                            .dwattr $C$DW$T$591, DW_AT_type(*$C$DW$T$24)
    8303                            .dwattr $C$DW$T$591, DW_AT_language(DW_LANG_C)
    8304                            .dwattr $C$DW$T$591, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/n
    8305                            .dwattr $C$DW$T$591, DW_AT_decl_line(0x149)
    8306                            .dwattr $C$DW$T$591, DW_AT_decl_column(0x02)
    8307                    
    8308                    $C$DW$T$592     .dwtag  DW_TAG_const_type
    8309                            .dwattr $C$DW$T$592, DW_AT_type(*$C$DW$T$591)
    8310                    
    8311                    $C$DW$T$593     .dwtag  DW_TAG_pointer_type
    8312                            .dwattr $C$DW$T$593, DW_AT_type(*$C$DW$T$592)
    8313                            .dwattr $C$DW$T$593, DW_AT_address_class(0x20)
    8314                    
    8315                    
    8316                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    8317                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x14)
    8318                    $C$DW$750       .dwtag  DW_TAG_member
    8319                            .dwattr $C$DW$750, DW_AT_type(*$C$DW$T$13)
    8320                            .dwattr $C$DW$750, DW_AT_name("PacketsSent")
    8321                            .dwattr $C$DW$750, DW_AT_TI_symbol_name("PacketsSent")
    8322                            .dwattr $C$DW$750, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8323                            .dwattr $C$DW$750, DW_AT_accessibility(DW_ACCESS_public)
    8324                            .dwattr $C$DW$750, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8325                            .dwattr $C$DW$750, DW_AT_decl_line(0x136)
    8326                            .dwattr $C$DW$750, DW_AT_decl_column(0x0d)
    8327                    
    8328                    $C$DW$751       .dwtag  DW_TAG_member
    8329                            .dwattr $C$DW$751, DW_AT_type(*$C$DW$T$13)
    8330                            .dwattr $C$DW$751, DW_AT_name("PacketsReceived")
    8331                            .dwattr $C$DW$751, DW_AT_TI_symbol_name("PacketsReceived")
    8332                            .dwattr $C$DW$751, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8333                            .dwattr $C$DW$751, DW_AT_accessibility(DW_ACCESS_public)
    8334                            .dwattr $C$DW$751, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8335                            .dwattr $C$DW$751, DW_AT_decl_line(0x137)
    8336                            .dwattr $C$DW$751, DW_AT_decl_column(0x0d)
    8337                    
    8338                    $C$DW$752       .dwtag  DW_TAG_member
    8339                            .dwattr $C$DW$752, DW_AT_type(*$C$DW$T$9)
    8340                            .dwattr $C$DW$752, DW_AT_name("MinRoundTime")
    8341                            .dwattr $C$DW$752, DW_AT_TI_symbol_name("MinRoundTime")
    8342                            .dwattr $C$DW$752, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8343                            .dwattr $C$DW$752, DW_AT_accessibility(DW_ACCESS_public)
    8344                            .dwattr $C$DW$752, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8345                            .dwattr $C$DW$752, DW_AT_decl_line(0x138)
    8346                            .dwattr $C$DW$752, DW_AT_decl_column(0x0d)
    8347                    
    8348                    $C$DW$753       .dwtag  DW_TAG_member
    8349                            .dwattr $C$DW$753, DW_AT_type(*$C$DW$T$9)
    8350                            .dwattr $C$DW$753, DW_AT_name("MaxRoundTime")
    8351                            .dwattr $C$DW$753, DW_AT_TI_symbol_name("MaxRoundTime")
    8352                            .dwattr $C$DW$753, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    8353                            .dwattr $C$DW$753, DW_AT_accessibility(DW_ACCESS_public)
    8354                            .dwattr $C$DW$753, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8355                            .dwattr $C$DW$753, DW_AT_decl_line(0x139)
    8356                            .dwattr $C$DW$753, DW_AT_decl_column(0x0d)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  153

    8357                    
    8358                    $C$DW$754       .dwtag  DW_TAG_member
    8359                            .dwattr $C$DW$754, DW_AT_type(*$C$DW$T$9)
    8360                            .dwattr $C$DW$754, DW_AT_name("AvgRoundTime")
    8361                            .dwattr $C$DW$754, DW_AT_TI_symbol_name("AvgRoundTime")
    8362                            .dwattr $C$DW$754, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8363                            .dwattr $C$DW$754, DW_AT_accessibility(DW_ACCESS_public)
    8364                            .dwattr $C$DW$754, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8365                            .dwattr $C$DW$754, DW_AT_decl_line(0x13a)
    8366                            .dwattr $C$DW$754, DW_AT_decl_column(0x0d)
    8367                    
    8368                    $C$DW$755       .dwtag  DW_TAG_member
    8369                            .dwattr $C$DW$755, DW_AT_type(*$C$DW$T$13)
    8370                            .dwattr $C$DW$755, DW_AT_name("TestTime")
    8371                            .dwattr $C$DW$755, DW_AT_TI_symbol_name("TestTime")
    8372                            .dwattr $C$DW$755, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8373                            .dwattr $C$DW$755, DW_AT_accessibility(DW_ACCESS_public)
    8374                            .dwattr $C$DW$755, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/net
    8375                            .dwattr $C$DW$755, DW_AT_decl_line(0x13b)
    8376                            .dwattr $C$DW$755, DW_AT_decl_column(0x0d)
    8377                    
    8378                            .dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
    8379                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x135)
    8380                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    8381                            .dwendtag $C$DW$T$25
    8382                    
    8383                    $C$DW$T$595     .dwtag  DW_TAG_typedef
    8384                            .dwattr $C$DW$T$595, DW_AT_name("SlNetAppPingReport_t")
    8385                            .dwattr $C$DW$T$595, DW_AT_type(*$C$DW$T$25)
    8386                            .dwattr $C$DW$T$595, DW_AT_language(DW_LANG_C)
    8387                            .dwattr $C$DW$T$595, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/n
    8388                            .dwattr $C$DW$T$595, DW_AT_decl_line(0x13c)
    8389                            .dwattr $C$DW$T$595, DW_AT_decl_column(0x02)
    8390                    
    8391                    $C$DW$T$596     .dwtag  DW_TAG_pointer_type
    8392                            .dwattr $C$DW$T$596, DW_AT_type(*$C$DW$T$595)
    8393                            .dwattr $C$DW$T$596, DW_AT_address_class(0x20)
    8394                    
    8395                    
    8396                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    8397                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x28)
    8398                    $C$DW$756       .dwtag  DW_TAG_member
    8399                            .dwattr $C$DW$756, DW_AT_type(*$C$DW$T$6)
    8400                            .dwattr $C$DW$756, DW_AT_name("SsidLen")
    8401                            .dwattr $C$DW$756, DW_AT_TI_symbol_name("SsidLen")
    8402                            .dwattr $C$DW$756, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8403                            .dwattr $C$DW$756, DW_AT_accessibility(DW_ACCESS_public)
    8404                            .dwattr $C$DW$756, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8405                            .dwattr $C$DW$756, DW_AT_decl_line(0x249)
    8406                            .dwattr $C$DW$756, DW_AT_decl_column(0x0d)
    8407                    
    8408                    $C$DW$757       .dwtag  DW_TAG_member
    8409                            .dwattr $C$DW$757, DW_AT_type(*$C$DW$T$26)
    8410                            .dwattr $C$DW$757, DW_AT_name("SsidName")
    8411                            .dwattr $C$DW$757, DW_AT_TI_symbol_name("SsidName")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  154

    8412                            .dwattr $C$DW$757, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8413                            .dwattr $C$DW$757, DW_AT_accessibility(DW_ACCESS_public)
    8414                            .dwattr $C$DW$757, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8415                            .dwattr $C$DW$757, DW_AT_decl_line(0x24a)
    8416                            .dwattr $C$DW$757, DW_AT_decl_column(0x0d)
    8417                    
    8418                    $C$DW$758       .dwtag  DW_TAG_member
    8419                            .dwattr $C$DW$758, DW_AT_type(*$C$DW$T$27)
    8420                            .dwattr $C$DW$758, DW_AT_name("Bssid")
    8421                            .dwattr $C$DW$758, DW_AT_TI_symbol_name("Bssid")
    8422                            .dwattr $C$DW$758, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    8423                            .dwattr $C$DW$758, DW_AT_accessibility(DW_ACCESS_public)
    8424                            .dwattr $C$DW$758, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8425                            .dwattr $C$DW$758, DW_AT_decl_line(0x24b)
    8426                            .dwattr $C$DW$758, DW_AT_decl_column(0x0d)
    8427                    
    8428                    $C$DW$759       .dwtag  DW_TAG_member
    8429                            .dwattr $C$DW$759, DW_AT_type(*$C$DW$T$6)
    8430                            .dwattr $C$DW$759, DW_AT_name("Channel")
    8431                            .dwattr $C$DW$759, DW_AT_TI_symbol_name("Channel")
    8432                            .dwattr $C$DW$759, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    8433                            .dwattr $C$DW$759, DW_AT_accessibility(DW_ACCESS_public)
    8434                            .dwattr $C$DW$759, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8435                            .dwattr $C$DW$759, DW_AT_decl_line(0x24c)
    8436                            .dwattr $C$DW$759, DW_AT_decl_column(0x0d)
    8437                    
    8438                            .dwattr $C$DW$T$28, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
    8439                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x248)
    8440                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x01)
    8441                            .dwendtag $C$DW$T$28
    8442                    
    8443                    $C$DW$T$255     .dwtag  DW_TAG_typedef
    8444                            .dwattr $C$DW$T$255, DW_AT_name("SlWlanEventConnect_t")
    8445                            .dwattr $C$DW$T$255, DW_AT_type(*$C$DW$T$28)
    8446                            .dwattr $C$DW$T$255, DW_AT_language(DW_LANG_C)
    8447                            .dwattr $C$DW$T$255, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
    8448                            .dwattr $C$DW$T$255, DW_AT_decl_line(0x24d)
    8449                            .dwattr $C$DW$T$255, DW_AT_decl_column(0x03)
    8450                    
    8451                    
    8452                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    8453                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x4c)
    8454                    $C$DW$760       .dwtag  DW_TAG_member
    8455                            .dwattr $C$DW$760, DW_AT_type(*$C$DW$T$6)
    8456                            .dwattr $C$DW$760, DW_AT_name("SsidLen")
    8457                            .dwattr $C$DW$760, DW_AT_TI_symbol_name("SsidLen")
    8458                            .dwattr $C$DW$760, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8459                            .dwattr $C$DW$760, DW_AT_accessibility(DW_ACCESS_public)
    8460                            .dwattr $C$DW$760, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8461                            .dwattr $C$DW$760, DW_AT_decl_line(0x260)
    8462                            .dwattr $C$DW$760, DW_AT_decl_column(0x0d)
    8463                    
    8464                    $C$DW$761       .dwtag  DW_TAG_member
    8465                            .dwattr $C$DW$761, DW_AT_type(*$C$DW$T$26)
    8466                            .dwattr $C$DW$761, DW_AT_name("SsidName")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  155

    8467                            .dwattr $C$DW$761, DW_AT_TI_symbol_name("SsidName")
    8468                            .dwattr $C$DW$761, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8469                            .dwattr $C$DW$761, DW_AT_accessibility(DW_ACCESS_public)
    8470                            .dwattr $C$DW$761, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8471                            .dwattr $C$DW$761, DW_AT_decl_line(0x261)
    8472                            .dwattr $C$DW$761, DW_AT_decl_column(0x0d)
    8473                    
    8474                    $C$DW$762       .dwtag  DW_TAG_member
    8475                            .dwattr $C$DW$762, DW_AT_type(*$C$DW$T$27)
    8476                            .dwattr $C$DW$762, DW_AT_name("Bssid")
    8477                            .dwattr $C$DW$762, DW_AT_TI_symbol_name("Bssid")
    8478                            .dwattr $C$DW$762, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    8479                            .dwattr $C$DW$762, DW_AT_accessibility(DW_ACCESS_public)
    8480                            .dwattr $C$DW$762, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8481                            .dwattr $C$DW$762, DW_AT_decl_line(0x262)
    8482                            .dwattr $C$DW$762, DW_AT_decl_column(0x0d)
    8483                    
    8484                    $C$DW$763       .dwtag  DW_TAG_member
    8485                            .dwattr $C$DW$763, DW_AT_type(*$C$DW$T$6)
    8486                            .dwattr $C$DW$763, DW_AT_name("Reserved")
    8487                            .dwattr $C$DW$763, DW_AT_TI_symbol_name("Reserved")
    8488                            .dwattr $C$DW$763, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    8489                            .dwattr $C$DW$763, DW_AT_accessibility(DW_ACCESS_public)
    8490                            .dwattr $C$DW$763, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8491                            .dwattr $C$DW$763, DW_AT_decl_line(0x263)
    8492                            .dwattr $C$DW$763, DW_AT_decl_column(0x0d)
    8493                    
    8494                    $C$DW$764       .dwtag  DW_TAG_member
    8495                            .dwattr $C$DW$764, DW_AT_type(*$C$DW$T$6)
    8496                            .dwattr $C$DW$764, DW_AT_name("GoDeviceNameLen")
    8497                            .dwattr $C$DW$764, DW_AT_TI_symbol_name("GoDeviceNameLen")
    8498                            .dwattr $C$DW$764, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8499                            .dwattr $C$DW$764, DW_AT_accessibility(DW_ACCESS_public)
    8500                            .dwattr $C$DW$764, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8501                            .dwattr $C$DW$764, DW_AT_decl_line(0x264)
    8502                            .dwattr $C$DW$764, DW_AT_decl_column(0x0d)
    8503                    
    8504                    $C$DW$765       .dwtag  DW_TAG_member
    8505                            .dwattr $C$DW$765, DW_AT_type(*$C$DW$T$26)
    8506                            .dwattr $C$DW$765, DW_AT_name("GoDeviceName")
    8507                            .dwattr $C$DW$765, DW_AT_TI_symbol_name("GoDeviceName")
    8508                            .dwattr $C$DW$765, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    8509                            .dwattr $C$DW$765, DW_AT_accessibility(DW_ACCESS_public)
    8510                            .dwattr $C$DW$765, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8511                            .dwattr $C$DW$765, DW_AT_decl_line(0x265)
    8512                            .dwattr $C$DW$765, DW_AT_decl_column(0x0d)
    8513                    
    8514                    $C$DW$766       .dwtag  DW_TAG_member
    8515                            .dwattr $C$DW$766, DW_AT_type(*$C$DW$T$29)
    8516                            .dwattr $C$DW$766, DW_AT_name("Padding")
    8517                            .dwattr $C$DW$766, DW_AT_TI_symbol_name("Padding")
    8518                            .dwattr $C$DW$766, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    8519                            .dwattr $C$DW$766, DW_AT_accessibility(DW_ACCESS_public)
    8520                            .dwattr $C$DW$766, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8521                            .dwattr $C$DW$766, DW_AT_decl_line(0x266)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  156

    8522                            .dwattr $C$DW$766, DW_AT_decl_column(0x0d)
    8523                    
    8524                            .dwattr $C$DW$T$30, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
    8525                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x25f)
    8526                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    8527                            .dwendtag $C$DW$T$30
    8528                    
    8529                    $C$DW$T$256     .dwtag  DW_TAG_typedef
    8530                            .dwattr $C$DW$T$256, DW_AT_name("SlWlanEventP2PConnect_t")
    8531                            .dwattr $C$DW$T$256, DW_AT_type(*$C$DW$T$30)
    8532                            .dwattr $C$DW$T$256, DW_AT_language(DW_LANG_C)
    8533                            .dwattr $C$DW$T$256, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
    8534                            .dwattr $C$DW$T$256, DW_AT_decl_line(0x267)
    8535                            .dwattr $C$DW$T$256, DW_AT_decl_column(0x03)
    8536                    
    8537                    
    8538                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    8539                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x50)
    8540                    $C$DW$767       .dwtag  DW_TAG_member
    8541                            .dwattr $C$DW$767, DW_AT_type(*$C$DW$T$6)
    8542                            .dwattr $C$DW$767, DW_AT_name("Mode")
    8543                            .dwattr $C$DW$767, DW_AT_TI_symbol_name("Mode")
    8544                            .dwattr $C$DW$767, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8545                            .dwattr $C$DW$767, DW_AT_accessibility(DW_ACCESS_public)
    8546                            .dwattr $C$DW$767, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8547                            .dwattr $C$DW$767, DW_AT_decl_line(0x315)
    8548                            .dwattr $C$DW$767, DW_AT_decl_column(0x09)
    8549                    
    8550                    $C$DW$768       .dwtag  DW_TAG_member
    8551                            .dwattr $C$DW$768, DW_AT_type(*$C$DW$T$6)
    8552                            .dwattr $C$DW$768, DW_AT_name("ConnStatus")
    8553                            .dwattr $C$DW$768, DW_AT_TI_symbol_name("ConnStatus")
    8554                            .dwattr $C$DW$768, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8555                            .dwattr $C$DW$768, DW_AT_accessibility(DW_ACCESS_public)
    8556                            .dwattr $C$DW$768, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8557                            .dwattr $C$DW$768, DW_AT_decl_line(0x316)
    8558                            .dwattr $C$DW$768, DW_AT_decl_column(0x09)
    8559                    
    8560                    $C$DW$769       .dwtag  DW_TAG_member
    8561                            .dwattr $C$DW$769, DW_AT_type(*$C$DW$T$6)
    8562                            .dwattr $C$DW$769, DW_AT_name("SecType")
    8563                            .dwattr $C$DW$769, DW_AT_TI_symbol_name("SecType")
    8564                            .dwattr $C$DW$769, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8565                            .dwattr $C$DW$769, DW_AT_accessibility(DW_ACCESS_public)
    8566                            .dwattr $C$DW$769, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8567                            .dwattr $C$DW$769, DW_AT_decl_line(0x317)
    8568                            .dwattr $C$DW$769, DW_AT_decl_column(0x09)
    8569                    
    8570                    $C$DW$770       .dwtag  DW_TAG_member
    8571                            .dwattr $C$DW$770, DW_AT_type(*$C$DW$T$6)
    8572                            .dwattr $C$DW$770, DW_AT_name("Reserved")
    8573                            .dwattr $C$DW$770, DW_AT_TI_symbol_name("Reserved")
    8574                            .dwattr $C$DW$770, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8575                            .dwattr $C$DW$770, DW_AT_accessibility(DW_ACCESS_public)
    8576                            .dwattr $C$DW$770, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  157

    8577                            .dwattr $C$DW$770, DW_AT_decl_line(0x318)
    8578                            .dwattr $C$DW$770, DW_AT_decl_column(0x09)
    8579                    
    8580                    $C$DW$771       .dwtag  DW_TAG_member
    8581                            .dwattr $C$DW$771, DW_AT_type(*$C$DW$T$31)
    8582                            .dwattr $C$DW$771, DW_AT_name("ConnectionInfo")
    8583                            .dwattr $C$DW$771, DW_AT_TI_symbol_name("ConnectionInfo")
    8584                            .dwattr $C$DW$771, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8585                            .dwattr $C$DW$771, DW_AT_accessibility(DW_ACCESS_public)
    8586                            .dwattr $C$DW$771, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
    8587                            .dwattr $C$DW$771, DW_AT_decl_line(0x319)
    8588                            .dwattr $C$DW$771, DW_AT_decl_column(0x1c)
    8589                    
    8590                            .dwattr $C$DW$T$32, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
    8591                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x314)
    8592                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    8593                            .dwendtag $C$DW$T$32
    8594                    
    8595                    $C$DW$T$597     .dwtag  DW_TAG_typedef
    8596                            .dwattr $C$DW$T$597, DW_AT_name("SlWlanConnStatusParam_t")
    8597                            .dwattr $C$DW$T$597, DW_AT_type(*$C$DW$T$32)
    8598                            .dwattr $C$DW$T$597, DW_AT_language(DW_LANG_C)
    8599                            .dwattr $C$DW$T$597, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
    8600                            .dwattr $C$DW$T$597, DW_AT_decl_line(0x31a)
    8601                            .dwattr $C$DW$T$597, DW_AT_decl_column(0x02)
    8602                    
    8603                    
    8604                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    8605                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
    8606                    $C$DW$772       .dwtag  DW_TAG_member
    8607                            .dwattr $C$DW$772, DW_AT_type(*$C$DW$T$14)
    8608                            .dwattr $C$DW$772, DW_AT_name("__max_align1")
    8609                            .dwattr $C$DW$772, DW_AT_TI_symbol_name("__max_align1")
    8610                            .dwattr $C$DW$772, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8611                            .dwattr $C$DW$772, DW_AT_accessibility(DW_ACCESS_public)
    8612                            .dwattr $C$DW$772, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8613                            .dwattr $C$DW$772, DW_AT_decl_line(0x7b)
    8614                            .dwattr $C$DW$772, DW_AT_decl_column(0x0c)
    8615                    
    8616                    $C$DW$773       .dwtag  DW_TAG_member
    8617                            .dwattr $C$DW$773, DW_AT_type(*$C$DW$T$18)
    8618                            .dwattr $C$DW$773, DW_AT_name("__max_align2")
    8619                            .dwattr $C$DW$773, DW_AT_TI_symbol_name("__max_align2")
    8620                            .dwattr $C$DW$773, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8621                            .dwattr $C$DW$773, DW_AT_accessibility(DW_ACCESS_public)
    8622                            .dwattr $C$DW$773, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8623                            .dwattr $C$DW$773, DW_AT_decl_line(0x7c)
    8624                            .dwattr $C$DW$773, DW_AT_decl_column(0x0e)
    8625                    
    8626                            .dwattr $C$DW$T$33, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.L
    8627                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x7a)
    8628                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    8629                            .dwendtag $C$DW$T$33
    8630                    
    8631                    $C$DW$T$599     .dwtag  DW_TAG_typedef
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  158

    8632                            .dwattr $C$DW$T$599, DW_AT_name("__max_align_t")
    8633                            .dwattr $C$DW$T$599, DW_AT_type(*$C$DW$T$33)
    8634                            .dwattr $C$DW$T$599, DW_AT_language(DW_LANG_C)
    8635                            .dwattr $C$DW$T$599, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.
    8636                            .dwattr $C$DW$T$599, DW_AT_decl_line(0x7d)
    8637                            .dwattr $C$DW$T$599, DW_AT_decl_column(0x03)
    8638                    
    8639                    
    8640                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    8641                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    8642                    $C$DW$774       .dwtag  DW_TAG_member
    8643                            .dwattr $C$DW$774, DW_AT_type(*$C$DW$T$35)
    8644                            .dwattr $C$DW$774, DW_AT_name("hi")
    8645                            .dwattr $C$DW$774, DW_AT_TI_symbol_name("hi")
    8646                            .dwattr $C$DW$774, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8647                            .dwattr $C$DW$774, DW_AT_accessibility(DW_ACCESS_public)
    8648                            .dwattr $C$DW$774, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h
    8649                            .dwattr $C$DW$774, DW_AT_decl_line(0x5d)
    8650                            .dwattr $C$DW$774, DW_AT_decl_column(0x0e)
    8651                    
    8652                    $C$DW$775       .dwtag  DW_TAG_member
    8653                            .dwattr $C$DW$775, DW_AT_type(*$C$DW$T$35)
    8654                            .dwattr $C$DW$775, DW_AT_name("lo")
    8655                            .dwattr $C$DW$775, DW_AT_TI_symbol_name("lo")
    8656                            .dwattr $C$DW$775, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8657                            .dwattr $C$DW$775, DW_AT_accessibility(DW_ACCESS_public)
    8658                            .dwattr $C$DW$775, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h
    8659                            .dwattr $C$DW$775, DW_AT_decl_line(0x5e)
    8660                            .dwattr $C$DW$775, DW_AT_decl_column(0x0e)
    8661                    
    8662                            .dwattr $C$DW$T$36, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.
    8663                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x5c)
    8664                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    8665                            .dwendtag $C$DW$T$36
    8666                    
    8667                    $C$DW$T$600     .dwtag  DW_TAG_typedef
    8668                            .dwattr $C$DW$T$600, DW_AT_name("ClockP_FreqHz")
    8669                            .dwattr $C$DW$T$600, DW_AT_type(*$C$DW$T$36)
    8670                            .dwattr $C$DW$T$600, DW_AT_language(DW_LANG_C)
    8671                            .dwattr $C$DW$T$600, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP
    8672                            .dwattr $C$DW$T$600, DW_AT_decl_line(0x5f)
    8673                            .dwattr $C$DW$T$600, DW_AT_decl_column(0x03)
    8674                    
    8675                    
    8676                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    8677                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x0c)
    8678                    $C$DW$776       .dwtag  DW_TAG_member
    8679                            .dwattr $C$DW$776, DW_AT_type(*$C$DW$T$37)
    8680                            .dwattr $C$DW$776, DW_AT_name("startFlag")
    8681                            .dwattr $C$DW$776, DW_AT_TI_symbol_name("startFlag")
    8682                            .dwattr $C$DW$776, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8683                            .dwattr $C$DW$776, DW_AT_accessibility(DW_ACCESS_public)
    8684                            .dwattr $C$DW$776, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h
    8685                            .dwattr $C$DW$776, DW_AT_decl_line(0x8c)
    8686                            .dwattr $C$DW$776, DW_AT_decl_column(0x0f)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  159

    8687                    
    8688                    $C$DW$777       .dwtag  DW_TAG_member
    8689                            .dwattr $C$DW$777, DW_AT_type(*$C$DW$T$35)
    8690                            .dwattr $C$DW$777, DW_AT_name("period")
    8691                            .dwattr $C$DW$777, DW_AT_TI_symbol_name("period")
    8692                            .dwattr $C$DW$777, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8693                            .dwattr $C$DW$777, DW_AT_accessibility(DW_ACCESS_public)
    8694                            .dwattr $C$DW$777, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h
    8695                            .dwattr $C$DW$777, DW_AT_decl_line(0x8d)
    8696                            .dwattr $C$DW$777, DW_AT_decl_column(0x0f)
    8697                    
    8698                    $C$DW$778       .dwtag  DW_TAG_member
    8699                            .dwattr $C$DW$778, DW_AT_type(*$C$DW$T$39)
    8700                            .dwattr $C$DW$778, DW_AT_name("arg")
    8701                            .dwattr $C$DW$778, DW_AT_TI_symbol_name("arg")
    8702                            .dwattr $C$DW$778, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8703                            .dwattr $C$DW$778, DW_AT_accessibility(DW_ACCESS_public)
    8704                            .dwattr $C$DW$778, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.h
    8705                            .dwattr $C$DW$778, DW_AT_decl_line(0x8e)
    8706                            .dwattr $C$DW$778, DW_AT_decl_column(0x0f)
    8707                    
    8708                            .dwattr $C$DW$T$40, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP.
    8709                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x8b)
    8710                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    8711                            .dwendtag $C$DW$T$40
    8712                    
    8713                    $C$DW$T$601     .dwtag  DW_TAG_typedef
    8714                            .dwattr $C$DW$T$601, DW_AT_name("ClockP_Params")
    8715                            .dwattr $C$DW$T$601, DW_AT_type(*$C$DW$T$40)
    8716                            .dwattr $C$DW$T$601, DW_AT_language(DW_LANG_C)
    8717                            .dwattr $C$DW$T$601, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/dpl/ClockP
    8718                            .dwattr $C$DW$T$601, DW_AT_decl_line(0x8f)
    8719                            .dwattr $C$DW$T$601, DW_AT_decl_column(0x03)
    8720                    
    8721                    
    8722                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    8723                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x10)
    8724                    $C$DW$779       .dwtag  DW_TAG_member
    8725                            .dwattr $C$DW$779, DW_AT_type(*$C$DW$T$8)
    8726                            .dwattr $C$DW$779, DW_AT_name("daylight")
    8727                            .dwattr $C$DW$779, DW_AT_TI_symbol_name("daylight")
    8728                            .dwattr $C$DW$779, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8729                            .dwattr $C$DW$779, DW_AT_accessibility(DW_ACCESS_public)
    8730                            .dwattr $C$DW$779, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8731                            .dwattr $C$DW$779, DW_AT_decl_line(0x9b)
    8732                            .dwattr $C$DW$779, DW_AT_decl_column(0x0b)
    8733                    
    8734                    $C$DW$780       .dwtag  DW_TAG_member
    8735                            .dwattr $C$DW$780, DW_AT_type(*$C$DW$T$12)
    8736                            .dwattr $C$DW$780, DW_AT_name("timezone")
    8737                            .dwattr $C$DW$780, DW_AT_TI_symbol_name("timezone")
    8738                            .dwattr $C$DW$780, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8739                            .dwattr $C$DW$780, DW_AT_accessibility(DW_ACCESS_public)
    8740                            .dwattr $C$DW$780, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8741                            .dwattr $C$DW$780, DW_AT_decl_line(0x9c)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  160

    8742                            .dwattr $C$DW$780, DW_AT_decl_column(0x0b)
    8743                    
    8744                    $C$DW$781       .dwtag  DW_TAG_member
    8745                            .dwattr $C$DW$781, DW_AT_type(*$C$DW$T$42)
    8746                            .dwattr $C$DW$781, DW_AT_name("tzname")
    8747                            .dwattr $C$DW$781, DW_AT_TI_symbol_name("tzname")
    8748                            .dwattr $C$DW$781, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8749                            .dwattr $C$DW$781, DW_AT_accessibility(DW_ACCESS_public)
    8750                            .dwattr $C$DW$781, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8751                            .dwattr $C$DW$781, DW_AT_decl_line(0x9d)
    8752                            .dwattr $C$DW$781, DW_AT_decl_column(0x0b)
    8753                    
    8754                    $C$DW$782       .dwtag  DW_TAG_member
    8755                            .dwattr $C$DW$782, DW_AT_type(*$C$DW$T$42)
    8756                            .dwattr $C$DW$782, DW_AT_name("dstname")
    8757                            .dwattr $C$DW$782, DW_AT_TI_symbol_name("dstname")
    8758                            .dwattr $C$DW$782, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8759                            .dwattr $C$DW$782, DW_AT_accessibility(DW_ACCESS_public)
    8760                            .dwattr $C$DW$782, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8761                            .dwattr $C$DW$782, DW_AT_decl_line(0x9e)
    8762                            .dwattr $C$DW$782, DW_AT_decl_column(0x0b)
    8763                    
    8764                            .dwattr $C$DW$T$43, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.L
    8765                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x9a)
    8766                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    8767                            .dwendtag $C$DW$T$43
    8768                    
    8769                    $C$DW$T$602     .dwtag  DW_TAG_typedef
    8770                            .dwattr $C$DW$T$602, DW_AT_name("TZ")
    8771                            .dwattr $C$DW$T$602, DW_AT_type(*$C$DW$T$43)
    8772                            .dwattr $C$DW$T$602, DW_AT_language(DW_LANG_C)
    8773                            .dwattr $C$DW$T$602, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.
    8774                            .dwattr $C$DW$T$602, DW_AT_decl_line(0x9f)
    8775                            .dwattr $C$DW$T$602, DW_AT_decl_column(0x03)
    8776                    
    8777                    
    8778                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    8779                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x08)
    8780                    $C$DW$783       .dwtag  DW_TAG_member
    8781                            .dwattr $C$DW$783, DW_AT_type(*$C$DW$T$46)
    8782                            .dwattr $C$DW$783, DW_AT_name("pEntry")
    8783                            .dwattr $C$DW$783, DW_AT_TI_symbol_name("pEntry")
    8784                            .dwattr $C$DW$783, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8785                            .dwattr $C$DW$783, DW_AT_accessibility(DW_ACCESS_public)
    8786                            .dwattr $C$DW$783, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/por
    8787                            .dwattr $C$DW$783, DW_AT_decl_line(0x80)
    8788                            .dwattr $C$DW$783, DW_AT_decl_column(0x16)
    8789                    
    8790                    $C$DW$784       .dwtag  DW_TAG_member
    8791                            .dwattr $C$DW$784, DW_AT_type(*$C$DW$T$3)
    8792                            .dwattr $C$DW$784, DW_AT_name("pValue")
    8793                            .dwattr $C$DW$784, DW_AT_TI_symbol_name("pValue")
    8794                            .dwattr $C$DW$784, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8795                            .dwattr $C$DW$784, DW_AT_accessibility(DW_ACCESS_public)
    8796                            .dwattr $C$DW$784, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/por
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  161

    8797                            .dwattr $C$DW$784, DW_AT_decl_line(0x81)
    8798                            .dwattr $C$DW$784, DW_AT_decl_column(0x0b)
    8799                    
    8800                            .dwattr $C$DW$T$47, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/po
    8801                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x7f)
    8802                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    8803                            .dwendtag $C$DW$T$47
    8804                    
    8805                    $C$DW$T$603     .dwtag  DW_TAG_typedef
    8806                            .dwattr $C$DW$T$603, DW_AT_name("tSimpleLinkSpawnMsg")
    8807                            .dwattr $C$DW$T$603, DW_AT_type(*$C$DW$T$47)
    8808                            .dwattr $C$DW$T$603, DW_AT_language(DW_LANG_C)
    8809                            .dwattr $C$DW$T$603, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/p
    8810                            .dwattr $C$DW$T$603, DW_AT_decl_line(0x82)
    8811                            .dwattr $C$DW$T$603, DW_AT_decl_column(0x02)
    8812                    
    8813                    
    8814                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    8815                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x08)
    8816                    $C$DW$785       .dwtag  DW_TAG_member
    8817                            .dwattr $C$DW$785, DW_AT_type(*$C$DW$T$10)
    8818                            .dwattr $C$DW$785, DW_AT_name("quot")
    8819                            .dwattr $C$DW$785, DW_AT_TI_symbol_name("quot")
    8820                            .dwattr $C$DW$785, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8821                            .dwattr $C$DW$785, DW_AT_accessibility(DW_ACCESS_public)
    8822                            .dwattr $C$DW$785, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8823                            .dwattr $C$DW$785, DW_AT_decl_line(0x4e)
    8824                            .dwattr $C$DW$785, DW_AT_decl_column(0x16)
    8825                    
    8826                    $C$DW$786       .dwtag  DW_TAG_member
    8827                            .dwattr $C$DW$786, DW_AT_type(*$C$DW$T$10)
    8828                            .dwattr $C$DW$786, DW_AT_name("rem")
    8829                            .dwattr $C$DW$786, DW_AT_TI_symbol_name("rem")
    8830                            .dwattr $C$DW$786, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8831                            .dwattr $C$DW$786, DW_AT_accessibility(DW_ACCESS_public)
    8832                            .dwattr $C$DW$786, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8833                            .dwattr $C$DW$786, DW_AT_decl_line(0x4e)
    8834                            .dwattr $C$DW$786, DW_AT_decl_column(0x1c)
    8835                    
    8836                            .dwattr $C$DW$T$48, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.L
    8837                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x4e)
    8838                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
    8839                            .dwendtag $C$DW$T$48
    8840                    
    8841                    $C$DW$T$604     .dwtag  DW_TAG_typedef
    8842                            .dwattr $C$DW$T$604, DW_AT_name("div_t")
    8843                            .dwattr $C$DW$T$604, DW_AT_type(*$C$DW$T$48)
    8844                            .dwattr $C$DW$T$604, DW_AT_language(DW_LANG_C)
    8845                            .dwattr $C$DW$T$604, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.
    8846                            .dwattr $C$DW$T$604, DW_AT_decl_line(0x4e)
    8847                            .dwattr $C$DW$T$604, DW_AT_decl_column(0x23)
    8848                    
    8849                    
    8850                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    8851                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x08)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  162

    8852                    $C$DW$787       .dwtag  DW_TAG_member
    8853                            .dwattr $C$DW$787, DW_AT_type(*$C$DW$T$10)
    8854                            .dwattr $C$DW$787, DW_AT_name("quot")
    8855                            .dwattr $C$DW$787, DW_AT_TI_symbol_name("quot")
    8856                            .dwattr $C$DW$787, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8857                            .dwattr $C$DW$787, DW_AT_accessibility(DW_ACCESS_public)
    8858                            .dwattr $C$DW$787, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8859                            .dwattr $C$DW$787, DW_AT_decl_line(0x53)
    8860                            .dwattr $C$DW$787, DW_AT_decl_column(0x16)
    8861                    
    8862                    $C$DW$788       .dwtag  DW_TAG_member
    8863                            .dwattr $C$DW$788, DW_AT_type(*$C$DW$T$10)
    8864                            .dwattr $C$DW$788, DW_AT_name("rem")
    8865                            .dwattr $C$DW$788, DW_AT_TI_symbol_name("rem")
    8866                            .dwattr $C$DW$788, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8867                            .dwattr $C$DW$788, DW_AT_accessibility(DW_ACCESS_public)
    8868                            .dwattr $C$DW$788, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8869                            .dwattr $C$DW$788, DW_AT_decl_line(0x53)
    8870                            .dwattr $C$DW$788, DW_AT_decl_column(0x1c)
    8871                    
    8872                            .dwattr $C$DW$T$49, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.L
    8873                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x53)
    8874                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x10)
    8875                            .dwendtag $C$DW$T$49
    8876                    
    8877                    $C$DW$T$605     .dwtag  DW_TAG_typedef
    8878                            .dwattr $C$DW$T$605, DW_AT_name("ldiv_t")
    8879                            .dwattr $C$DW$T$605, DW_AT_type(*$C$DW$T$49)
    8880                            .dwattr $C$DW$T$605, DW_AT_language(DW_LANG_C)
    8881                            .dwattr $C$DW$T$605, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.
    8882                            .dwattr $C$DW$T$605, DW_AT_decl_line(0x53)
    8883                            .dwattr $C$DW$T$605, DW_AT_decl_column(0x23)
    8884                    
    8885                    
    8886                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    8887                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x10)
    8888                    $C$DW$789       .dwtag  DW_TAG_member
    8889                            .dwattr $C$DW$789, DW_AT_type(*$C$DW$T$14)
    8890                            .dwattr $C$DW$789, DW_AT_name("quot")
    8891                            .dwattr $C$DW$789, DW_AT_TI_symbol_name("quot")
    8892                            .dwattr $C$DW$789, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8893                            .dwattr $C$DW$789, DW_AT_accessibility(DW_ACCESS_public)
    8894                            .dwattr $C$DW$789, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8895                            .dwattr $C$DW$789, DW_AT_decl_line(0x5b)
    8896                            .dwattr $C$DW$789, DW_AT_decl_column(0x1c)
    8897                    
    8898                    $C$DW$790       .dwtag  DW_TAG_member
    8899                            .dwattr $C$DW$790, DW_AT_type(*$C$DW$T$14)
    8900                            .dwattr $C$DW$790, DW_AT_name("rem")
    8901                            .dwattr $C$DW$790, DW_AT_TI_symbol_name("rem")
    8902                            .dwattr $C$DW$790, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8903                            .dwattr $C$DW$790, DW_AT_accessibility(DW_ACCESS_public)
    8904                            .dwattr $C$DW$790, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.LT
    8905                            .dwattr $C$DW$790, DW_AT_decl_line(0x5b)
    8906                            .dwattr $C$DW$790, DW_AT_decl_column(0x22)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  163

    8907                    
    8908                            .dwattr $C$DW$T$50, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.L
    8909                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x5b)
    8910                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    8911                            .dwendtag $C$DW$T$50
    8912                    
    8913                    $C$DW$T$606     .dwtag  DW_TAG_typedef
    8914                            .dwattr $C$DW$T$606, DW_AT_name("lldiv_t")
    8915                            .dwattr $C$DW$T$606, DW_AT_type(*$C$DW$T$50)
    8916                            .dwattr $C$DW$T$606, DW_AT_language(DW_LANG_C)
    8917                            .dwattr $C$DW$T$606, DW_AT_decl_file("/opt/ti/ccs-latest/ccs/tools/compiler/ti-cgt-arm_20.2.1.
    8918                            .dwattr $C$DW$T$606, DW_AT_decl_line(0x5b)
    8919                            .dwattr $C$DW$T$606, DW_AT_decl_column(0x29)
    8920                    
    8921                    
    8922                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    8923                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x24)
    8924                    $C$DW$791       .dwtag  DW_TAG_member
    8925                            .dwattr $C$DW$791, DW_AT_type(*$C$DW$T$9)
    8926                            .dwattr $C$DW$791, DW_AT_name("Flags")
    8927                            .dwattr $C$DW$791, DW_AT_TI_symbol_name("Flags")
    8928                            .dwattr $C$DW$791, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8929                            .dwattr $C$DW$791, DW_AT_accessibility(DW_ACCESS_public)
    8930                            .dwattr $C$DW$791, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    8931                            .dwattr $C$DW$791, DW_AT_decl_line(0x90)
    8932                            .dwattr $C$DW$791, DW_AT_decl_column(0x0b)
    8933                    
    8934                    $C$DW$792       .dwtag  DW_TAG_member
    8935                            .dwattr $C$DW$792, DW_AT_type(*$C$DW$T$13)
    8936                            .dwattr $C$DW$792, DW_AT_name("Len")
    8937                            .dwattr $C$DW$792, DW_AT_TI_symbol_name("Len")
    8938                            .dwattr $C$DW$792, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8939                            .dwattr $C$DW$792, DW_AT_accessibility(DW_ACCESS_public)
    8940                            .dwattr $C$DW$792, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    8941                            .dwattr $C$DW$792, DW_AT_decl_line(0x91)
    8942                            .dwattr $C$DW$792, DW_AT_decl_column(0x0b)
    8943                    
    8944                    $C$DW$793       .dwtag  DW_TAG_member
    8945                            .dwattr $C$DW$793, DW_AT_type(*$C$DW$T$13)
    8946                            .dwattr $C$DW$793, DW_AT_name("MaxSize")
    8947                            .dwattr $C$DW$793, DW_AT_TI_symbol_name("MaxSize")
    8948                            .dwattr $C$DW$793, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8949                            .dwattr $C$DW$793, DW_AT_accessibility(DW_ACCESS_public)
    8950                            .dwattr $C$DW$793, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    8951                            .dwattr $C$DW$793, DW_AT_decl_line(0x92)
    8952                            .dwattr $C$DW$793, DW_AT_decl_column(0x0b)
    8953                    
    8954                    $C$DW$794       .dwtag  DW_TAG_member
    8955                            .dwattr $C$DW$794, DW_AT_type(*$C$DW$T$51)
    8956                            .dwattr $C$DW$794, DW_AT_name("Token")
    8957                            .dwattr $C$DW$794, DW_AT_TI_symbol_name("Token")
    8958                            .dwattr $C$DW$794, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8959                            .dwattr $C$DW$794, DW_AT_accessibility(DW_ACCESS_public)
    8960                            .dwattr $C$DW$794, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    8961                            .dwattr $C$DW$794, DW_AT_decl_line(0x93)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  164

    8962                            .dwattr $C$DW$794, DW_AT_decl_column(0x0b)
    8963                    
    8964                    $C$DW$795       .dwtag  DW_TAG_member
    8965                            .dwattr $C$DW$795, DW_AT_type(*$C$DW$T$13)
    8966                            .dwattr $C$DW$795, DW_AT_name("StorageSize")
    8967                            .dwattr $C$DW$795, DW_AT_TI_symbol_name("StorageSize")
    8968                            .dwattr $C$DW$795, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8969                            .dwattr $C$DW$795, DW_AT_accessibility(DW_ACCESS_public)
    8970                            .dwattr $C$DW$795, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    8971                            .dwattr $C$DW$795, DW_AT_decl_line(0x94)
    8972                            .dwattr $C$DW$795, DW_AT_decl_column(0x0b)
    8973                    
    8974                    $C$DW$796       .dwtag  DW_TAG_member
    8975                            .dwattr $C$DW$796, DW_AT_type(*$C$DW$T$13)
    8976                            .dwattr $C$DW$796, DW_AT_name("WriteCounter")
    8977                            .dwattr $C$DW$796, DW_AT_TI_symbol_name("WriteCounter")
    8978                            .dwattr $C$DW$796, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8979                            .dwattr $C$DW$796, DW_AT_accessibility(DW_ACCESS_public)
    8980                            .dwattr $C$DW$796, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    8981                            .dwattr $C$DW$796, DW_AT_decl_line(0x95)
    8982                            .dwattr $C$DW$796, DW_AT_decl_column(0x0b)
    8983                    
    8984                            .dwattr $C$DW$T$52, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs
    8985                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x8f)
    8986                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    8987                            .dwendtag $C$DW$T$52
    8988                    
    8989                    $C$DW$T$607     .dwtag  DW_TAG_typedef
    8990                            .dwattr $C$DW$T$607, DW_AT_name("SlFsFileInfo_t")
    8991                            .dwattr $C$DW$T$607, DW_AT_type(*$C$DW$T$52)
    8992                            .dwattr $C$DW$T$607, DW_AT_language(DW_LANG_C)
    8993                            .dwattr $C$DW$T$607, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/f
    8994                            .dwattr $C$DW$T$607, DW_AT_decl_line(0x96)
    8995                            .dwattr $C$DW$T$607, DW_AT_decl_column(0x02)
    8996                    
    8997                    
    8998                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    8999                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x10)
    9000                    $C$DW$797       .dwtag  DW_TAG_member
    9001                            .dwattr $C$DW$797, DW_AT_type(*$C$DW$T$51)
    9002                            .dwattr $C$DW$797, DW_AT_name("Key")
    9003                            .dwattr $C$DW$797, DW_AT_TI_symbol_name("Key")
    9004                            .dwattr $C$DW$797, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9005                            .dwattr $C$DW$797, DW_AT_accessibility(DW_ACCESS_public)
    9006                            .dwattr $C$DW$797, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9007                            .dwattr $C$DW$797, DW_AT_decl_line(0xb1)
    9008                            .dwattr $C$DW$797, DW_AT_decl_column(0x0b)
    9009                    
    9010                            .dwattr $C$DW$T$53, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs
    9011                            .dwattr $C$DW$T$53, DW_AT_decl_line(0xb0)
    9012                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
    9013                            .dwendtag $C$DW$T$53
    9014                    
    9015                    $C$DW$T$608     .dwtag  DW_TAG_typedef
    9016                            .dwattr $C$DW$T$608, DW_AT_name("SlFsKey_t")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  165

    9017                            .dwattr $C$DW$T$608, DW_AT_type(*$C$DW$T$53)
    9018                            .dwattr $C$DW$T$608, DW_AT_language(DW_LANG_C)
    9019                            .dwattr $C$DW$T$608, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/f
    9020                            .dwattr $C$DW$T$608, DW_AT_decl_line(0xb2)
    9021                            .dwattr $C$DW$T$608, DW_AT_decl_column(0x02)
    9022                    
    9023                    
    9024                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    9025                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    9026                    $C$DW$798       .dwtag  DW_TAG_member
    9027                            .dwattr $C$DW$798, DW_AT_type(*$C$DW$T$6)
    9028                            .dwattr $C$DW$798, DW_AT_name("Index")
    9029                            .dwattr $C$DW$798, DW_AT_TI_symbol_name("Index")
    9030                            .dwattr $C$DW$798, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9031                            .dwattr $C$DW$798, DW_AT_accessibility(DW_ACCESS_public)
    9032                            .dwattr $C$DW$798, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9033                            .dwattr $C$DW$798, DW_AT_decl_line(0xb6)
    9034                            .dwattr $C$DW$798, DW_AT_decl_column(0x09)
    9035                    
    9036                            .dwattr $C$DW$T$54, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs
    9037                            .dwattr $C$DW$T$54, DW_AT_decl_line(0xb5)
    9038                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    9039                            .dwendtag $C$DW$T$54
    9040                    
    9041                    $C$DW$T$263     .dwtag  DW_TAG_typedef
    9042                            .dwattr $C$DW$T$263, DW_AT_name("SlFsFileNameIndex_t")
    9043                            .dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$54)
    9044                            .dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
    9045                            .dwattr $C$DW$T$263, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/f
    9046                            .dwattr $C$DW$T$263, DW_AT_decl_line(0xb7)
    9047                            .dwattr $C$DW$T$263, DW_AT_decl_column(0x02)
    9048                    
    9049                    
    9050                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    9051                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
    9052                    $C$DW$799       .dwtag  DW_TAG_member
    9053                            .dwattr $C$DW$799, DW_AT_type(*$C$DW$T$13)
    9054                            .dwattr $C$DW$799, DW_AT_name("Operation")
    9055                            .dwattr $C$DW$799, DW_AT_TI_symbol_name("Operation")
    9056                            .dwattr $C$DW$799, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9057                            .dwattr $C$DW$799, DW_AT_accessibility(DW_ACCESS_public)
    9058                            .dwattr $C$DW$799, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9059                            .dwattr $C$DW$799, DW_AT_decl_line(0xca)
    9060                            .dwattr $C$DW$799, DW_AT_decl_column(0x08)
    9061                    
    9062                            .dwattr $C$DW$T$55, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs
    9063                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xc9)
    9064                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    9065                            .dwendtag $C$DW$T$55
    9066                    
    9067                    $C$DW$T$609     .dwtag  DW_TAG_typedef
    9068                            .dwattr $C$DW$T$609, DW_AT_name("SlFsRetToFactoryCommand_t")
    9069                            .dwattr $C$DW$T$609, DW_AT_type(*$C$DW$T$55)
    9070                            .dwattr $C$DW$T$609, DW_AT_language(DW_LANG_C)
    9071                            .dwattr $C$DW$T$609, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/f
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  166

    9072                            .dwattr $C$DW$T$609, DW_AT_decl_line(0xcb)
    9073                            .dwattr $C$DW$T$609, DW_AT_decl_column(0x02)
    9074                    
    9075                    
    9076                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    9077                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
    9078                    $C$DW$800       .dwtag  DW_TAG_member
    9079                            .dwattr $C$DW$800, DW_AT_type(*$C$DW$T$13)
    9080                            .dwattr $C$DW$800, DW_AT_name("IncludeFilters")
    9081                            .dwattr $C$DW$800, DW_AT_TI_symbol_name("IncludeFilters")
    9082                            .dwattr $C$DW$800, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9083                            .dwattr $C$DW$800, DW_AT_accessibility(DW_ACCESS_public)
    9084                            .dwattr $C$DW$800, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9085                            .dwattr $C$DW$800, DW_AT_decl_line(0xd1)
    9086                            .dwattr $C$DW$800, DW_AT_decl_column(0x12)
    9087                    
    9088                            .dwattr $C$DW$T$56, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs
    9089                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xd0)
    9090                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    9091                            .dwendtag $C$DW$T$56
    9092                    
    9093                    $C$DW$T$610     .dwtag  DW_TAG_typedef
    9094                            .dwattr $C$DW$T$610, DW_AT_name("SlFsControl_t")
    9095                            .dwattr $C$DW$T$610, DW_AT_type(*$C$DW$T$56)
    9096                            .dwattr $C$DW$T$610, DW_AT_language(DW_LANG_C)
    9097                            .dwattr $C$DW$T$610, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/f
    9098                            .dwattr $C$DW$T$610, DW_AT_decl_line(0xd3)
    9099                            .dwattr $C$DW$T$610, DW_AT_decl_column(0x02)
    9100                    
    9101                    
    9102                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    9103                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    9104                    $C$DW$801       .dwtag  DW_TAG_member
    9105                            .dwattr $C$DW$801, DW_AT_type(*$C$DW$T$9)
    9106                            .dwattr $C$DW$801, DW_AT_name("DeviceBlockSize")
    9107                            .dwattr $C$DW$801, DW_AT_TI_symbol_name("DeviceBlockSize")
    9108                            .dwattr $C$DW$801, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9109                            .dwattr $C$DW$801, DW_AT_accessibility(DW_ACCESS_public)
    9110                            .dwattr $C$DW$801, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9111                            .dwattr $C$DW$801, DW_AT_decl_line(0xd7)
    9112                            .dwattr $C$DW$801, DW_AT_decl_column(0x08)
    9113                    
    9114                    $C$DW$802       .dwtag  DW_TAG_member
    9115                            .dwattr $C$DW$802, DW_AT_type(*$C$DW$T$9)
    9116                            .dwattr $C$DW$802, DW_AT_name("DeviceBlocksCapacity")
    9117                            .dwattr $C$DW$802, DW_AT_TI_symbol_name("DeviceBlocksCapacity")
    9118                            .dwattr $C$DW$802, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9119                            .dwattr $C$DW$802, DW_AT_accessibility(DW_ACCESS_public)
    9120                            .dwattr $C$DW$802, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9121                            .dwattr $C$DW$802, DW_AT_decl_line(0xd8)
    9122                            .dwattr $C$DW$802, DW_AT_decl_column(0x08)
    9123                    
    9124                    $C$DW$803       .dwtag  DW_TAG_member
    9125                            .dwattr $C$DW$803, DW_AT_type(*$C$DW$T$9)
    9126                            .dwattr $C$DW$803, DW_AT_name("NumOfAllocatedBlocks")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  167

    9127                            .dwattr $C$DW$803, DW_AT_TI_symbol_name("NumOfAllocatedBlocks")
    9128                            .dwattr $C$DW$803, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9129                            .dwattr $C$DW$803, DW_AT_accessibility(DW_ACCESS_public)
    9130                            .dwattr $C$DW$803, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9131                            .dwattr $C$DW$803, DW_AT_decl_line(0xd9)
    9132                            .dwattr $C$DW$803, DW_AT_decl_column(0x08)
    9133                    
    9134                    $C$DW$804       .dwtag  DW_TAG_member
    9135                            .dwattr $C$DW$804, DW_AT_type(*$C$DW$T$9)
    9136                            .dwattr $C$DW$804, DW_AT_name("NumOfReservedBlocks")
    9137                            .dwattr $C$DW$804, DW_AT_TI_symbol_name("NumOfReservedBlocks")
    9138                            .dwattr $C$DW$804, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9139                            .dwattr $C$DW$804, DW_AT_accessibility(DW_ACCESS_public)
    9140                            .dwattr $C$DW$804, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9141                            .dwattr $C$DW$804, DW_AT_decl_line(0xda)
    9142                            .dwattr $C$DW$804, DW_AT_decl_column(0x08)
    9143                    
    9144                    $C$DW$805       .dwtag  DW_TAG_member
    9145                            .dwattr $C$DW$805, DW_AT_type(*$C$DW$T$9)
    9146                            .dwattr $C$DW$805, DW_AT_name("NumOfReservedBlocksForSystemfiles")
    9147                            .dwattr $C$DW$805, DW_AT_TI_symbol_name("NumOfReservedBlocksForSystemfiles")
    9148                            .dwattr $C$DW$805, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9149                            .dwattr $C$DW$805, DW_AT_accessibility(DW_ACCESS_public)
    9150                            .dwattr $C$DW$805, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9151                            .dwattr $C$DW$805, DW_AT_decl_line(0xdb)
    9152                            .dwattr $C$DW$805, DW_AT_decl_column(0x08)
    9153                    
    9154                    $C$DW$806       .dwtag  DW_TAG_member
    9155                            .dwattr $C$DW$806, DW_AT_type(*$C$DW$T$9)
    9156                            .dwattr $C$DW$806, DW_AT_name("LargestAllocatedGapInBlocks")
    9157                            .dwattr $C$DW$806, DW_AT_TI_symbol_name("LargestAllocatedGapInBlocks")
    9158                            .dwattr $C$DW$806, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    9159                            .dwattr $C$DW$806, DW_AT_accessibility(DW_ACCESS_public)
    9160                            .dwattr $C$DW$806, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9161                            .dwattr $C$DW$806, DW_AT_decl_line(0xdc)
    9162                            .dwattr $C$DW$806, DW_AT_decl_column(0x08)
    9163                    
    9164                    $C$DW$807       .dwtag  DW_TAG_member
    9165                            .dwattr $C$DW$807, DW_AT_type(*$C$DW$T$9)
    9166                            .dwattr $C$DW$807, DW_AT_name("NumOfAvailableBlocksForUserFiles")
    9167                            .dwattr $C$DW$807, DW_AT_TI_symbol_name("NumOfAvailableBlocksForUserFiles")
    9168                            .dwattr $C$DW$807, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9169                            .dwattr $C$DW$807, DW_AT_accessibility(DW_ACCESS_public)
    9170                            .dwattr $C$DW$807, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9171                            .dwattr $C$DW$807, DW_AT_decl_line(0xdd)
    9172                            .dwattr $C$DW$807, DW_AT_decl_column(0x08)
    9173                    
    9174                    $C$DW$808       .dwtag  DW_TAG_member
    9175                            .dwattr $C$DW$808, DW_AT_type(*$C$DW$T$57)
    9176                            .dwattr $C$DW$808, DW_AT_name("Padding")
    9177                            .dwattr $C$DW$808, DW_AT_TI_symbol_name("Padding")
    9178                            .dwattr $C$DW$808, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    9179                            .dwattr $C$DW$808, DW_AT_accessibility(DW_ACCESS_public)
    9180                            .dwattr $C$DW$808, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9181                            .dwattr $C$DW$808, DW_AT_decl_line(0xde)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  168

    9182                            .dwattr $C$DW$808, DW_AT_decl_column(0x08)
    9183                    
    9184                            .dwattr $C$DW$T$58, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs
    9185                            .dwattr $C$DW$T$58, DW_AT_decl_line(0xd6)
    9186                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    9187                            .dwendtag $C$DW$T$58
    9188                    
    9189                    $C$DW$T$60      .dwtag  DW_TAG_typedef
    9190                            .dwattr $C$DW$T$60, DW_AT_name("SlFsControlDeviceUsage_t")
    9191                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$58)
    9192                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    9193                            .dwattr $C$DW$T$60, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs
    9194                            .dwattr $C$DW$T$60, DW_AT_decl_line(0xdf)
    9195                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x03)
    9196                    
    9197                    
    9198                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    9199                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x14)
    9200                    $C$DW$809       .dwtag  DW_TAG_member
    9201                            .dwattr $C$DW$809, DW_AT_type(*$C$DW$T$6)
    9202                            .dwattr $C$DW$809, DW_AT_name("MaxFsFiles")
    9203                            .dwattr $C$DW$809, DW_AT_TI_symbol_name("MaxFsFiles")
    9204                            .dwattr $C$DW$809, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9205                            .dwattr $C$DW$809, DW_AT_accessibility(DW_ACCESS_public)
    9206                            .dwattr $C$DW$809, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9207                            .dwattr $C$DW$809, DW_AT_decl_line(0xe3)
    9208                            .dwattr $C$DW$809, DW_AT_decl_column(0x08)
    9209                    
    9210                    $C$DW$810       .dwtag  DW_TAG_member
    9211                            .dwattr $C$DW$810, DW_AT_type(*$C$DW$T$6)
    9212                            .dwattr $C$DW$810, DW_AT_name("IsDevlopmentFormatType")
    9213                            .dwattr $C$DW$810, DW_AT_TI_symbol_name("IsDevlopmentFormatType")
    9214                            .dwattr $C$DW$810, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    9215                            .dwattr $C$DW$810, DW_AT_accessibility(DW_ACCESS_public)
    9216                            .dwattr $C$DW$810, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9217                            .dwattr $C$DW$810, DW_AT_decl_line(0xe4)
    9218                            .dwattr $C$DW$810, DW_AT_decl_column(0x08)
    9219                    
    9220                    $C$DW$811       .dwtag  DW_TAG_member
    9221                            .dwattr $C$DW$811, DW_AT_type(*$C$DW$T$6)
    9222                            .dwattr $C$DW$811, DW_AT_name("Bundlestate")
    9223                            .dwattr $C$DW$811, DW_AT_TI_symbol_name("Bundlestate")
    9224                            .dwattr $C$DW$811, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9225                            .dwattr $C$DW$811, DW_AT_accessibility(DW_ACCESS_public)
    9226                            .dwattr $C$DW$811, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9227                            .dwattr $C$DW$811, DW_AT_decl_line(0xe5)
    9228                            .dwattr $C$DW$811, DW_AT_decl_column(0x08)
    9229                    
    9230                    $C$DW$812       .dwtag  DW_TAG_member
    9231                            .dwattr $C$DW$812, DW_AT_type(*$C$DW$T$6)
    9232                            .dwattr $C$DW$812, DW_AT_name("Reserved")
    9233                            .dwattr $C$DW$812, DW_AT_TI_symbol_name("Reserved")
    9234                            .dwattr $C$DW$812, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    9235                            .dwattr $C$DW$812, DW_AT_accessibility(DW_ACCESS_public)
    9236                            .dwattr $C$DW$812, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  169

    9237                            .dwattr $C$DW$812, DW_AT_decl_line(0xe6)
    9238                            .dwattr $C$DW$812, DW_AT_decl_column(0x08)
    9239                    
    9240                    $C$DW$813       .dwtag  DW_TAG_member
    9241                            .dwattr $C$DW$813, DW_AT_type(*$C$DW$T$6)
    9242                            .dwattr $C$DW$813, DW_AT_name("MaxFsFilesReservedForSysFiles")
    9243                            .dwattr $C$DW$813, DW_AT_TI_symbol_name("MaxFsFilesReservedForSysFiles")
    9244                            .dwattr $C$DW$813, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9245                            .dwattr $C$DW$813, DW_AT_accessibility(DW_ACCESS_public)
    9246                            .dwattr $C$DW$813, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9247                            .dwattr $C$DW$813, DW_AT_decl_line(0xe7)
    9248                            .dwattr $C$DW$813, DW_AT_decl_column(0x08)
    9249                    
    9250                    $C$DW$814       .dwtag  DW_TAG_member
    9251                            .dwattr $C$DW$814, DW_AT_type(*$C$DW$T$6)
    9252                            .dwattr $C$DW$814, DW_AT_name("ActualNumOfUserFiles")
    9253                            .dwattr $C$DW$814, DW_AT_TI_symbol_name("ActualNumOfUserFiles")
    9254                            .dwattr $C$DW$814, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    9255                            .dwattr $C$DW$814, DW_AT_accessibility(DW_ACCESS_public)
    9256                            .dwattr $C$DW$814, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9257                            .dwattr $C$DW$814, DW_AT_decl_line(0xe8)
    9258                            .dwattr $C$DW$814, DW_AT_decl_column(0x08)
    9259                    
    9260                    $C$DW$815       .dwtag  DW_TAG_member
    9261                            .dwattr $C$DW$815, DW_AT_type(*$C$DW$T$6)
    9262                            .dwattr $C$DW$815, DW_AT_name("ActualNumOfSysFiles")
    9263                            .dwattr $C$DW$815, DW_AT_TI_symbol_name("ActualNumOfSysFiles")
    9264                            .dwattr $C$DW$815, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9265                            .dwattr $C$DW$815, DW_AT_accessibility(DW_ACCESS_public)
    9266                            .dwattr $C$DW$815, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9267                            .dwattr $C$DW$815, DW_AT_decl_line(0xe9)
    9268                            .dwattr $C$DW$815, DW_AT_decl_column(0x08)
    9269                    
    9270                    $C$DW$816       .dwtag  DW_TAG_member
    9271                            .dwattr $C$DW$816, DW_AT_type(*$C$DW$T$6)
    9272                            .dwattr $C$DW$816, DW_AT_name("Padding")
    9273                            .dwattr $C$DW$816, DW_AT_TI_symbol_name("Padding")
    9274                            .dwattr $C$DW$816, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    9275                            .dwattr $C$DW$816, DW_AT_accessibility(DW_ACCESS_public)
    9276                            .dwattr $C$DW$816, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9277                            .dwattr $C$DW$816, DW_AT_decl_line(0xea)
    9278                            .dwattr $C$DW$816, DW_AT_decl_column(0x08)
    9279                    
    9280                    $C$DW$817       .dwtag  DW_TAG_member
    9281                            .dwattr $C$DW$817, DW_AT_type(*$C$DW$T$13)
    9282                            .dwattr $C$DW$817, DW_AT_name("NumOfAlerts")
    9283                            .dwattr $C$DW$817, DW_AT_TI_symbol_name("NumOfAlerts")
    9284                            .dwattr $C$DW$817, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9285                            .dwattr $C$DW$817, DW_AT_accessibility(DW_ACCESS_public)
    9286                            .dwattr $C$DW$817, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9287                            .dwattr $C$DW$817, DW_AT_decl_line(0xeb)
    9288                            .dwattr $C$DW$817, DW_AT_decl_column(0x08)
    9289                    
    9290                    $C$DW$818       .dwtag  DW_TAG_member
    9291                            .dwattr $C$DW$818, DW_AT_type(*$C$DW$T$13)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:21 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  170

    9292                            .dwattr $C$DW$818, DW_AT_name("NumOfAlertsThreshold")
    9293                            .dwattr $C$DW$818, DW_AT_TI_symbol_name("NumOfAlertsThreshold")
    9294                            .dwattr $C$DW$818, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9295                            .dwattr $C$DW$818, DW_AT_accessibility(DW_ACCESS_public)
    9296                            .dwattr $C$DW$818, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9297                            .dwattr $C$DW$818, DW_AT_decl_line(0xec)
    9298                            .dwattr $C$DW$818, DW_AT_decl_column(0x08)
    9299                    
    9300                    $C$DW$819       .dwtag  DW_TAG_member
    9301                            .dwattr $C$DW$819, DW_AT_type(*$C$DW$T$9)
    9302                            .dwattr $C$DW$819, DW_AT_name("FATWriteCounter")
    9303                            .dwattr $C$DW$819, DW_AT_TI_symbol_name("FATWriteCounter")
    9304                            .dwattr $C$DW$819, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9305                            .dwattr $C$DW$819, DW_AT_accessibility(DW_ACCESS_public)
    9306                            .dwattr $C$DW$819, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/fs.
    9307                            .dwattr $C$DW$819, DW_AT_decl_line(0xed)
    9308                            .dwattr $C$DW$819, DW_AT_decl_column(0x08)
    9309                    
