;******************************************************************************
;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.1.LTS *
;* Date/Time created: Wed Sep 16 12:09:22 2020                                *
;******************************************************************************
	.compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on --endian=little --float_support=none --hll_source=on --object_format=elf --quiet --section_sizes=on --silicon_version=7M4 --symdebug:dwarf --symdebug:dwarf_version=3 --unaligned_access=on 
	.thumb

$C$DW$CU	.dwtag  DW_TAG_compile_unit
	.dwattr $C$DW$CU, DW_AT_name("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.1.LTS Copyright (c) 1996-2018 Texas Instruments Incorporated")
	.dwattr $C$DW$CU, DW_AT_TI_version(0x01)
	.dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/ccs/Release")
	.global	g_fNetIfCB
	.data
	.align	4
	.elfsym	g_fNetIfCB,SYM_SIZE(4)
g_fNetIfCB:
	.bits		0,32
			; g_fNetIfCB @ 0

$C$DW$1	.dwtag  DW_TAG_variable
	.dwattr $C$DW$1, DW_AT_name("g_fNetIfCB")
	.dwattr $C$DW$1, DW_AT_TI_symbol_name("g_fNetIfCB")
	.dwattr $C$DW$1, DW_AT_location[DW_OP_addr g_fNetIfCB]
	.dwattr $C$DW$1, DW_AT_type(*$C$DW$T$486)
	.dwattr $C$DW$1, DW_AT_external

	.dwattr $C$DW$T$660, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$T$660, DW_AT_decl_column(0x02)


$C$DW$T$661	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$661, DW_AT_byte_size(0x01)
$C$DW$975	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$975, DW_AT_name("SL_NETCFG_DHCP_OPT_DISABLE_LLA")
	.dwattr $C$DW$975, DW_AT_const_value(0x02)
	.dwattr $C$DW$975, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netcfg.h")
	.dwattr $C$DW$975, DW_AT_decl_line(0xa4)
	.dwattr $C$DW$975, DW_AT_decl_column(0x05)

$C$DW$976	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$976, DW_AT_name("SL_NETCFG_DHCP_OPT_RELEASE_IP_BEFORE_DISCONNECT")
	.dwattr $C$DW$976, DW_AT_const_value(0x04)
	.dwattr $C$DW$976, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netcfg.h")
	.dwattr $C$DW$976, DW_AT_decl_line(0xa5)
	.dwattr $C$DW$976, DW_AT_decl_column(0x05)

$C$DW$977	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$977, DW_AT_name("MAX_SL_NETCFG_DHCP_OPT")
	.dwattr $C$DW$977, DW_AT_const_value(0xff)
	.dwattr $C$DW$977, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netcfg.h")
	.dwattr $C$DW$977, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$977, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$661, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netcfg.h")
	.dwattr $C$DW$T$661, DW_AT_decl_line(0xa3)
	.dwattr $C$DW$T$661, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$661

$C$DW$T$662	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$662, DW_AT_name("SlNetCfgDhcpOption_e")
	.dwattr $C$DW$T$662, DW_AT_type(*$C$DW$T$661)
	.dwattr $C$DW$T$662, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$662, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netcfg.h")
	.dwattr $C$DW$T$662, DW_AT_decl_line(0xa7)
	.dwattr $C$DW$T$662, DW_AT_decl_column(0x03)


$C$DW$T$663	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$663, DW_AT_byte_size(0x01)
$C$DW$978	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$978, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MIN")
	.dwattr $C$DW$978, DW_AT_const_value(0x01)
	.dwattr $C$DW$978, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
	.dwattr $C$DW$978, DW_AT_decl_line(0x144)
	.dwattr $C$DW$978, DW_AT_decl_column(0x05)

$C$DW$979	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$979, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_LOW")
	.dwattr $C$DW$979, DW_AT_const_value(0x02)
	.dwattr $C$DW$979, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
	.dwattr $C$DW$979, DW_AT_decl_line(0x145)
	.dwattr $C$DW$979, DW_AT_decl_column(0x05)

$C$DW$980	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$980, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_DEFAULT")
	.dwattr $C$DW$980, DW_AT_const_value(0x03)
	.dwattr $C$DW$980, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
	.dwattr $C$DW$980, DW_AT_decl_line(0x146)
	.dwattr $C$DW$980, DW_AT_decl_column(0x05)

$C$DW$981	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$981, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MED")
	.dwattr $C$DW$981, DW_AT_const_value(0x04)
	.dwattr $C$DW$981, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
	.dwattr $C$DW$981, DW_AT_decl_line(0x147)
	.dwattr $C$DW$981, DW_AT_decl_column(0x05)

$C$DW$982	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$982, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_HIGH")
	.dwattr $C$DW$982, DW_AT_const_value(0x05)
	.dwattr $C$DW$982, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
	.dwattr $C$DW$982, DW_AT_decl_line(0x148)
	.dwattr $C$DW$982, DW_AT_decl_column(0x05)

$C$DW$983	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$983, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MAX")
	.dwattr $C$DW$983, DW_AT_const_value(0x06)
	.dwattr $C$DW$983, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
	.dwattr $C$DW$983, DW_AT_decl_line(0x149)
	.dwattr $C$DW$983, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$663, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
	.dwattr $C$DW$T$663, DW_AT_decl_line(0x143)
	.dwattr $C$DW$T$663, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$663

$C$DW$T$664	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$664, DW_AT_name("SlNetSockTxInhibitThreshold_e")
	.dwattr $C$DW$T$664, DW_AT_type(*$C$DW$T$663)
	.dwattr $C$DW$T$664, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$664, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
	.dwattr $C$DW$T$664, DW_AT_decl_line(0x14a)
	.dwattr $C$DW$T$664, DW_AT_decl_column(0x03)


$C$DW$T$665	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$665, DW_AT_byte_size(0x01)
$C$DW$984	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$984, DW_AT_name("SLNETIF_STATE_DISABLE")
	.dwattr $C$DW$984, DW_AT_const_value(0x00)
	.dwattr $C$DW$984, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetif.h")
	.dwattr $C$DW$984, DW_AT_decl_line(0x62)
	.dwattr $C$DW$984, DW_AT_decl_column(0x05)

$C$DW$985	.dwtag  DW_TAG_enumerator
	.dwattr $C$DW$985, DW_AT_name("SLNETIF_STATE_ENABLE")
	.dwattr $C$DW$985, DW_AT_const_value(0x01)
	.dwattr $C$DW$985, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetif.h")
	.dwattr $C$DW$985, DW_AT_decl_line(0x63)
	.dwattr $C$DW$985, DW_AT_decl_column(0x05)

	.dwattr $C$DW$T$665, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetif.h")
	.dwattr $C$DW$T$665, DW_AT_decl_line(0x61)
	.dwattr $C$DW$T$665, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$665

$C$DW$T$666	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$666, DW_AT_name("SlNetIfState_e")
	.dwattr $C$DW$T$666, DW_AT_type(*$C$DW$T$665)
	.dwattr $C$DW$T$666, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$666, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetif.h")
	.dwattr $C$DW$T$666, DW_AT_decl_line(0x64)
	.dwattr $C$DW$T$666, DW_AT_decl_column(0x03)


$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_byte_size(0x0c)
$C$DW$986	.dwtag  DW_TAG_member
	.dwattr $C$DW$986, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$986, DW_AT_name("Type")
	.dwattr $C$DW$986, DW_AT_TI_symbol_name("Type")
	.dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$986, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$986, DW_AT_decl_line(0x2e8)
	.dwattr $C$DW$986, DW_AT_decl_column(0x0b)

$C$DW$987	.dwtag  DW_TAG_member
	.dwattr $C$DW$987, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$987, DW_AT_name("Key")
	.dwattr $C$DW$987, DW_AT_TI_symbol_name("Key")
	.dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$987, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$987, DW_AT_decl_line(0x2e9)
	.dwattr $C$DW$987, DW_AT_decl_column(0x0b)

$C$DW$988	.dwtag  DW_TAG_member
	.dwattr $C$DW$988, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$988, DW_AT_name("KeyLen")
	.dwattr $C$DW$988, DW_AT_TI_symbol_name("KeyLen")
	.dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$988, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$988, DW_AT_decl_line(0x2ea)
	.dwattr $C$DW$988, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x2e7)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$25

$C$DW$T$74	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$74, DW_AT_name("SlWlanSecParams_t")
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$74, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$74, DW_AT_decl_line(0x2eb)
	.dwattr $C$DW$T$74, DW_AT_decl_column(0x02)

$C$DW$T$667	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$667, DW_AT_type(*$C$DW$T$74)

$C$DW$T$668	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$668, DW_AT_type(*$C$DW$T$667)
	.dwattr $C$DW$T$668, DW_AT_address_class(0x20)

$C$DW$T$669	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$669, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$T$669, DW_AT_address_class(0x20)


$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
$C$DW$989	.dwtag  DW_TAG_member
	.dwattr $C$DW$989, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$989, DW_AT_name("User")
	.dwattr $C$DW$989, DW_AT_TI_symbol_name("User")
	.dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$989, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$989, DW_AT_decl_line(0x2ef)
	.dwattr $C$DW$989, DW_AT_decl_column(0x0b)

$C$DW$990	.dwtag  DW_TAG_member
	.dwattr $C$DW$990, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$990, DW_AT_name("UserLen")
	.dwattr $C$DW$990, DW_AT_TI_symbol_name("UserLen")
	.dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$990, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$990, DW_AT_decl_line(0x2f0)
	.dwattr $C$DW$990, DW_AT_decl_column(0x0b)

$C$DW$991	.dwtag  DW_TAG_member
	.dwattr $C$DW$991, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$991, DW_AT_name("AnonUser")
	.dwattr $C$DW$991, DW_AT_TI_symbol_name("AnonUser")
	.dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$991, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$991, DW_AT_decl_line(0x2f1)
	.dwattr $C$DW$991, DW_AT_decl_column(0x0b)

$C$DW$992	.dwtag  DW_TAG_member
	.dwattr $C$DW$992, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$992, DW_AT_name("AnonUserLen")
	.dwattr $C$DW$992, DW_AT_TI_symbol_name("AnonUserLen")
	.dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$992, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$992, DW_AT_decl_line(0x2f2)
	.dwattr $C$DW$992, DW_AT_decl_column(0x0b)

$C$DW$993	.dwtag  DW_TAG_member
	.dwattr $C$DW$993, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$993, DW_AT_name("CertIndex")
	.dwattr $C$DW$993, DW_AT_TI_symbol_name("CertIndex")
	.dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
	.dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$993, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$993, DW_AT_decl_line(0x2f3)
	.dwattr $C$DW$993, DW_AT_decl_column(0x0b)

$C$DW$994	.dwtag  DW_TAG_member
	.dwattr $C$DW$994, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$994, DW_AT_name("EapMethod")
	.dwattr $C$DW$994, DW_AT_TI_symbol_name("EapMethod")
	.dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$994, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$994, DW_AT_decl_line(0x2f4)
	.dwattr $C$DW$994, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$26, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x2ee)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$26

$C$DW$T$75	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$75, DW_AT_name("SlWlanSecParamsExt_t")
	.dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$75, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$75, DW_AT_decl_line(0x2f5)
	.dwattr $C$DW$T$75, DW_AT_decl_column(0x02)

$C$DW$T$670	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$670, DW_AT_type(*$C$DW$T$75)

$C$DW$T$671	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$671, DW_AT_type(*$C$DW$T$670)
	.dwattr $C$DW$T$671, DW_AT_address_class(0x20)

$C$DW$T$672	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$672, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$T$672, DW_AT_address_class(0x20)


$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
$C$DW$995	.dwtag  DW_TAG_member
	.dwattr $C$DW$995, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$995, DW_AT_name("ChipId")
	.dwattr $C$DW$995, DW_AT_TI_symbol_name("ChipId")
	.dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$995, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$995, DW_AT_decl_line(0x127)
	.dwattr $C$DW$995, DW_AT_decl_column(0x0d)

$C$DW$996	.dwtag  DW_TAG_member
	.dwattr $C$DW$996, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$996, DW_AT_name("MoreData")
	.dwattr $C$DW$996, DW_AT_TI_symbol_name("MoreData")
	.dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$996, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$996, DW_AT_decl_line(0x128)
	.dwattr $C$DW$996, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$27, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x126)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$27

$C$DW$T$673	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$673, DW_AT_name("SlDeviceInitInfo_t")
	.dwattr $C$DW$T$673, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$673, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$673, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$T$673, DW_AT_decl_line(0x129)
	.dwattr $C$DW$T$673, DW_AT_decl_column(0x02)

$C$DW$T$674	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$674, DW_AT_type(*$C$DW$T$673)
	.dwattr $C$DW$T$674, DW_AT_address_class(0x20)


$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_byte_size(0x28)
$C$DW$997	.dwtag  DW_TAG_member
	.dwattr $C$DW$997, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$997, DW_AT_name("ProvisioningStatus")
	.dwattr $C$DW$997, DW_AT_TI_symbol_name("ProvisioningStatus")
	.dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$997, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$997, DW_AT_decl_line(0x28e)
	.dwattr $C$DW$997, DW_AT_decl_column(0x0a)

$C$DW$998	.dwtag  DW_TAG_member
	.dwattr $C$DW$998, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$998, DW_AT_name("Role")
	.dwattr $C$DW$998, DW_AT_TI_symbol_name("Role")
	.dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$998, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$998, DW_AT_decl_line(0x28f)
	.dwattr $C$DW$998, DW_AT_decl_column(0x0a)

$C$DW$999	.dwtag  DW_TAG_member
	.dwattr $C$DW$999, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$999, DW_AT_name("WlanStatus")
	.dwattr $C$DW$999, DW_AT_TI_symbol_name("WlanStatus")
	.dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$999, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$999, DW_AT_decl_line(0x290)
	.dwattr $C$DW$999, DW_AT_decl_column(0x0a)

$C$DW$1000	.dwtag  DW_TAG_member
	.dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1000, DW_AT_name("Ssidlen")
	.dwattr $C$DW$1000, DW_AT_TI_symbol_name("Ssidlen")
	.dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
	.dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1000, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1000, DW_AT_decl_line(0x291)
	.dwattr $C$DW$1000, DW_AT_decl_column(0x0a)

$C$DW$1001	.dwtag  DW_TAG_member
	.dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1001, DW_AT_name("Ssid")
	.dwattr $C$DW$1001, DW_AT_TI_symbol_name("Ssid")
	.dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1001, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1001, DW_AT_decl_line(0x292)
	.dwattr $C$DW$1001, DW_AT_decl_column(0x0a)

$C$DW$1002	.dwtag  DW_TAG_member
	.dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1002, DW_AT_name("Reserved")
	.dwattr $C$DW$1002, DW_AT_TI_symbol_name("Reserved")
	.dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1002, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1002, DW_AT_decl_line(0x293)
	.dwattr $C$DW$1002, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$29, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x28d)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$29

$C$DW$T$337	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$337, DW_AT_name("SlWlanEventProvisioningStatus_t")
	.dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$337, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$337, DW_AT_decl_line(0x294)
	.dwattr $C$DW$T$337, DW_AT_decl_column(0x02)

$C$DW$T$675	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$675, DW_AT_type(*$C$DW$T$337)
	.dwattr $C$DW$T$675, DW_AT_address_class(0x20)


$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_byte_size(0x28)
$C$DW$1003	.dwtag  DW_TAG_member
	.dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1003, DW_AT_name("SsidLen")
	.dwattr $C$DW$1003, DW_AT_TI_symbol_name("SsidLen")
	.dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1003, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1003, DW_AT_decl_line(0x249)
	.dwattr $C$DW$1003, DW_AT_decl_column(0x0d)

$C$DW$1004	.dwtag  DW_TAG_member
	.dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1004, DW_AT_name("SsidName")
	.dwattr $C$DW$1004, DW_AT_TI_symbol_name("SsidName")
	.dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1004, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1004, DW_AT_decl_line(0x24a)
	.dwattr $C$DW$1004, DW_AT_decl_column(0x0d)

$C$DW$1005	.dwtag  DW_TAG_member
	.dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1005, DW_AT_name("Bssid")
	.dwattr $C$DW$1005, DW_AT_TI_symbol_name("Bssid")
	.dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1005, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1005, DW_AT_decl_line(0x24b)
	.dwattr $C$DW$1005, DW_AT_decl_column(0x0d)

$C$DW$1006	.dwtag  DW_TAG_member
	.dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1006, DW_AT_name("Channel")
	.dwattr $C$DW$1006, DW_AT_TI_symbol_name("Channel")
	.dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1006, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1006, DW_AT_decl_line(0x24c)
	.dwattr $C$DW$1006, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$31, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x248)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$31

$C$DW$T$325	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$325, DW_AT_name("SlWlanEventConnect_t")
	.dwattr $C$DW$T$325, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$325, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$325, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$325, DW_AT_decl_line(0x24d)
	.dwattr $C$DW$T$325, DW_AT_decl_column(0x03)


$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_byte_size(0x28)
$C$DW$1007	.dwtag  DW_TAG_member
	.dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1007, DW_AT_name("SsidLen")
	.dwattr $C$DW$1007, DW_AT_TI_symbol_name("SsidLen")
	.dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1007, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1007, DW_AT_decl_line(0x251)
	.dwattr $C$DW$1007, DW_AT_decl_column(0x0d)

$C$DW$1008	.dwtag  DW_TAG_member
	.dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1008, DW_AT_name("SsidName")
	.dwattr $C$DW$1008, DW_AT_TI_symbol_name("SsidName")
	.dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1008, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1008, DW_AT_decl_line(0x252)
	.dwattr $C$DW$1008, DW_AT_decl_column(0x0d)

$C$DW$1009	.dwtag  DW_TAG_member
	.dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1009, DW_AT_name("Bssid")
	.dwattr $C$DW$1009, DW_AT_TI_symbol_name("Bssid")
	.dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1009, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1009, DW_AT_decl_line(0x253)
	.dwattr $C$DW$1009, DW_AT_decl_column(0x0d)

$C$DW$1010	.dwtag  DW_TAG_member
	.dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1010, DW_AT_name("ReasonCode")
	.dwattr $C$DW$1010, DW_AT_TI_symbol_name("ReasonCode")
	.dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1010, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1010, DW_AT_decl_line(0x254)
	.dwattr $C$DW$1010, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$32, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x250)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$32

$C$DW$T$326	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$326, DW_AT_name("SlWlanEventDisconnect_t")
	.dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$326, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$326, DW_AT_decl_line(0x255)
	.dwattr $C$DW$T$326, DW_AT_decl_column(0x03)


$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
$C$DW$1011	.dwtag  DW_TAG_member
	.dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1011, DW_AT_name("Mac")
	.dwattr $C$DW$1011, DW_AT_TI_symbol_name("Mac")
	.dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1011, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1011, DW_AT_decl_line(0x259)
	.dwattr $C$DW$1011, DW_AT_decl_column(0x0b)

$C$DW$1012	.dwtag  DW_TAG_member
	.dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1012, DW_AT_name("Padding")
	.dwattr $C$DW$1012, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1012, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1012, DW_AT_decl_line(0x25a)
	.dwattr $C$DW$1012, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$34, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x258)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$34

$C$DW$T$327	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$327, DW_AT_name("SlWlanEventSTAAdded_t")
	.dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$327, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$327, DW_AT_decl_line(0x25b)
	.dwattr $C$DW$T$327, DW_AT_decl_column(0x02)

$C$DW$T$328	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$328, DW_AT_name("SlWlanEventSTARemoved_t")
	.dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$328, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$328, DW_AT_decl_line(0x25b)
	.dwattr $C$DW$T$328, DW_AT_decl_column(0x19)


$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_byte_size(0x4c)
$C$DW$1013	.dwtag  DW_TAG_member
	.dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1013, DW_AT_name("SsidLen")
	.dwattr $C$DW$1013, DW_AT_TI_symbol_name("SsidLen")
	.dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1013, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1013, DW_AT_decl_line(0x260)
	.dwattr $C$DW$1013, DW_AT_decl_column(0x0d)

$C$DW$1014	.dwtag  DW_TAG_member
	.dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1014, DW_AT_name("SsidName")
	.dwattr $C$DW$1014, DW_AT_TI_symbol_name("SsidName")
	.dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1014, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1014, DW_AT_decl_line(0x261)
	.dwattr $C$DW$1014, DW_AT_decl_column(0x0d)

$C$DW$1015	.dwtag  DW_TAG_member
	.dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1015, DW_AT_name("Bssid")
	.dwattr $C$DW$1015, DW_AT_TI_symbol_name("Bssid")
	.dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1015, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1015, DW_AT_decl_line(0x262)
	.dwattr $C$DW$1015, DW_AT_decl_column(0x0d)

$C$DW$1016	.dwtag  DW_TAG_member
	.dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1016, DW_AT_name("Reserved")
	.dwattr $C$DW$1016, DW_AT_TI_symbol_name("Reserved")
	.dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1016, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1016, DW_AT_decl_line(0x263)
	.dwattr $C$DW$1016, DW_AT_decl_column(0x0d)

$C$DW$1017	.dwtag  DW_TAG_member
	.dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1017, DW_AT_name("GoDeviceNameLen")
	.dwattr $C$DW$1017, DW_AT_TI_symbol_name("GoDeviceNameLen")
	.dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1017, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1017, DW_AT_decl_line(0x264)
	.dwattr $C$DW$1017, DW_AT_decl_column(0x0d)

$C$DW$1018	.dwtag  DW_TAG_member
	.dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1018, DW_AT_name("GoDeviceName")
	.dwattr $C$DW$1018, DW_AT_TI_symbol_name("GoDeviceName")
	.dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1018, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1018, DW_AT_decl_line(0x265)
	.dwattr $C$DW$1018, DW_AT_decl_column(0x0d)

$C$DW$1019	.dwtag  DW_TAG_member
	.dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1019, DW_AT_name("Padding")
	.dwattr $C$DW$1019, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1019, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1019, DW_AT_decl_line(0x266)
	.dwattr $C$DW$1019, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$36, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x25f)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$36

$C$DW$T$329	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$329, DW_AT_name("SlWlanEventP2PConnect_t")
	.dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$329, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$329, DW_AT_decl_line(0x267)
	.dwattr $C$DW$T$329, DW_AT_decl_column(0x03)


$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_byte_size(0x4c)
$C$DW$1020	.dwtag  DW_TAG_member
	.dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1020, DW_AT_name("SsidLen")
	.dwattr $C$DW$1020, DW_AT_TI_symbol_name("SsidLen")
	.dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1020, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1020, DW_AT_decl_line(0x26b)
	.dwattr $C$DW$1020, DW_AT_decl_column(0x0d)

$C$DW$1021	.dwtag  DW_TAG_member
	.dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1021, DW_AT_name("SsidName")
	.dwattr $C$DW$1021, DW_AT_TI_symbol_name("SsidName")
	.dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1021, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1021, DW_AT_decl_line(0x26c)
	.dwattr $C$DW$1021, DW_AT_decl_column(0x0d)

$C$DW$1022	.dwtag  DW_TAG_member
	.dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1022, DW_AT_name("Bssid")
	.dwattr $C$DW$1022, DW_AT_TI_symbol_name("Bssid")
	.dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1022, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1022, DW_AT_decl_line(0x26d)
	.dwattr $C$DW$1022, DW_AT_decl_column(0x0d)

$C$DW$1023	.dwtag  DW_TAG_member
	.dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1023, DW_AT_name("ReasonCode")
	.dwattr $C$DW$1023, DW_AT_TI_symbol_name("ReasonCode")
	.dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1023, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1023, DW_AT_decl_line(0x26e)
	.dwattr $C$DW$1023, DW_AT_decl_column(0x0d)

$C$DW$1024	.dwtag  DW_TAG_member
	.dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1024, DW_AT_name("GoDeviceNameLen")
	.dwattr $C$DW$1024, DW_AT_TI_symbol_name("GoDeviceNameLen")
	.dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1024, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1024, DW_AT_decl_line(0x26f)
	.dwattr $C$DW$1024, DW_AT_decl_column(0x0d)

$C$DW$1025	.dwtag  DW_TAG_member
	.dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1025, DW_AT_name("GoDeviceName")
	.dwattr $C$DW$1025, DW_AT_TI_symbol_name("GoDeviceName")
	.dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
	.dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1025, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1025, DW_AT_decl_line(0x270)
	.dwattr $C$DW$1025, DW_AT_decl_column(0x0d)

$C$DW$1026	.dwtag  DW_TAG_member
	.dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$1026, DW_AT_name("Padding")
	.dwattr $C$DW$1026, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
	.dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1026, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1026, DW_AT_decl_line(0x271)
	.dwattr $C$DW$1026, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$37, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x26a)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$37

$C$DW$T$330	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$330, DW_AT_name("SlWlanEventP2PDisconnect_t")
	.dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$330, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$330, DW_AT_decl_line(0x272)
	.dwattr $C$DW$T$330, DW_AT_decl_column(0x03)


$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_byte_size(0x48)
$C$DW$1027	.dwtag  DW_TAG_member
	.dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1027, DW_AT_name("Mac")
	.dwattr $C$DW$1027, DW_AT_TI_symbol_name("Mac")
	.dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1027, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1027, DW_AT_decl_line(0x276)
	.dwattr $C$DW$1027, DW_AT_decl_column(0x0d)

$C$DW$1028	.dwtag  DW_TAG_member
	.dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1028, DW_AT_name("ClDeviceNameLen")
	.dwattr $C$DW$1028, DW_AT_TI_symbol_name("ClDeviceNameLen")
	.dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1028, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1028, DW_AT_decl_line(0x277)
	.dwattr $C$DW$1028, DW_AT_decl_column(0x0d)

$C$DW$1029	.dwtag  DW_TAG_member
	.dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1029, DW_AT_name("ClDeviceName")
	.dwattr $C$DW$1029, DW_AT_TI_symbol_name("ClDeviceName")
	.dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
	.dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1029, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1029, DW_AT_decl_line(0x278)
	.dwattr $C$DW$1029, DW_AT_decl_column(0x0d)

$C$DW$1030	.dwtag  DW_TAG_member
	.dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1030, DW_AT_name("OwnSsidLen")
	.dwattr $C$DW$1030, DW_AT_TI_symbol_name("OwnSsidLen")
	.dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1030, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1030, DW_AT_decl_line(0x279)
	.dwattr $C$DW$1030, DW_AT_decl_column(0x0d)

$C$DW$1031	.dwtag  DW_TAG_member
	.dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1031, DW_AT_name("OwnSsid")
	.dwattr $C$DW$1031, DW_AT_TI_symbol_name("OwnSsid")
	.dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1031, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1031, DW_AT_decl_line(0x27a)
	.dwattr $C$DW$1031, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$38, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x275)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$38

$C$DW$T$331	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$331, DW_AT_name("SlWlanEventP2PClientAdded_t")
	.dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$331, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$331, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$331, DW_AT_decl_line(0x27b)
	.dwattr $C$DW$T$331, DW_AT_decl_column(0x02)

$C$DW$T$332	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$332, DW_AT_name("SlWlanEventP2PClientRemoved_t")
	.dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$332, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$332, DW_AT_decl_line(0x27b)
	.dwattr $C$DW$T$332, DW_AT_decl_column(0x1f)


$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_byte_size(0x28)
$C$DW$1032	.dwtag  DW_TAG_member
	.dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1032, DW_AT_name("GoDeviceNameLen")
	.dwattr $C$DW$1032, DW_AT_TI_symbol_name("GoDeviceNameLen")
	.dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1032, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1032, DW_AT_decl_line(0x27f)
	.dwattr $C$DW$1032, DW_AT_decl_column(0x0d)

$C$DW$1033	.dwtag  DW_TAG_member
	.dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1033, DW_AT_name("GoDeviceName")
	.dwattr $C$DW$1033, DW_AT_TI_symbol_name("GoDeviceName")
	.dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1033, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1033, DW_AT_decl_line(0x280)
	.dwattr $C$DW$1033, DW_AT_decl_column(0x0d)

$C$DW$1034	.dwtag  DW_TAG_member
	.dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1034, DW_AT_name("Mac")
	.dwattr $C$DW$1034, DW_AT_TI_symbol_name("Mac")
	.dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
	.dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1034, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1034, DW_AT_decl_line(0x281)
	.dwattr $C$DW$1034, DW_AT_decl_column(0x0d)

$C$DW$1035	.dwtag  DW_TAG_member
	.dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1035, DW_AT_name("WpsMethod")
	.dwattr $C$DW$1035, DW_AT_TI_symbol_name("WpsMethod")
	.dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
	.dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1035, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1035, DW_AT_decl_line(0x282)
	.dwattr $C$DW$1035, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$39, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x27e)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$39

$C$DW$T$333	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$333, DW_AT_name("SlWlanEventP2PDevFound_t")
	.dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$333, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$333, DW_AT_decl_line(0x283)
	.dwattr $C$DW$T$333, DW_AT_decl_column(0x02)

$C$DW$T$334	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$334, DW_AT_name("SlWlanEventP2PRequest_t")
	.dwattr $C$DW$T$334, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$334, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$334, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$334, DW_AT_decl_line(0x283)
	.dwattr $C$DW$T$334, DW_AT_decl_column(0x1c)


$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
$C$DW$1036	.dwtag  DW_TAG_member
	.dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1036, DW_AT_name("Status")
	.dwattr $C$DW$1036, DW_AT_TI_symbol_name("Status")
	.dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1036, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1036, DW_AT_decl_line(0x288)
	.dwattr $C$DW$1036, DW_AT_decl_column(0x0d)

$C$DW$1037	.dwtag  DW_TAG_member
	.dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1037, DW_AT_name("Padding")
	.dwattr $C$DW$1037, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1037, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1037, DW_AT_decl_line(0x289)
	.dwattr $C$DW$1037, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$40, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x287)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$40

$C$DW$T$335	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$335, DW_AT_name("SlWlanEventP2PConnectFail_t")
	.dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$335, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$335, DW_AT_decl_line(0x28a)
	.dwattr $C$DW$T$335, DW_AT_decl_column(0x02)


$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_byte_size(0x09)
$C$DW$1038	.dwtag  DW_TAG_member
	.dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1038, DW_AT_name("Type")
	.dwattr $C$DW$1038, DW_AT_TI_symbol_name("Type")
	.dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1038, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1038, DW_AT_decl_line(0x23a)
	.dwattr $C$DW$1038, DW_AT_decl_column(0x0d)

$C$DW$1039	.dwtag  DW_TAG_member
	.dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$1039, DW_AT_name("UserActionIdBitmap")
	.dwattr $C$DW$1039, DW_AT_TI_symbol_name("UserActionIdBitmap")
	.dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1039, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1039, DW_AT_decl_line(0x23b)
	.dwattr $C$DW$1039, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$42, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x239)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$42

$C$DW$T$336	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$336, DW_AT_name("SlWlanEventRxFilterInfo_t")
	.dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$336, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$336, DW_AT_decl_line(0x23c)
	.dwattr $C$DW$T$336, DW_AT_decl_column(0x02)


$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_byte_size(0x4c)
$C$DW$1040	.dwtag  DW_TAG_member
	.dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1040, DW_AT_name("Status")
	.dwattr $C$DW$1040, DW_AT_TI_symbol_name("Status")
	.dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1040, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1040, DW_AT_decl_line(0x298)
	.dwattr $C$DW$1040, DW_AT_decl_column(0x0d)

$C$DW$1041	.dwtag  DW_TAG_member
	.dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1041, DW_AT_name("SsidLen")
	.dwattr $C$DW$1041, DW_AT_TI_symbol_name("SsidLen")
	.dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1041, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1041, DW_AT_decl_line(0x299)
	.dwattr $C$DW$1041, DW_AT_decl_column(0x0d)

$C$DW$1042	.dwtag  DW_TAG_member
	.dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1042, DW_AT_name("Ssid")
	.dwattr $C$DW$1042, DW_AT_TI_symbol_name("Ssid")
	.dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1042, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1042, DW_AT_decl_line(0x29a)
	.dwattr $C$DW$1042, DW_AT_decl_column(0x0d)

$C$DW$1043	.dwtag  DW_TAG_member
	.dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1043, DW_AT_name("ReservedLen")
	.dwattr $C$DW$1043, DW_AT_TI_symbol_name("ReservedLen")
	.dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1043, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1043, DW_AT_decl_line(0x29b)
	.dwattr $C$DW$1043, DW_AT_decl_column(0x0d)

$C$DW$1044	.dwtag  DW_TAG_member
	.dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$1044, DW_AT_name("Reserved")
	.dwattr $C$DW$1044, DW_AT_TI_symbol_name("Reserved")
	.dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1044, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1044, DW_AT_decl_line(0x29c)
	.dwattr $C$DW$1044, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$43, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x297)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$43

$C$DW$T$338	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$338, DW_AT_name("SlWlanEventProvisioningProfileAdded_t")
	.dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$338, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$338, DW_AT_decl_line(0x29d)
	.dwattr $C$DW$T$338, DW_AT_decl_column(0x03)


$C$DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
$C$DW$1045	.dwtag  DW_TAG_member
	.dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1045, DW_AT_name("Data")
	.dwattr $C$DW$1045, DW_AT_TI_symbol_name("Data")
	.dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1045, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1045, DW_AT_decl_line(0x2a1)
	.dwattr $C$DW$1045, DW_AT_decl_column(0x0a)

$C$DW$1046	.dwtag  DW_TAG_member
	.dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$1046, DW_AT_name("TriggerId")
	.dwattr $C$DW$1046, DW_AT_TI_symbol_name("TriggerId")
	.dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1046, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1046, DW_AT_decl_line(0x2a2)
	.dwattr $C$DW$1046, DW_AT_decl_column(0x0a)

$C$DW$1047	.dwtag  DW_TAG_member
	.dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$1047, DW_AT_name("Padding")
	.dwattr $C$DW$1047, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1047, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1047, DW_AT_decl_line(0x2a3)
	.dwattr $C$DW$1047, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$44, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x2a0)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$44

$C$DW$T$339	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$339, DW_AT_name("SlWlanLinkQualityAsyncEvent_t")
	.dwattr $C$DW$T$339, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$339, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$339, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$339, DW_AT_decl_line(0x2a4)
	.dwattr $C$DW$T$339, DW_AT_decl_column(0x02)


$C$DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$46, DW_AT_byte_size(0x50)
$C$DW$1048	.dwtag  DW_TAG_member
	.dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1048, DW_AT_name("Id")
	.dwattr $C$DW$1048, DW_AT_TI_symbol_name("Id")
	.dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1048, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1048, DW_AT_decl_line(0x2bb)
	.dwattr $C$DW$1048, DW_AT_decl_column(0x19)

$C$DW$1049	.dwtag  DW_TAG_member
	.dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$1049, DW_AT_name("Data")
	.dwattr $C$DW$1049, DW_AT_TI_symbol_name("Data")
	.dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1049, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$1049, DW_AT_decl_line(0x2bc)
	.dwattr $C$DW$1049, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$46, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x2ba)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$46

$C$DW$T$589	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$589, DW_AT_name("SlWlanEvent_t")
	.dwattr $C$DW$T$589, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$589, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$589, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wlan.h")
	.dwattr $C$DW$T$589, DW_AT_decl_line(0x2bd)
	.dwattr $C$DW$T$589, DW_AT_decl_column(0x03)

$C$DW$T$590	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$590, DW_AT_type(*$C$DW$T$589)
	.dwattr $C$DW$T$590, DW_AT_address_class(0x20)


$C$DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$47, DW_AT_byte_size(0x0c)
$C$DW$1050	.dwtag  DW_TAG_member
	.dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1050, DW_AT_name("Ip")
	.dwattr $C$DW$1050, DW_AT_TI_symbol_name("Ip")
	.dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1050, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1050, DW_AT_decl_line(0xd7)
	.dwattr $C$DW$1050, DW_AT_decl_column(0x0a)

$C$DW$1051	.dwtag  DW_TAG_member
	.dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1051, DW_AT_name("Gateway")
	.dwattr $C$DW$1051, DW_AT_TI_symbol_name("Gateway")
	.dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1051, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1051, DW_AT_decl_line(0xd8)
	.dwattr $C$DW$1051, DW_AT_decl_column(0x0a)

$C$DW$1052	.dwtag  DW_TAG_member
	.dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1052, DW_AT_name("Dns")
	.dwattr $C$DW$1052, DW_AT_TI_symbol_name("Dns")
	.dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1052, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1052, DW_AT_decl_line(0xd9)
	.dwattr $C$DW$1052, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$47, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0xd6)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$47

$C$DW$T$96	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$96, DW_AT_name("SlIpV4AcquiredAsync_t")
	.dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$96, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$96, DW_AT_decl_line(0xda)
	.dwattr $C$DW$T$96, DW_AT_decl_column(0x02)


$C$DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$49, DW_AT_byte_size(0x20)
$C$DW$1053	.dwtag  DW_TAG_member
	.dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$1053, DW_AT_name("Ip")
	.dwattr $C$DW$1053, DW_AT_TI_symbol_name("Ip")
	.dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1053, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1053, DW_AT_decl_line(0xe4)
	.dwattr $C$DW$1053, DW_AT_decl_column(0x0a)

$C$DW$1054	.dwtag  DW_TAG_member
	.dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$1054, DW_AT_name("Dns")
	.dwattr $C$DW$1054, DW_AT_TI_symbol_name("Dns")
	.dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1054, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1054, DW_AT_decl_line(0xe5)
	.dwattr $C$DW$1054, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$49, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0xe3)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$49

$C$DW$T$97	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$97, DW_AT_name("SlIpV6AcquiredAsync_t")
	.dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$97, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$97, DW_AT_decl_line(0xe6)
	.dwattr $C$DW$T$97, DW_AT_decl_column(0x02)


$C$DW$T$50	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$50, DW_AT_byte_size(0x10)
$C$DW$1055	.dwtag  DW_TAG_member
	.dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1055, DW_AT_name("IpAddress")
	.dwattr $C$DW$1055, DW_AT_TI_symbol_name("IpAddress")
	.dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1055, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1055, DW_AT_decl_line(0xea)
	.dwattr $C$DW$1055, DW_AT_decl_column(0x0d)

$C$DW$1056	.dwtag  DW_TAG_member
	.dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1056, DW_AT_name("LeaseTime")
	.dwattr $C$DW$1056, DW_AT_TI_symbol_name("LeaseTime")
	.dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1056, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1056, DW_AT_decl_line(0xeb)
	.dwattr $C$DW$1056, DW_AT_decl_column(0x0d)

$C$DW$1057	.dwtag  DW_TAG_member
	.dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1057, DW_AT_name("Mac")
	.dwattr $C$DW$1057, DW_AT_TI_symbol_name("Mac")
	.dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1057, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1057, DW_AT_decl_line(0xec)
	.dwattr $C$DW$1057, DW_AT_decl_column(0x0d)

$C$DW$1058	.dwtag  DW_TAG_member
	.dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1058, DW_AT_name("Padding")
	.dwattr $C$DW$1058, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
	.dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1058, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1058, DW_AT_decl_line(0xed)
	.dwattr $C$DW$1058, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$50, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$50, DW_AT_decl_line(0xe9)
	.dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$50

$C$DW$T$341	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$341, DW_AT_name("SlIpLeasedAsync_t")
	.dwattr $C$DW$T$341, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$T$341, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$341, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$341, DW_AT_decl_line(0xee)
	.dwattr $C$DW$T$341, DW_AT_decl_column(0x02)


$C$DW$T$51	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$51, DW_AT_byte_size(0x0c)
$C$DW$1059	.dwtag  DW_TAG_member
	.dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1059, DW_AT_name("IpAddress")
	.dwattr $C$DW$1059, DW_AT_TI_symbol_name("IpAddress")
	.dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1059, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1059, DW_AT_decl_line(0xf2)
	.dwattr $C$DW$1059, DW_AT_decl_column(0x0d)

$C$DW$1060	.dwtag  DW_TAG_member
	.dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1060, DW_AT_name("Mac")
	.dwattr $C$DW$1060, DW_AT_TI_symbol_name("Mac")
	.dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1060, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1060, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1060, DW_AT_decl_line(0xf3)
	.dwattr $C$DW$1060, DW_AT_decl_column(0x0d)

$C$DW$1061	.dwtag  DW_TAG_member
	.dwattr $C$DW$1061, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1061, DW_AT_name("Reason")
	.dwattr $C$DW$1061, DW_AT_TI_symbol_name("Reason")
	.dwattr $C$DW$1061, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1061, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1061, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1061, DW_AT_decl_line(0xf4)
	.dwattr $C$DW$1061, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$51, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0xf1)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$51

$C$DW$T$342	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$342, DW_AT_name("SlIpReleasedAsync_t")
	.dwattr $C$DW$T$342, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$342, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$342, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$342, DW_AT_decl_line(0xf5)
	.dwattr $C$DW$T$342, DW_AT_decl_column(0x02)


$C$DW$T$52	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
$C$DW$1062	.dwtag  DW_TAG_member
	.dwattr $C$DW$1062, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1062, DW_AT_name("Status")
	.dwattr $C$DW$1062, DW_AT_TI_symbol_name("Status")
	.dwattr $C$DW$1062, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1062, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1062, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1062, DW_AT_decl_line(0x110)
	.dwattr $C$DW$1062, DW_AT_decl_column(0x0b)

$C$DW$1063	.dwtag  DW_TAG_member
	.dwattr $C$DW$1063, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1063, DW_AT_name("Padding")
	.dwattr $C$DW$1063, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$1063, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1063, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1063, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1063, DW_AT_decl_line(0x111)
	.dwattr $C$DW$1063, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$52, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$52, DW_AT_decl_line(0x10f)
	.dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$52

$C$DW$T$343	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$343, DW_AT_name("SlIpV4Lost_t")
	.dwattr $C$DW$T$343, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$T$343, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$343, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$343, DW_AT_decl_line(0x112)
	.dwattr $C$DW$T$343, DW_AT_decl_column(0x02)


$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x04)
$C$DW$1064	.dwtag  DW_TAG_member
	.dwattr $C$DW$1064, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1064, DW_AT_name("Status")
	.dwattr $C$DW$1064, DW_AT_TI_symbol_name("Status")
	.dwattr $C$DW$1064, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1064, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1064, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1064, DW_AT_decl_line(0x11b)
	.dwattr $C$DW$1064, DW_AT_decl_column(0x0b)

$C$DW$1065	.dwtag  DW_TAG_member
	.dwattr $C$DW$1065, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1065, DW_AT_name("Padding")
	.dwattr $C$DW$1065, DW_AT_TI_symbol_name("Padding")
	.dwattr $C$DW$1065, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1065, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1065, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1065, DW_AT_decl_line(0x11c)
	.dwattr $C$DW$1065, DW_AT_decl_column(0x0b)

	.dwattr $C$DW$T$53, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x11a)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$53

$C$DW$T$344	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$344, DW_AT_name("SlDhcpIpAcquireTimeout_t")
	.dwattr $C$DW$T$344, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$344, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$344, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$344, DW_AT_decl_line(0x11d)
	.dwattr $C$DW$T$344, DW_AT_decl_column(0x02)


$C$DW$T$54	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$54, DW_AT_byte_size(0x10)
$C$DW$1066	.dwtag  DW_TAG_member
	.dwattr $C$DW$1066, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1066, DW_AT_name("IpAddress")
	.dwattr $C$DW$1066, DW_AT_TI_symbol_name("IpAddress")
	.dwattr $C$DW$1066, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1066, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1066, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1066, DW_AT_decl_line(0xf9)
	.dwattr $C$DW$1066, DW_AT_decl_column(0x0d)

$C$DW$1067	.dwtag  DW_TAG_member
	.dwattr $C$DW$1067, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1067, DW_AT_name("DhcpMac")
	.dwattr $C$DW$1067, DW_AT_TI_symbol_name("DhcpMac")
	.dwattr $C$DW$1067, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1067, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1067, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1067, DW_AT_decl_line(0xfa)
	.dwattr $C$DW$1067, DW_AT_decl_column(0x0d)

$C$DW$1068	.dwtag  DW_TAG_member
	.dwattr $C$DW$1068, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1068, DW_AT_name("ConflictMac")
	.dwattr $C$DW$1068, DW_AT_TI_symbol_name("ConflictMac")
	.dwattr $C$DW$1068, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1068, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1068, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1068, DW_AT_decl_line(0xfb)
	.dwattr $C$DW$1068, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$54, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$54, DW_AT_decl_line(0xf8)
	.dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$54

$C$DW$T$345	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$345, DW_AT_name("SlIpCollisionAsync_t")
	.dwattr $C$DW$T$345, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$T$345, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$345, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$345, DW_AT_decl_line(0xfc)
	.dwattr $C$DW$T$345, DW_AT_decl_column(0x02)


$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
$C$DW$1069	.dwtag  DW_TAG_member
	.dwattr $C$DW$1069, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$1069, DW_AT_name("IpLost")
	.dwattr $C$DW$1069, DW_AT_TI_symbol_name("IpLost")
	.dwattr $C$DW$1069, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1069, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1069, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1069, DW_AT_decl_line(0x116)
	.dwattr $C$DW$1069, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$55, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x115)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$55

$C$DW$T$346	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$346, DW_AT_name("SlIpV6Lost_t")
	.dwattr $C$DW$T$346, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$346, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$346, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$346, DW_AT_decl_line(0x117)
	.dwattr $C$DW$T$346, DW_AT_decl_column(0x02)


$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x0c)
$C$DW$1070	.dwtag  DW_TAG_member
	.dwattr $C$DW$1070, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1070, DW_AT_name("Ip")
	.dwattr $C$DW$1070, DW_AT_TI_symbol_name("Ip")
	.dwattr $C$DW$1070, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1070, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1070, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1070, DW_AT_decl_line(0x100)
	.dwattr $C$DW$1070, DW_AT_decl_column(0x0a)

$C$DW$1071	.dwtag  DW_TAG_member
	.dwattr $C$DW$1071, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1071, DW_AT_name("Mac")
	.dwattr $C$DW$1071, DW_AT_TI_symbol_name("Mac")
	.dwattr $C$DW$1071, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1071, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1071, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1071, DW_AT_decl_line(0x101)
	.dwattr $C$DW$1071, DW_AT_decl_column(0x0a)

$C$DW$1072	.dwtag  DW_TAG_member
	.dwattr $C$DW$1072, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1072, DW_AT_name("AddMode")
	.dwattr $C$DW$1072, DW_AT_TI_symbol_name("AddMode")
	.dwattr $C$DW$1072, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1072, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1072, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1072, DW_AT_decl_line(0x102)
	.dwattr $C$DW$1072, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$56, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0xff)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$56

$C$DW$T$347	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$347, DW_AT_name("SlNoIpV4CollisionDetectedAsync_t")
	.dwattr $C$DW$T$347, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$347, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$347, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$347, DW_AT_decl_line(0x103)
	.dwattr $C$DW$T$347, DW_AT_decl_column(0x02)


$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x18)
$C$DW$1073	.dwtag  DW_TAG_member
	.dwattr $C$DW$1073, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$1073, DW_AT_name("Ip")
	.dwattr $C$DW$1073, DW_AT_TI_symbol_name("Ip")
	.dwattr $C$DW$1073, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1073, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1073, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1073, DW_AT_decl_line(0x107)
	.dwattr $C$DW$1073, DW_AT_decl_column(0x0a)

$C$DW$1074	.dwtag  DW_TAG_member
	.dwattr $C$DW$1074, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$1074, DW_AT_name("Mac")
	.dwattr $C$DW$1074, DW_AT_TI_symbol_name("Mac")
	.dwattr $C$DW$1074, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1074, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1074, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1074, DW_AT_decl_line(0x108)
	.dwattr $C$DW$1074, DW_AT_decl_column(0x0a)

$C$DW$1075	.dwtag  DW_TAG_member
	.dwattr $C$DW$1075, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1075, DW_AT_name("AddMode")
	.dwattr $C$DW$1075, DW_AT_TI_symbol_name("AddMode")
	.dwattr $C$DW$1075, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1075, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1075, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1075, DW_AT_decl_line(0x109)
	.dwattr $C$DW$1075, DW_AT_decl_column(0x0a)

	.dwattr $C$DW$T$57, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x106)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$57

$C$DW$T$348	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$348, DW_AT_name("SlNoIpV6CollisionDetectedAsync_t")
	.dwattr $C$DW$T$348, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$348, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$348, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$348, DW_AT_decl_line(0x10a)
	.dwattr $C$DW$T$348, DW_AT_decl_column(0x02)


$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x24)
$C$DW$1076	.dwtag  DW_TAG_member
	.dwattr $C$DW$1076, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1076, DW_AT_name("Id")
	.dwattr $C$DW$1076, DW_AT_TI_symbol_name("Id")
	.dwattr $C$DW$1076, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1076, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1076, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1076, DW_AT_decl_line(0x130)
	.dwattr $C$DW$1076, DW_AT_decl_column(0x1e)

$C$DW$1077	.dwtag  DW_TAG_member
	.dwattr $C$DW$1077, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$1077, DW_AT_name("Data")
	.dwattr $C$DW$1077, DW_AT_TI_symbol_name("Data")
	.dwattr $C$DW$1077, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1077, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1077, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$1077, DW_AT_decl_line(0x131)
	.dwattr $C$DW$1077, DW_AT_decl_column(0x1e)

	.dwattr $C$DW$T$59, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x12f)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$59

$C$DW$T$593	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$593, DW_AT_name("SlNetAppEvent_t")
	.dwattr $C$DW$T$593, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$593, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$593, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/netapp.h")
	.dwattr $C$DW$T$593, DW_AT_decl_line(0x132)
	.dwattr $C$DW$T$593, DW_AT_decl_column(0x02)

$C$DW$T$594	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$594, DW_AT_type(*$C$DW$T$593)
	.dwattr $C$DW$T$594, DW_AT_address_class(0x20)


$C$DW$T$60	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x04)
$C$DW$1078	.dwtag  DW_TAG_member
	.dwattr $C$DW$1078, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1078, DW_AT_name("Status")
	.dwattr $C$DW$1078, DW_AT_TI_symbol_name("Status")
	.dwattr $C$DW$1078, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1078, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1078, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$1078, DW_AT_decl_line(0x59)
	.dwattr $C$DW$1078, DW_AT_decl_column(0x0d)

$C$DW$1079	.dwtag  DW_TAG_member
	.dwattr $C$DW$1079, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$1079, DW_AT_name("Caller")
	.dwattr $C$DW$1079, DW_AT_TI_symbol_name("Caller")
	.dwattr $C$DW$1079, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1079, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1079, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$1079, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$1079, DW_AT_decl_column(0x0d)

	.dwattr $C$DW$T$60, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$T$60, DW_AT_decl_line(0x58)
	.dwattr $C$DW$T$60, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$60

$C$DW$T$350	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$350, DW_AT_name("SlDeviceEventResetRequest_t")
	.dwattr $C$DW$T$350, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$350, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$350, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$T$350, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$350, DW_AT_decl_column(0x02)


$C$DW$T$63	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$63, DW_AT_byte_size(0x04)
$C$DW$1080	.dwtag  DW_TAG_member
	.dwattr $C$DW$1080, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$1080, DW_AT_name("Source")
	.dwattr $C$DW$1080, DW_AT_TI_symbol_name("Source")
	.dwattr $C$DW$1080, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1080, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1080, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$1080, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$1080, DW_AT_decl_column(0x19)

$C$DW$1081	.dwtag  DW_TAG_member
	.dwattr $C$DW$1081, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$1081, DW_AT_name("Code")
	.dwattr $C$DW$1081, DW_AT_TI_symbol_name("Code")
	.dwattr $C$DW$1081, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1081, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1081, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$1081, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$1081, DW_AT_decl_column(0x19)

	.dwattr $C$DW$T$63, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$T$63, DW_AT_decl_line(0x69)
	.dwattr $C$DW$T$63, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$63

$C$DW$T$351	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$351, DW_AT_name("SlDeviceEventError_t")
	.dwattr $C$DW$T$351, DW_AT_type(*$C$DW$T$63)
	.dwattr $C$DW$T$351, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$351, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$T$351, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$T$351, DW_AT_decl_column(0x02)


$C$DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$65, DW_AT_byte_size(0x08)
$C$DW$1082	.dwtag  DW_TAG_member
	.dwattr $C$DW$1082, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$1082, DW_AT_name("Id")
	.dwattr $C$DW$1082, DW_AT_TI_symbol_name("Id")
	.dwattr $C$DW$1082, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1082, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1082, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$1082, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$1082, DW_AT_decl_column(0x19)

$C$DW$1083	.dwtag  DW_TAG_member
	.dwattr $C$DW$1083, DW_AT_type(*$C$DW$T$64)
	.dwattr $C$DW$1083, DW_AT_name("Data")
	.dwattr $C$DW$1083, DW_AT_TI_symbol_name("Data")
	.dwattr $C$DW$1083, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1083, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1083, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$1083, DW_AT_decl_line(0x80)
	.dwattr $C$DW$1083, DW_AT_decl_column(0x1c)

	.dwattr $C$DW$T$65, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$T$65, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$T$65, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$65

$C$DW$T$597	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$597, DW_AT_name("SlDeviceEvent_t")
	.dwattr $C$DW$T$597, DW_AT_type(*$C$DW$T$65)
	.dwattr $C$DW$T$597, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$597, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/device.h")
	.dwattr $C$DW$T$597, DW_AT_decl_line(0x81)
	.dwattr $C$DW$T$597, DW_AT_decl_column(0x02)

$C$DW$T$598	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$598, DW_AT_type(*$C$DW$T$597)
	.dwattr $C$DW$T$598, DW_AT_address_class(0x20)


$C$DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$72, DW_AT_byte_size(0x1c)
$C$DW$1084	.dwtag  DW_TAG_member
	.dwattr $C$DW$1084, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$1084, DW_AT_name("connectTimeout")
	.dwattr $C$DW$1084, DW_AT_TI_symbol_name("connectTimeout")
	.dwattr $C$DW$1084, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1084, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1084, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$1084, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$1084, DW_AT_decl_column(0x19)

$C$DW$1085	.dwtag  DW_TAG_member
	.dwattr $C$DW$1085, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$1085, DW_AT_name("ipTimeout")
	.dwattr $C$DW$1085, DW_AT_TI_symbol_name("ipTimeout")
	.dwattr $C$DW$1085, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1085, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1085, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$1085, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1085, DW_AT_decl_column(0x19)

$C$DW$1086	.dwtag  DW_TAG_member
	.dwattr $C$DW$1086, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$1086, DW_AT_name("reconnectTimeout")
	.dwattr $C$DW$1086, DW_AT_TI_symbol_name("reconnectTimeout")
	.dwattr $C$DW$1086, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1086, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1086, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$1086, DW_AT_decl_line(0xa6)
	.dwattr $C$DW$1086, DW_AT_decl_column(0x19)

$C$DW$1087	.dwtag  DW_TAG_member
	.dwattr $C$DW$1087, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$1087, DW_AT_name("provisioningTimeout")
	.dwattr $C$DW$1087, DW_AT_TI_symbol_name("provisioningTimeout")
	.dwattr $C$DW$1087, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
	.dwattr $C$DW$1087, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1087, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$1087, DW_AT_decl_line(0xac)
	.dwattr $C$DW$1087, DW_AT_decl_column(0x19)

$C$DW$1088	.dwtag  DW_TAG_member
	.dwattr $C$DW$1088, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$1088, DW_AT_name("idleMinInterval")
	.dwattr $C$DW$1088, DW_AT_TI_symbol_name("idleMinInterval")
	.dwattr $C$DW$1088, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1088, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1088, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$1088, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1088, DW_AT_decl_column(0x19)

$C$DW$1089	.dwtag  DW_TAG_member
	.dwattr $C$DW$1089, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$1089, DW_AT_name("idleMaxInterval")
	.dwattr $C$DW$1089, DW_AT_TI_symbol_name("idleMaxInterval")
	.dwattr $C$DW$1089, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr $C$DW$1089, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1089, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$1089, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1089, DW_AT_decl_column(0x19)

$C$DW$1090	.dwtag  DW_TAG_member
	.dwattr $C$DW$1090, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$1090, DW_AT_name("provisioningAP_ssid")
	.dwattr $C$DW$1090, DW_AT_TI_symbol_name("provisioningAP_ssid")
	.dwattr $C$DW$1090, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1090, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1090, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$1090, DW_AT_decl_line(0xc9)
	.dwattr $C$DW$1090, DW_AT_decl_column(0x1a)

$C$DW$1091	.dwtag  DW_TAG_member
	.dwattr $C$DW$1091, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1091, DW_AT_name("provisioningAP_secType")
	.dwattr $C$DW$1091, DW_AT_TI_symbol_name("provisioningAP_secType")
	.dwattr $C$DW$1091, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1091, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1091, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$1091, DW_AT_decl_line(0xca)
	.dwattr $C$DW$1091, DW_AT_decl_column(0x1a)

$C$DW$1092	.dwtag  DW_TAG_member
	.dwattr $C$DW$1092, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$1092, DW_AT_name("provisioningAP_password")
	.dwattr $C$DW$1092, DW_AT_TI_symbol_name("provisioningAP_password")
	.dwattr $C$DW$1092, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1092, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1092, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$1092, DW_AT_decl_line(0xcb)
	.dwattr $C$DW$1092, DW_AT_decl_column(0x1a)

$C$DW$1093	.dwtag  DW_TAG_member
	.dwattr $C$DW$1093, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$1093, DW_AT_name("provisioningSC_key")
	.dwattr $C$DW$1093, DW_AT_TI_symbol_name("provisioningSC_key")
	.dwattr $C$DW$1093, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1093, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1093, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$1093, DW_AT_decl_line(0xd1)
	.dwattr $C$DW$1093, DW_AT_decl_column(0x1a)

	.dwattr $C$DW$T$72, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$T$72, DW_AT_decl_line(0x95)
	.dwattr $C$DW$T$72, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$72

$C$DW$T$678	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$678, DW_AT_name("WifiConnSettings_t")
	.dwattr $C$DW$T$678, DW_AT_type(*$C$DW$T$72)
	.dwattr $C$DW$T$678, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$678, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slwificonn.h")
	.dwattr $C$DW$T$678, DW_AT_decl_line(0xd3)
	.dwattr $C$DW$T$678, DW_AT_decl_column(0x03)

$C$DW$T$679	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$679, DW_AT_type(*$C$DW$T$678)
	.dwattr $C$DW$T$679, DW_AT_address_class(0x20)


$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x2c)
$C$DW$1094	.dwtag  DW_TAG_member
	.dwattr $C$DW$1094, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1094, DW_AT_name("ssidLen")
	.dwattr $C$DW$1094, DW_AT_TI_symbol_name("ssidLen")
	.dwattr $C$DW$1094, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1094, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1094, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1094, DW_AT_decl_line(0x9c)
	.dwattr $C$DW$1094, DW_AT_decl_column(0x1d)

$C$DW$1095	.dwtag  DW_TAG_member
	.dwattr $C$DW$1095, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1095, DW_AT_name("bSetBssid")
	.dwattr $C$DW$1095, DW_AT_TI_symbol_name("bSetBssid")
	.dwattr $C$DW$1095, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
	.dwattr $C$DW$1095, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1095, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1095, DW_AT_decl_line(0x9d)
	.dwattr $C$DW$1095, DW_AT_decl_column(0x1d)

$C$DW$1096	.dwtag  DW_TAG_member
	.dwattr $C$DW$1096, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1096, DW_AT_name("bssid")
	.dwattr $C$DW$1096, DW_AT_TI_symbol_name("bssid")
	.dwattr $C$DW$1096, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
	.dwattr $C$DW$1096, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1096, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1096, DW_AT_decl_line(0x9e)
	.dwattr $C$DW$1096, DW_AT_decl_column(0x1d)

$C$DW$1097	.dwtag  DW_TAG_member
	.dwattr $C$DW$1097, DW_AT_type(*$C$DW$T$74)
	.dwattr $C$DW$1097, DW_AT_name("secParams")
	.dwattr $C$DW$1097, DW_AT_TI_symbol_name("secParams")
	.dwattr $C$DW$1097, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1097, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1097, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1097, DW_AT_decl_line(0x9f)
	.dwattr $C$DW$1097, DW_AT_decl_column(0x1d)

$C$DW$1098	.dwtag  DW_TAG_member
	.dwattr $C$DW$1098, DW_AT_type(*$C$DW$T$75)
	.dwattr $C$DW$1098, DW_AT_name("extSecParams")
	.dwattr $C$DW$1098, DW_AT_TI_symbol_name("extSecParams")
	.dwattr $C$DW$1098, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1098, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1098, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1098, DW_AT_decl_line(0xa0)
	.dwattr $C$DW$1098, DW_AT_decl_column(0x1d)

$C$DW$1099	.dwtag  DW_TAG_member
	.dwattr $C$DW$1099, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1099, DW_AT_name("priority")
	.dwattr $C$DW$1099, DW_AT_TI_symbol_name("priority")
	.dwattr $C$DW$1099, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$1099, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1099, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1099, DW_AT_decl_line(0xa1)
	.dwattr $C$DW$1099, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$76, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0x9b)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x0f)
	.dwendtag $C$DW$T$76

$C$DW$T$98	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$98, DW_AT_name("profile_t")
	.dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$76)
	.dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$98, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$T$98, DW_AT_decl_line(0xa2)
	.dwattr $C$DW$T$98, DW_AT_decl_column(0x03)

$C$DW$T$99	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
	.dwattr $C$DW$T$99, DW_AT_address_class(0x20)


$C$DW$T$100	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$100, DW_AT_byte_size(0x78)
$C$DW$1100	.dwtag  DW_TAG_member
	.dwattr $C$DW$1100, DW_AT_type(*$C$DW$T$78)
	.dwattr $C$DW$1100, DW_AT_name("state")
	.dwattr $C$DW$1100, DW_AT_TI_symbol_name("state")
	.dwattr $C$DW$1100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$1100, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1100, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1100, DW_AT_decl_line(0xb2)
	.dwattr $C$DW$1100, DW_AT_decl_column(0x1d)

$C$DW$1101	.dwtag  DW_TAG_member
	.dwattr $C$DW$1101, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$1101, DW_AT_name("eventQ")
	.dwattr $C$DW$1101, DW_AT_TI_symbol_name("eventQ")
	.dwattr $C$DW$1101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$1101, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1101, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1101, DW_AT_decl_line(0xb3)
	.dwattr $C$DW$1101, DW_AT_decl_column(0x1d)

$C$DW$1102	.dwtag  DW_TAG_member
	.dwattr $C$DW$1102, DW_AT_type(*$C$DW$T$81)
	.dwattr $C$DW$1102, DW_AT_name("DeferredEventQ")
	.dwattr $C$DW$1102, DW_AT_TI_symbol_name("DeferredEventQ")
	.dwattr $C$DW$1102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$1102, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1102, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1102, DW_AT_decl_line(0xb4)
	.dwattr $C$DW$1102, DW_AT_decl_column(0x1d)

$C$DW$1103	.dwtag  DW_TAG_member
	.dwattr $C$DW$1103, DW_AT_type(*$C$DW$T$84)
	.dwattr $C$DW$1103, DW_AT_name("timer")
	.dwattr $C$DW$1103, DW_AT_TI_symbol_name("timer")
	.dwattr $C$DW$1103, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$1103, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1103, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1103, DW_AT_decl_line(0xb5)
	.dwattr $C$DW$1103, DW_AT_decl_column(0x1d)

$C$DW$1104	.dwtag  DW_TAG_member
	.dwattr $C$DW$1104, DW_AT_type(*$C$DW$T$91)
	.dwattr $C$DW$1104, DW_AT_name("fWifiAppCB")
	.dwattr $C$DW$1104, DW_AT_TI_symbol_name("fWifiAppCB")
	.dwattr $C$DW$1104, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$1104, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1104, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1104, DW_AT_decl_line(0xb6)
	.dwattr $C$DW$1104, DW_AT_decl_column(0x1d)

$C$DW$1105	.dwtag  DW_TAG_member
	.dwattr $C$DW$1105, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1105, DW_AT_name("stopInProgress")
	.dwattr $C$DW$1105, DW_AT_TI_symbol_name("stopInProgress")
	.dwattr $C$DW$1105, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$1105, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1105, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1105, DW_AT_decl_line(0xb7)
	.dwattr $C$DW$1105, DW_AT_decl_column(0x1d)

$C$DW$1106	.dwtag  DW_TAG_member
	.dwattr $C$DW$1106, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1106, DW_AT_name("role")
	.dwattr $C$DW$1106, DW_AT_TI_symbol_name("role")
	.dwattr $C$DW$1106, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
	.dwattr $C$DW$1106, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1106, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1106, DW_AT_decl_line(0xb8)
	.dwattr $C$DW$1106, DW_AT_decl_column(0x1d)

$C$DW$1107	.dwtag  DW_TAG_member
	.dwattr $C$DW$1107, DW_AT_type(*$C$DW$T$93)
	.dwattr $C$DW$1107, DW_AT_name("provMode")
	.dwattr $C$DW$1107, DW_AT_TI_symbol_name("provMode")
	.dwattr $C$DW$1107, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
	.dwattr $C$DW$1107, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1107, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1107, DW_AT_decl_line(0xb9)
	.dwattr $C$DW$1107, DW_AT_decl_column(0x1d)

$C$DW$1108	.dwtag  DW_TAG_member
	.dwattr $C$DW$1108, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1108, DW_AT_name("provCmd")
	.dwattr $C$DW$1108, DW_AT_TI_symbol_name("provCmd")
	.dwattr $C$DW$1108, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
	.dwattr $C$DW$1108, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1108, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1108, DW_AT_decl_line(0xba)
	.dwattr $C$DW$1108, DW_AT_decl_column(0x1d)

$C$DW$1109	.dwtag  DW_TAG_member
	.dwattr $C$DW$1109, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1109, DW_AT_name("provFlags")
	.dwattr $C$DW$1109, DW_AT_TI_symbol_name("provFlags")
	.dwattr $C$DW$1109, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$1109, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1109, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1109, DW_AT_decl_line(0xbb)
	.dwattr $C$DW$1109, DW_AT_decl_column(0x1d)

$C$DW$1110	.dwtag  DW_TAG_member
	.dwattr $C$DW$1110, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$1110, DW_AT_name("bDeleteAllProfiles")
	.dwattr $C$DW$1110, DW_AT_TI_symbol_name("bDeleteAllProfiles")
	.dwattr $C$DW$1110, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
	.dwattr $C$DW$1110, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1110, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1110, DW_AT_decl_line(0xbc)
	.dwattr $C$DW$1110, DW_AT_decl_column(0x1d)

$C$DW$1111	.dwtag  DW_TAG_member
	.dwattr $C$DW$1111, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$1111, DW_AT_name("idleInterval")
	.dwattr $C$DW$1111, DW_AT_TI_symbol_name("idleInterval")
	.dwattr $C$DW$1111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
	.dwattr $C$DW$1111, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1111, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1111, DW_AT_decl_line(0xbd)
	.dwattr $C$DW$1111, DW_AT_decl_column(0x1d)

$C$DW$1112	.dwtag  DW_TAG_member
	.dwattr $C$DW$1112, DW_AT_type(*$C$DW$T$95)
	.dwattr $C$DW$1112, DW_AT_name("connectionSSID")
	.dwattr $C$DW$1112, DW_AT_TI_symbol_name("connectionSSID")
	.dwattr $C$DW$1112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$1112, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1112, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1112, DW_AT_decl_line(0xbe)
	.dwattr $C$DW$1112, DW_AT_decl_column(0x1d)

$C$DW$1113	.dwtag  DW_TAG_member
	.dwattr $C$DW$1113, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$1113, DW_AT_name("connectionBSSID")
	.dwattr $C$DW$1113, DW_AT_TI_symbol_name("connectionBSSID")
	.dwattr $C$DW$1113, DW_AT_data_member_location[DW_OP_plus_uconst 0x3d]
	.dwattr $C$DW$1113, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1113, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1113, DW_AT_decl_line(0xbf)
	.dwattr $C$DW$1113, DW_AT_decl_column(0x1d)

$C$DW$1114	.dwtag  DW_TAG_member
	.dwattr $C$DW$1114, DW_AT_type(*$C$DW$T$96)
	.dwattr $C$DW$1114, DW_AT_name("IpAcquiredV4")
	.dwattr $C$DW$1114, DW_AT_TI_symbol_name("IpAcquiredV4")
	.dwattr $C$DW$1114, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr $C$DW$1114, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1114, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1114, DW_AT_decl_line(0xc0)
	.dwattr $C$DW$1114, DW_AT_decl_column(0x1d)

$C$DW$1115	.dwtag  DW_TAG_member
	.dwattr $C$DW$1115, DW_AT_type(*$C$DW$T$97)
	.dwattr $C$DW$1115, DW_AT_name("IpAcquiredV6")
	.dwattr $C$DW$1115, DW_AT_TI_symbol_name("IpAcquiredV6")
	.dwattr $C$DW$1115, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr $C$DW$1115, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1115, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1115, DW_AT_decl_line(0xc1)
	.dwattr $C$DW$1115, DW_AT_decl_column(0x1d)

$C$DW$1116	.dwtag  DW_TAG_member
	.dwattr $C$DW$1116, DW_AT_type(*$C$DW$T$99)
	.dwattr $C$DW$1116, DW_AT_name("pNonPersistentProfile")
	.dwattr $C$DW$1116, DW_AT_TI_symbol_name("pNonPersistentProfile")
	.dwattr $C$DW$1116, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr $C$DW$1116, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1116, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1116, DW_AT_decl_line(0xc2)
	.dwattr $C$DW$1116, DW_AT_decl_column(0x1e)

$C$DW$1117	.dwtag  DW_TAG_member
	.dwattr $C$DW$1117, DW_AT_type(*$C$DW$T$94)
	.dwattr $C$DW$1117, DW_AT_name("bWlanConnectUsed")
	.dwattr $C$DW$1117, DW_AT_TI_symbol_name("bWlanConnectUsed")
	.dwattr $C$DW$1117, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr $C$DW$1117, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1117, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1117, DW_AT_decl_line(0xc3)
	.dwattr $C$DW$1117, DW_AT_decl_column(0x1d)

$C$DW$1118	.dwtag  DW_TAG_member
	.dwattr $C$DW$1118, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1118, DW_AT_name("disabledPolicy")
	.dwattr $C$DW$1118, DW_AT_TI_symbol_name("disabledPolicy")
	.dwattr $C$DW$1118, DW_AT_data_member_location[DW_OP_plus_uconst 0x75]
	.dwattr $C$DW$1118, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1118, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1118, DW_AT_decl_line(0xc4)
	.dwattr $C$DW$1118, DW_AT_decl_column(0x1d)

$C$DW$1119	.dwtag  DW_TAG_member
	.dwattr $C$DW$1119, DW_AT_type(*$C$DW$T$71)
	.dwattr $C$DW$1119, DW_AT_name("enabledPolicy")
	.dwattr $C$DW$1119, DW_AT_TI_symbol_name("enabledPolicy")
	.dwattr $C$DW$1119, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
	.dwattr $C$DW$1119, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$1119, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$1119, DW_AT_decl_line(0xc5)
	.dwattr $C$DW$1119, DW_AT_decl_column(0x1d)

	.dwattr $C$DW$T$100, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$T$100, DW_AT_decl_line(0xb1)
	.dwattr $C$DW$T$100, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$100

$C$DW$T$680	.dwtag  DW_TAG_typedef
	.dwattr $C$DW$T$680, DW_AT_name("SlWifiConn_t")
	.dwattr $C$DW$T$680, DW_AT_type(*$C$DW$T$100)
	.dwattr $C$DW$T$680, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$680, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/slwificonn.c")
	.dwattr $C$DW$T$680, DW_AT_decl_line(0xc6)
	.dwattr $C$DW$T$680, DW_AT_decl_column(0x03)

$C$DW$T$681	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$681, DW_AT_type(*$C$DW$T$680)
	.dwattr $C$DW$T$681, DW_AT_address_class(0x20)


$C$DW$T$103	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$103, DW_AT_byte_size(0x08)
$C$DW$1120	.dwtag  DW_TAG_member
