TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM G3 C/C++ Codegen                                          Unix v20.2.1.LTS *
       3                    ;* Date/Time created: Wed Sep 16 12:09:22 2020                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnetif/s
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM G3 C/C++ Codegen Unix v20.2.1.LTS Copyright (c) 19
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/slnet
      13                            .global g_fNetIfCB
      14 00000000                   .data

   15513                            .dwattr $C$DW$980, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
   15514                            .dwattr $C$DW$980, DW_AT_decl_line(0x146)
   15515                            .dwattr $C$DW$980, DW_AT_decl_column(0x05)
   15516                    
   15517                    $C$DW$981       .dwtag  DW_TAG_enumerator
   15518                            .dwattr $C$DW$981, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MED")
   15519                            .dwattr $C$DW$981, DW_AT_const_value(0x04)
   15520                            .dwattr $C$DW$981, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
   15521                            .dwattr $C$DW$981, DW_AT_decl_line(0x147)
   15522                            .dwattr $C$DW$981, DW_AT_decl_column(0x05)
   15523                    
   15524                    $C$DW$982       .dwtag  DW_TAG_enumerator
   15525                            .dwattr $C$DW$982, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_HIGH")
   15526                            .dwattr $C$DW$982, DW_AT_const_value(0x05)
   15527                            .dwattr $C$DW$982, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
   15528                            .dwattr $C$DW$982, DW_AT_decl_line(0x148)
   15529                            .dwattr $C$DW$982, DW_AT_decl_column(0x05)
   15530                    
   15531                    $C$DW$983       .dwtag  DW_TAG_enumerator
   15532                            .dwattr $C$DW$983, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MAX")
   15533                            .dwattr $C$DW$983, DW_AT_const_value(0x06)
   15534                            .dwattr $C$DW$983, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
   15535                            .dwattr $C$DW$983, DW_AT_decl_line(0x149)
   15536                            .dwattr $C$DW$983, DW_AT_decl_column(0x05)
   15537                    
   15538                            .dwattr $C$DW$T$663, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
   15539                            .dwattr $C$DW$T$663, DW_AT_decl_line(0x143)
   15540                            .dwattr $C$DW$T$663, DW_AT_decl_column(0x01)
   15541                            .dwendtag $C$DW$T$663
   15542                    
   15543                    $C$DW$T$664     .dwtag  DW_TAG_typedef
   15544                            .dwattr $C$DW$T$664, DW_AT_name("SlNetSockTxInhibitThreshold_e")
   15545                            .dwattr $C$DW$T$664, DW_AT_type(*$C$DW$T$663)
   15546                            .dwattr $C$DW$T$664, DW_AT_language(DW_LANG_C)
   15547                            .dwattr $C$DW$T$664, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetsock.h")
   15548                            .dwattr $C$DW$T$664, DW_AT_decl_line(0x14a)
   15549                            .dwattr $C$DW$T$664, DW_AT_decl_column(0x03)
   15550                    
   15551                    
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  326

   15552                    $C$DW$T$665     .dwtag  DW_TAG_enumeration_type
   15553                            .dwattr $C$DW$T$665, DW_AT_byte_size(0x01)
   15554                    $C$DW$984       .dwtag  DW_TAG_enumerator
   15555                            .dwattr $C$DW$984, DW_AT_name("SLNETIF_STATE_DISABLE")
   15556                            .dwattr $C$DW$984, DW_AT_const_value(0x00)
   15557                            .dwattr $C$DW$984, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetif.h")
   15558                            .dwattr $C$DW$984, DW_AT_decl_line(0x62)
   15559                            .dwattr $C$DW$984, DW_AT_decl_column(0x05)
   15560                    
   15561                    $C$DW$985       .dwtag  DW_TAG_enumerator
   15562                            .dwattr $C$DW$985, DW_AT_name("SLNETIF_STATE_ENABLE")
   15563                            .dwattr $C$DW$985, DW_AT_const_value(0x01)
   15564                            .dwattr $C$DW$985, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetif.h")
   15565                            .dwattr $C$DW$985, DW_AT_decl_line(0x63)
   15566                            .dwattr $C$DW$985, DW_AT_decl_column(0x05)
   15567                    
   15568                            .dwattr $C$DW$T$665, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetif.h")
   15569                            .dwattr $C$DW$T$665, DW_AT_decl_line(0x61)
   15570                            .dwattr $C$DW$T$665, DW_AT_decl_column(0x01)
   15571                            .dwendtag $C$DW$T$665
   15572                    
   15573                    $C$DW$T$666     .dwtag  DW_TAG_typedef
   15574                            .dwattr $C$DW$T$666, DW_AT_name("SlNetIfState_e")
   15575                            .dwattr $C$DW$T$666, DW_AT_type(*$C$DW$T$665)
   15576                            .dwattr $C$DW$T$666, DW_AT_language(DW_LANG_C)
   15577                            .dwattr $C$DW$T$666, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/net/slnetif.h")
   15578                            .dwattr $C$DW$T$666, DW_AT_decl_line(0x64)
   15579                            .dwattr $C$DW$T$666, DW_AT_decl_column(0x03)
   15580                    
   15581                    
   15582                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
   15583                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x0c)
   15584                    $C$DW$986       .dwtag  DW_TAG_member
   15585                            .dwattr $C$DW$986, DW_AT_type(*$C$DW$T$6)
   15586                            .dwattr $C$DW$986, DW_AT_name("Type")
   15587                            .dwattr $C$DW$986, DW_AT_TI_symbol_name("Type")
   15588                            .dwattr $C$DW$986, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15589                            .dwattr $C$DW$986, DW_AT_accessibility(DW_ACCESS_public)
   15590                            .dwattr $C$DW$986, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15591                            .dwattr $C$DW$986, DW_AT_decl_line(0x2e8)
   15592                            .dwattr $C$DW$986, DW_AT_decl_column(0x0b)
   15593                    
   15594                    $C$DW$987       .dwtag  DW_TAG_member
   15595                            .dwattr $C$DW$987, DW_AT_type(*$C$DW$T$24)
   15596                            .dwattr $C$DW$987, DW_AT_name("Key")
   15597                            .dwattr $C$DW$987, DW_AT_TI_symbol_name("Key")
   15598                            .dwattr $C$DW$987, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15599                            .dwattr $C$DW$987, DW_AT_accessibility(DW_ACCESS_public)
   15600                            .dwattr $C$DW$987, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15601                            .dwattr $C$DW$987, DW_AT_decl_line(0x2e9)
   15602                            .dwattr $C$DW$987, DW_AT_decl_column(0x0b)
   15603                    
   15604                    $C$DW$988       .dwtag  DW_TAG_member
   15605                            .dwattr $C$DW$988, DW_AT_type(*$C$DW$T$6)
   15606                            .dwattr $C$DW$988, DW_AT_name("KeyLen")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  327

   15607                            .dwattr $C$DW$988, DW_AT_TI_symbol_name("KeyLen")
   15608                            .dwattr $C$DW$988, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15609                            .dwattr $C$DW$988, DW_AT_accessibility(DW_ACCESS_public)
   15610                            .dwattr $C$DW$988, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15611                            .dwattr $C$DW$988, DW_AT_decl_line(0x2ea)
   15612                            .dwattr $C$DW$988, DW_AT_decl_column(0x0b)
   15613                    
   15614                            .dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15615                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x2e7)
   15616                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
   15617                            .dwendtag $C$DW$T$25
   15618                    
   15619                    $C$DW$T$74      .dwtag  DW_TAG_typedef
   15620                            .dwattr $C$DW$T$74, DW_AT_name("SlWlanSecParams_t")
   15621                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$25)
   15622                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
   15623                            .dwattr $C$DW$T$74, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15624                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x2eb)
   15625                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x02)
   15626                    
   15627                    $C$DW$T$667     .dwtag  DW_TAG_const_type
   15628                            .dwattr $C$DW$T$667, DW_AT_type(*$C$DW$T$74)
   15629                    
   15630                    $C$DW$T$668     .dwtag  DW_TAG_pointer_type
   15631                            .dwattr $C$DW$T$668, DW_AT_type(*$C$DW$T$667)
   15632                            .dwattr $C$DW$T$668, DW_AT_address_class(0x20)
   15633                    
   15634                    $C$DW$T$669     .dwtag  DW_TAG_pointer_type
   15635                            .dwattr $C$DW$T$669, DW_AT_type(*$C$DW$T$74)
   15636                            .dwattr $C$DW$T$669, DW_AT_address_class(0x20)
   15637                    
   15638                    
   15639                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
   15640                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x14)
   15641                    $C$DW$989       .dwtag  DW_TAG_member
   15642                            .dwattr $C$DW$989, DW_AT_type(*$C$DW$T$24)
   15643                            .dwattr $C$DW$989, DW_AT_name("User")
   15644                            .dwattr $C$DW$989, DW_AT_TI_symbol_name("User")
   15645                            .dwattr $C$DW$989, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15646                            .dwattr $C$DW$989, DW_AT_accessibility(DW_ACCESS_public)
   15647                            .dwattr $C$DW$989, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15648                            .dwattr $C$DW$989, DW_AT_decl_line(0x2ef)
   15649                            .dwattr $C$DW$989, DW_AT_decl_column(0x0b)
   15650                    
   15651                    $C$DW$990       .dwtag  DW_TAG_member
   15652                            .dwattr $C$DW$990, DW_AT_type(*$C$DW$T$6)
   15653                            .dwattr $C$DW$990, DW_AT_name("UserLen")
   15654                            .dwattr $C$DW$990, DW_AT_TI_symbol_name("UserLen")
   15655                            .dwattr $C$DW$990, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15656                            .dwattr $C$DW$990, DW_AT_accessibility(DW_ACCESS_public)
   15657                            .dwattr $C$DW$990, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15658                            .dwattr $C$DW$990, DW_AT_decl_line(0x2f0)
   15659                            .dwattr $C$DW$990, DW_AT_decl_column(0x0b)
   15660                    
   15661                    $C$DW$991       .dwtag  DW_TAG_member
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  328

   15662                            .dwattr $C$DW$991, DW_AT_type(*$C$DW$T$24)
   15663                            .dwattr $C$DW$991, DW_AT_name("AnonUser")
   15664                            .dwattr $C$DW$991, DW_AT_TI_symbol_name("AnonUser")
   15665                            .dwattr $C$DW$991, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   15666                            .dwattr $C$DW$991, DW_AT_accessibility(DW_ACCESS_public)
   15667                            .dwattr $C$DW$991, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15668                            .dwattr $C$DW$991, DW_AT_decl_line(0x2f1)
   15669                            .dwattr $C$DW$991, DW_AT_decl_column(0x0b)
   15670                    
   15671                    $C$DW$992       .dwtag  DW_TAG_member
   15672                            .dwattr $C$DW$992, DW_AT_type(*$C$DW$T$6)
   15673                            .dwattr $C$DW$992, DW_AT_name("AnonUserLen")
   15674                            .dwattr $C$DW$992, DW_AT_TI_symbol_name("AnonUserLen")
   15675                            .dwattr $C$DW$992, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
   15676                            .dwattr $C$DW$992, DW_AT_accessibility(DW_ACCESS_public)
   15677                            .dwattr $C$DW$992, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15678                            .dwattr $C$DW$992, DW_AT_decl_line(0x2f2)
   15679                            .dwattr $C$DW$992, DW_AT_decl_column(0x0b)
   15680                    
   15681                    $C$DW$993       .dwtag  DW_TAG_member
   15682                            .dwattr $C$DW$993, DW_AT_type(*$C$DW$T$6)
   15683                            .dwattr $C$DW$993, DW_AT_name("CertIndex")
   15684                            .dwattr $C$DW$993, DW_AT_TI_symbol_name("CertIndex")
   15685                            .dwattr $C$DW$993, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
   15686                            .dwattr $C$DW$993, DW_AT_accessibility(DW_ACCESS_public)
   15687                            .dwattr $C$DW$993, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15688                            .dwattr $C$DW$993, DW_AT_decl_line(0x2f3)
   15689                            .dwattr $C$DW$993, DW_AT_decl_column(0x0b)
   15690                    
   15691                    $C$DW$994       .dwtag  DW_TAG_member
   15692                            .dwattr $C$DW$994, DW_AT_type(*$C$DW$T$13)
   15693                            .dwattr $C$DW$994, DW_AT_name("EapMethod")
   15694                            .dwattr $C$DW$994, DW_AT_TI_symbol_name("EapMethod")
   15695                            .dwattr $C$DW$994, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   15696                            .dwattr $C$DW$994, DW_AT_accessibility(DW_ACCESS_public)
   15697                            .dwattr $C$DW$994, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15698                            .dwattr $C$DW$994, DW_AT_decl_line(0x2f4)
   15699                            .dwattr $C$DW$994, DW_AT_decl_column(0x0b)
   15700                    
   15701                            .dwattr $C$DW$T$26, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15702                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x2ee)
   15703                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x01)
   15704                            .dwendtag $C$DW$T$26
   15705                    
   15706                    $C$DW$T$75      .dwtag  DW_TAG_typedef
   15707                            .dwattr $C$DW$T$75, DW_AT_name("SlWlanSecParamsExt_t")
   15708                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$26)
   15709                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
   15710                            .dwattr $C$DW$T$75, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15711                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x2f5)
   15712                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x02)
   15713                    
   15714                    $C$DW$T$670     .dwtag  DW_TAG_const_type
   15715                            .dwattr $C$DW$T$670, DW_AT_type(*$C$DW$T$75)
   15716                    
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  329

   15717                    $C$DW$T$671     .dwtag  DW_TAG_pointer_type
   15718                            .dwattr $C$DW$T$671, DW_AT_type(*$C$DW$T$670)
   15719                            .dwattr $C$DW$T$671, DW_AT_address_class(0x20)
   15720                    
   15721                    $C$DW$T$672     .dwtag  DW_TAG_pointer_type
   15722                            .dwattr $C$DW$T$672, DW_AT_type(*$C$DW$T$75)
   15723                            .dwattr $C$DW$T$672, DW_AT_address_class(0x20)
   15724                    
   15725                    
   15726                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
   15727                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x08)
   15728                    $C$DW$995       .dwtag  DW_TAG_member
   15729                            .dwattr $C$DW$995, DW_AT_type(*$C$DW$T$13)
   15730                            .dwattr $C$DW$995, DW_AT_name("ChipId")
   15731                            .dwattr $C$DW$995, DW_AT_TI_symbol_name("ChipId")
   15732                            .dwattr $C$DW$995, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15733                            .dwattr $C$DW$995, DW_AT_accessibility(DW_ACCESS_public)
   15734                            .dwattr $C$DW$995, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/dev
   15735                            .dwattr $C$DW$995, DW_AT_decl_line(0x127)
   15736                            .dwattr $C$DW$995, DW_AT_decl_column(0x0d)
   15737                    
   15738                    $C$DW$996       .dwtag  DW_TAG_member
   15739                            .dwattr $C$DW$996, DW_AT_type(*$C$DW$T$13)
   15740                            .dwattr $C$DW$996, DW_AT_name("MoreData")
   15741                            .dwattr $C$DW$996, DW_AT_TI_symbol_name("MoreData")
   15742                            .dwattr $C$DW$996, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15743                            .dwattr $C$DW$996, DW_AT_accessibility(DW_ACCESS_public)
   15744                            .dwattr $C$DW$996, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/dev
   15745                            .dwattr $C$DW$996, DW_AT_decl_line(0x128)
   15746                            .dwattr $C$DW$996, DW_AT_decl_column(0x0d)
   15747                    
   15748                            .dwattr $C$DW$T$27, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/de
   15749                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x126)
   15750                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
   15751                            .dwendtag $C$DW$T$27
   15752                    
   15753                    $C$DW$T$673     .dwtag  DW_TAG_typedef
   15754                            .dwattr $C$DW$T$673, DW_AT_name("SlDeviceInitInfo_t")
   15755                            .dwattr $C$DW$T$673, DW_AT_type(*$C$DW$T$27)
   15756                            .dwattr $C$DW$T$673, DW_AT_language(DW_LANG_C)
   15757                            .dwattr $C$DW$T$673, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/d
   15758                            .dwattr $C$DW$T$673, DW_AT_decl_line(0x129)
   15759                            .dwattr $C$DW$T$673, DW_AT_decl_column(0x02)
   15760                    
   15761                    $C$DW$T$674     .dwtag  DW_TAG_pointer_type
   15762                            .dwattr $C$DW$T$674, DW_AT_type(*$C$DW$T$673)
   15763                            .dwattr $C$DW$T$674, DW_AT_address_class(0x20)
   15764                    
   15765                    
   15766                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
   15767                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x28)
   15768                    $C$DW$997       .dwtag  DW_TAG_member
   15769                            .dwattr $C$DW$997, DW_AT_type(*$C$DW$T$6)
   15770                            .dwattr $C$DW$997, DW_AT_name("ProvisioningStatus")
   15771                            .dwattr $C$DW$997, DW_AT_TI_symbol_name("ProvisioningStatus")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  330

   15772                            .dwattr $C$DW$997, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15773                            .dwattr $C$DW$997, DW_AT_accessibility(DW_ACCESS_public)
   15774                            .dwattr $C$DW$997, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15775                            .dwattr $C$DW$997, DW_AT_decl_line(0x28e)
   15776                            .dwattr $C$DW$997, DW_AT_decl_column(0x0a)
   15777                    
   15778                    $C$DW$998       .dwtag  DW_TAG_member
   15779                            .dwattr $C$DW$998, DW_AT_type(*$C$DW$T$6)
   15780                            .dwattr $C$DW$998, DW_AT_name("Role")
   15781                            .dwattr $C$DW$998, DW_AT_TI_symbol_name("Role")
   15782                            .dwattr $C$DW$998, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15783                            .dwattr $C$DW$998, DW_AT_accessibility(DW_ACCESS_public)
   15784                            .dwattr $C$DW$998, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15785                            .dwattr $C$DW$998, DW_AT_decl_line(0x28f)
   15786                            .dwattr $C$DW$998, DW_AT_decl_column(0x0a)
   15787                    
   15788                    $C$DW$999       .dwtag  DW_TAG_member
   15789                            .dwattr $C$DW$999, DW_AT_type(*$C$DW$T$6)
   15790                            .dwattr $C$DW$999, DW_AT_name("WlanStatus")
   15791                            .dwattr $C$DW$999, DW_AT_TI_symbol_name("WlanStatus")
   15792                            .dwattr $C$DW$999, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   15793                            .dwattr $C$DW$999, DW_AT_accessibility(DW_ACCESS_public)
   15794                            .dwattr $C$DW$999, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wla
   15795                            .dwattr $C$DW$999, DW_AT_decl_line(0x290)
   15796                            .dwattr $C$DW$999, DW_AT_decl_column(0x0a)
   15797                    
   15798                    $C$DW$1000      .dwtag  DW_TAG_member
   15799                            .dwattr $C$DW$1000, DW_AT_type(*$C$DW$T$6)
   15800                            .dwattr $C$DW$1000, DW_AT_name("Ssidlen")
   15801                            .dwattr $C$DW$1000, DW_AT_TI_symbol_name("Ssidlen")
   15802                            .dwattr $C$DW$1000, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
   15803                            .dwattr $C$DW$1000, DW_AT_accessibility(DW_ACCESS_public)
   15804                            .dwattr $C$DW$1000, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15805                            .dwattr $C$DW$1000, DW_AT_decl_line(0x291)
   15806                            .dwattr $C$DW$1000, DW_AT_decl_column(0x0a)
   15807                    
   15808                    $C$DW$1001      .dwtag  DW_TAG_member
   15809                            .dwattr $C$DW$1001, DW_AT_type(*$C$DW$T$28)
   15810                            .dwattr $C$DW$1001, DW_AT_name("Ssid")
   15811                            .dwattr $C$DW$1001, DW_AT_TI_symbol_name("Ssid")
   15812                            .dwattr $C$DW$1001, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   15813                            .dwattr $C$DW$1001, DW_AT_accessibility(DW_ACCESS_public)
   15814                            .dwattr $C$DW$1001, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15815                            .dwattr $C$DW$1001, DW_AT_decl_line(0x292)
   15816                            .dwattr $C$DW$1001, DW_AT_decl_column(0x0a)
   15817                    
   15818                    $C$DW$1002      .dwtag  DW_TAG_member
   15819                            .dwattr $C$DW$1002, DW_AT_type(*$C$DW$T$13)
   15820                            .dwattr $C$DW$1002, DW_AT_name("Reserved")
   15821                            .dwattr $C$DW$1002, DW_AT_TI_symbol_name("Reserved")
   15822                            .dwattr $C$DW$1002, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
   15823                            .dwattr $C$DW$1002, DW_AT_accessibility(DW_ACCESS_public)
   15824                            .dwattr $C$DW$1002, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15825                            .dwattr $C$DW$1002, DW_AT_decl_line(0x293)
   15826                            .dwattr $C$DW$1002, DW_AT_decl_column(0x0a)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  331

   15827                    
   15828                            .dwattr $C$DW$T$29, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15829                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x28d)
   15830                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
   15831                            .dwendtag $C$DW$T$29
   15832                    
   15833                    $C$DW$T$337     .dwtag  DW_TAG_typedef
   15834                            .dwattr $C$DW$T$337, DW_AT_name("SlWlanEventProvisioningStatus_t")
   15835                            .dwattr $C$DW$T$337, DW_AT_type(*$C$DW$T$29)
   15836                            .dwattr $C$DW$T$337, DW_AT_language(DW_LANG_C)
   15837                            .dwattr $C$DW$T$337, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   15838                            .dwattr $C$DW$T$337, DW_AT_decl_line(0x294)
   15839                            .dwattr $C$DW$T$337, DW_AT_decl_column(0x02)
   15840                    
   15841                    $C$DW$T$675     .dwtag  DW_TAG_pointer_type
   15842                            .dwattr $C$DW$T$675, DW_AT_type(*$C$DW$T$337)
   15843                            .dwattr $C$DW$T$675, DW_AT_address_class(0x20)
   15844                    
   15845                    
   15846                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
   15847                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x28)
   15848                    $C$DW$1003      .dwtag  DW_TAG_member
   15849                            .dwattr $C$DW$1003, DW_AT_type(*$C$DW$T$6)
   15850                            .dwattr $C$DW$1003, DW_AT_name("SsidLen")
   15851                            .dwattr $C$DW$1003, DW_AT_TI_symbol_name("SsidLen")
   15852                            .dwattr $C$DW$1003, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15853                            .dwattr $C$DW$1003, DW_AT_accessibility(DW_ACCESS_public)
   15854                            .dwattr $C$DW$1003, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15855                            .dwattr $C$DW$1003, DW_AT_decl_line(0x249)
   15856                            .dwattr $C$DW$1003, DW_AT_decl_column(0x0d)
   15857                    
   15858                    $C$DW$1004      .dwtag  DW_TAG_member
   15859                            .dwattr $C$DW$1004, DW_AT_type(*$C$DW$T$28)
   15860                            .dwattr $C$DW$1004, DW_AT_name("SsidName")
   15861                            .dwattr $C$DW$1004, DW_AT_TI_symbol_name("SsidName")
   15862                            .dwattr $C$DW$1004, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15863                            .dwattr $C$DW$1004, DW_AT_accessibility(DW_ACCESS_public)
   15864                            .dwattr $C$DW$1004, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15865                            .dwattr $C$DW$1004, DW_AT_decl_line(0x24a)
   15866                            .dwattr $C$DW$1004, DW_AT_decl_column(0x0d)
   15867                    
   15868                    $C$DW$1005      .dwtag  DW_TAG_member
   15869                            .dwattr $C$DW$1005, DW_AT_type(*$C$DW$T$30)
   15870                            .dwattr $C$DW$1005, DW_AT_name("Bssid")
   15871                            .dwattr $C$DW$1005, DW_AT_TI_symbol_name("Bssid")
   15872                            .dwattr $C$DW$1005, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   15873                            .dwattr $C$DW$1005, DW_AT_accessibility(DW_ACCESS_public)
   15874                            .dwattr $C$DW$1005, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15875                            .dwattr $C$DW$1005, DW_AT_decl_line(0x24b)
   15876                            .dwattr $C$DW$1005, DW_AT_decl_column(0x0d)
   15877                    
   15878                    $C$DW$1006      .dwtag  DW_TAG_member
   15879                            .dwattr $C$DW$1006, DW_AT_type(*$C$DW$T$6)
   15880                            .dwattr $C$DW$1006, DW_AT_name("Channel")
   15881                            .dwattr $C$DW$1006, DW_AT_TI_symbol_name("Channel")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  332

   15882                            .dwattr $C$DW$1006, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   15883                            .dwattr $C$DW$1006, DW_AT_accessibility(DW_ACCESS_public)
   15884                            .dwattr $C$DW$1006, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15885                            .dwattr $C$DW$1006, DW_AT_decl_line(0x24c)
   15886                            .dwattr $C$DW$1006, DW_AT_decl_column(0x0d)
   15887                    
   15888                            .dwattr $C$DW$T$31, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15889                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x248)
   15890                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x01)
   15891                            .dwendtag $C$DW$T$31
   15892                    
   15893                    $C$DW$T$325     .dwtag  DW_TAG_typedef
   15894                            .dwattr $C$DW$T$325, DW_AT_name("SlWlanEventConnect_t")
   15895                            .dwattr $C$DW$T$325, DW_AT_type(*$C$DW$T$31)
   15896                            .dwattr $C$DW$T$325, DW_AT_language(DW_LANG_C)
   15897                            .dwattr $C$DW$T$325, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   15898                            .dwattr $C$DW$T$325, DW_AT_decl_line(0x24d)
   15899                            .dwattr $C$DW$T$325, DW_AT_decl_column(0x03)
   15900                    
   15901                    
   15902                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
   15903                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x28)
   15904                    $C$DW$1007      .dwtag  DW_TAG_member
   15905                            .dwattr $C$DW$1007, DW_AT_type(*$C$DW$T$6)
   15906                            .dwattr $C$DW$1007, DW_AT_name("SsidLen")
   15907                            .dwattr $C$DW$1007, DW_AT_TI_symbol_name("SsidLen")
   15908                            .dwattr $C$DW$1007, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15909                            .dwattr $C$DW$1007, DW_AT_accessibility(DW_ACCESS_public)
   15910                            .dwattr $C$DW$1007, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15911                            .dwattr $C$DW$1007, DW_AT_decl_line(0x251)
   15912                            .dwattr $C$DW$1007, DW_AT_decl_column(0x0d)
   15913                    
   15914                    $C$DW$1008      .dwtag  DW_TAG_member
   15915                            .dwattr $C$DW$1008, DW_AT_type(*$C$DW$T$28)
   15916                            .dwattr $C$DW$1008, DW_AT_name("SsidName")
   15917                            .dwattr $C$DW$1008, DW_AT_TI_symbol_name("SsidName")
   15918                            .dwattr $C$DW$1008, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   15919                            .dwattr $C$DW$1008, DW_AT_accessibility(DW_ACCESS_public)
   15920                            .dwattr $C$DW$1008, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15921                            .dwattr $C$DW$1008, DW_AT_decl_line(0x252)
   15922                            .dwattr $C$DW$1008, DW_AT_decl_column(0x0d)
   15923                    
   15924                    $C$DW$1009      .dwtag  DW_TAG_member
   15925                            .dwattr $C$DW$1009, DW_AT_type(*$C$DW$T$30)
   15926                            .dwattr $C$DW$1009, DW_AT_name("Bssid")
   15927                            .dwattr $C$DW$1009, DW_AT_TI_symbol_name("Bssid")
   15928                            .dwattr $C$DW$1009, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   15929                            .dwattr $C$DW$1009, DW_AT_accessibility(DW_ACCESS_public)
   15930                            .dwattr $C$DW$1009, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15931                            .dwattr $C$DW$1009, DW_AT_decl_line(0x253)
   15932                            .dwattr $C$DW$1009, DW_AT_decl_column(0x0d)
   15933                    
   15934                    $C$DW$1010      .dwtag  DW_TAG_member
   15935                            .dwattr $C$DW$1010, DW_AT_type(*$C$DW$T$6)
   15936                            .dwattr $C$DW$1010, DW_AT_name("ReasonCode")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  333

   15937                            .dwattr $C$DW$1010, DW_AT_TI_symbol_name("ReasonCode")
   15938                            .dwattr $C$DW$1010, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   15939                            .dwattr $C$DW$1010, DW_AT_accessibility(DW_ACCESS_public)
   15940                            .dwattr $C$DW$1010, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15941                            .dwattr $C$DW$1010, DW_AT_decl_line(0x254)
   15942                            .dwattr $C$DW$1010, DW_AT_decl_column(0x0d)
   15943                    
   15944                            .dwattr $C$DW$T$32, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15945                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x250)
   15946                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
   15947                            .dwendtag $C$DW$T$32
   15948                    
   15949                    $C$DW$T$326     .dwtag  DW_TAG_typedef
   15950                            .dwattr $C$DW$T$326, DW_AT_name("SlWlanEventDisconnect_t")
   15951                            .dwattr $C$DW$T$326, DW_AT_type(*$C$DW$T$32)
   15952                            .dwattr $C$DW$T$326, DW_AT_language(DW_LANG_C)
   15953                            .dwattr $C$DW$T$326, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   15954                            .dwattr $C$DW$T$326, DW_AT_decl_line(0x255)
   15955                            .dwattr $C$DW$T$326, DW_AT_decl_column(0x03)
   15956                    
   15957                    
   15958                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
   15959                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x08)
   15960                    $C$DW$1011      .dwtag  DW_TAG_member
   15961                            .dwattr $C$DW$1011, DW_AT_type(*$C$DW$T$30)
   15962                            .dwattr $C$DW$1011, DW_AT_name("Mac")
   15963                            .dwattr $C$DW$1011, DW_AT_TI_symbol_name("Mac")
   15964                            .dwattr $C$DW$1011, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   15965                            .dwattr $C$DW$1011, DW_AT_accessibility(DW_ACCESS_public)
   15966                            .dwattr $C$DW$1011, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15967                            .dwattr $C$DW$1011, DW_AT_decl_line(0x259)
   15968                            .dwattr $C$DW$1011, DW_AT_decl_column(0x0b)
   15969                    
   15970                    $C$DW$1012      .dwtag  DW_TAG_member
   15971                            .dwattr $C$DW$1012, DW_AT_type(*$C$DW$T$33)
   15972                            .dwattr $C$DW$1012, DW_AT_name("Padding")
   15973                            .dwattr $C$DW$1012, DW_AT_TI_symbol_name("Padding")
   15974                            .dwattr $C$DW$1012, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   15975                            .dwattr $C$DW$1012, DW_AT_accessibility(DW_ACCESS_public)
   15976                            .dwattr $C$DW$1012, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15977                            .dwattr $C$DW$1012, DW_AT_decl_line(0x25a)
   15978                            .dwattr $C$DW$1012, DW_AT_decl_column(0x0b)
   15979                    
   15980                            .dwattr $C$DW$T$34, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   15981                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x258)
   15982                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
   15983                            .dwendtag $C$DW$T$34
   15984                    
   15985                    $C$DW$T$327     .dwtag  DW_TAG_typedef
   15986                            .dwattr $C$DW$T$327, DW_AT_name("SlWlanEventSTAAdded_t")
   15987                            .dwattr $C$DW$T$327, DW_AT_type(*$C$DW$T$34)
   15988                            .dwattr $C$DW$T$327, DW_AT_language(DW_LANG_C)
   15989                            .dwattr $C$DW$T$327, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   15990                            .dwattr $C$DW$T$327, DW_AT_decl_line(0x25b)
   15991                            .dwattr $C$DW$T$327, DW_AT_decl_column(0x02)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  334

   15992                    
   15993                    $C$DW$T$328     .dwtag  DW_TAG_typedef
   15994                            .dwattr $C$DW$T$328, DW_AT_name("SlWlanEventSTARemoved_t")
   15995                            .dwattr $C$DW$T$328, DW_AT_type(*$C$DW$T$34)
   15996                            .dwattr $C$DW$T$328, DW_AT_language(DW_LANG_C)
   15997                            .dwattr $C$DW$T$328, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   15998                            .dwattr $C$DW$T$328, DW_AT_decl_line(0x25b)
   15999                            .dwattr $C$DW$T$328, DW_AT_decl_column(0x19)
   16000                    
   16001                    
   16002                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
   16003                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x4c)
   16004                    $C$DW$1013      .dwtag  DW_TAG_member
   16005                            .dwattr $C$DW$1013, DW_AT_type(*$C$DW$T$6)
   16006                            .dwattr $C$DW$1013, DW_AT_name("SsidLen")
   16007                            .dwattr $C$DW$1013, DW_AT_TI_symbol_name("SsidLen")
   16008                            .dwattr $C$DW$1013, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16009                            .dwattr $C$DW$1013, DW_AT_accessibility(DW_ACCESS_public)
   16010                            .dwattr $C$DW$1013, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16011                            .dwattr $C$DW$1013, DW_AT_decl_line(0x260)
   16012                            .dwattr $C$DW$1013, DW_AT_decl_column(0x0d)
   16013                    
   16014                    $C$DW$1014      .dwtag  DW_TAG_member
   16015                            .dwattr $C$DW$1014, DW_AT_type(*$C$DW$T$28)
   16016                            .dwattr $C$DW$1014, DW_AT_name("SsidName")
   16017                            .dwattr $C$DW$1014, DW_AT_TI_symbol_name("SsidName")
   16018                            .dwattr $C$DW$1014, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16019                            .dwattr $C$DW$1014, DW_AT_accessibility(DW_ACCESS_public)
   16020                            .dwattr $C$DW$1014, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16021                            .dwattr $C$DW$1014, DW_AT_decl_line(0x261)
   16022                            .dwattr $C$DW$1014, DW_AT_decl_column(0x0d)
   16023                    
   16024                    $C$DW$1015      .dwtag  DW_TAG_member
   16025                            .dwattr $C$DW$1015, DW_AT_type(*$C$DW$T$30)
   16026                            .dwattr $C$DW$1015, DW_AT_name("Bssid")
   16027                            .dwattr $C$DW$1015, DW_AT_TI_symbol_name("Bssid")
   16028                            .dwattr $C$DW$1015, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   16029                            .dwattr $C$DW$1015, DW_AT_accessibility(DW_ACCESS_public)
   16030                            .dwattr $C$DW$1015, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16031                            .dwattr $C$DW$1015, DW_AT_decl_line(0x262)
   16032                            .dwattr $C$DW$1015, DW_AT_decl_column(0x0d)
   16033                    
   16034                    $C$DW$1016      .dwtag  DW_TAG_member
   16035                            .dwattr $C$DW$1016, DW_AT_type(*$C$DW$T$6)
   16036                            .dwattr $C$DW$1016, DW_AT_name("Reserved")
   16037                            .dwattr $C$DW$1016, DW_AT_TI_symbol_name("Reserved")
   16038                            .dwattr $C$DW$1016, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   16039                            .dwattr $C$DW$1016, DW_AT_accessibility(DW_ACCESS_public)
   16040                            .dwattr $C$DW$1016, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16041                            .dwattr $C$DW$1016, DW_AT_decl_line(0x263)
   16042                            .dwattr $C$DW$1016, DW_AT_decl_column(0x0d)
   16043                    
   16044                    $C$DW$1017      .dwtag  DW_TAG_member
   16045                            .dwattr $C$DW$1017, DW_AT_type(*$C$DW$T$6)
   16046                            .dwattr $C$DW$1017, DW_AT_name("GoDeviceNameLen")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  335

   16047                            .dwattr $C$DW$1017, DW_AT_TI_symbol_name("GoDeviceNameLen")
   16048                            .dwattr $C$DW$1017, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   16049                            .dwattr $C$DW$1017, DW_AT_accessibility(DW_ACCESS_public)
   16050                            .dwattr $C$DW$1017, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16051                            .dwattr $C$DW$1017, DW_AT_decl_line(0x264)
   16052                            .dwattr $C$DW$1017, DW_AT_decl_column(0x0d)
   16053                    
   16054                    $C$DW$1018      .dwtag  DW_TAG_member
   16055                            .dwattr $C$DW$1018, DW_AT_type(*$C$DW$T$28)
   16056                            .dwattr $C$DW$1018, DW_AT_name("GoDeviceName")
   16057                            .dwattr $C$DW$1018, DW_AT_TI_symbol_name("GoDeviceName")
   16058                            .dwattr $C$DW$1018, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
   16059                            .dwattr $C$DW$1018, DW_AT_accessibility(DW_ACCESS_public)
   16060                            .dwattr $C$DW$1018, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16061                            .dwattr $C$DW$1018, DW_AT_decl_line(0x265)
   16062                            .dwattr $C$DW$1018, DW_AT_decl_column(0x0d)
   16063                    
   16064                    $C$DW$1019      .dwtag  DW_TAG_member
   16065                            .dwattr $C$DW$1019, DW_AT_type(*$C$DW$T$35)
   16066                            .dwattr $C$DW$1019, DW_AT_name("Padding")
   16067                            .dwattr $C$DW$1019, DW_AT_TI_symbol_name("Padding")
   16068                            .dwattr $C$DW$1019, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
   16069                            .dwattr $C$DW$1019, DW_AT_accessibility(DW_ACCESS_public)
   16070                            .dwattr $C$DW$1019, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16071                            .dwattr $C$DW$1019, DW_AT_decl_line(0x266)
   16072                            .dwattr $C$DW$1019, DW_AT_decl_column(0x0d)
   16073                    
   16074                            .dwattr $C$DW$T$36, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16075                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x25f)
   16076                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
   16077                            .dwendtag $C$DW$T$36
   16078                    
   16079                    $C$DW$T$329     .dwtag  DW_TAG_typedef
   16080                            .dwattr $C$DW$T$329, DW_AT_name("SlWlanEventP2PConnect_t")
   16081                            .dwattr $C$DW$T$329, DW_AT_type(*$C$DW$T$36)
   16082                            .dwattr $C$DW$T$329, DW_AT_language(DW_LANG_C)
   16083                            .dwattr $C$DW$T$329, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   16084                            .dwattr $C$DW$T$329, DW_AT_decl_line(0x267)
   16085                            .dwattr $C$DW$T$329, DW_AT_decl_column(0x03)
   16086                    
   16087                    
   16088                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
   16089                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x4c)
   16090                    $C$DW$1020      .dwtag  DW_TAG_member
   16091                            .dwattr $C$DW$1020, DW_AT_type(*$C$DW$T$6)
   16092                            .dwattr $C$DW$1020, DW_AT_name("SsidLen")
   16093                            .dwattr $C$DW$1020, DW_AT_TI_symbol_name("SsidLen")
   16094                            .dwattr $C$DW$1020, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16095                            .dwattr $C$DW$1020, DW_AT_accessibility(DW_ACCESS_public)
   16096                            .dwattr $C$DW$1020, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16097                            .dwattr $C$DW$1020, DW_AT_decl_line(0x26b)
   16098                            .dwattr $C$DW$1020, DW_AT_decl_column(0x0d)
   16099                    
   16100                    $C$DW$1021      .dwtag  DW_TAG_member
   16101                            .dwattr $C$DW$1021, DW_AT_type(*$C$DW$T$28)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  336

   16102                            .dwattr $C$DW$1021, DW_AT_name("SsidName")
   16103                            .dwattr $C$DW$1021, DW_AT_TI_symbol_name("SsidName")
   16104                            .dwattr $C$DW$1021, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16105                            .dwattr $C$DW$1021, DW_AT_accessibility(DW_ACCESS_public)
   16106                            .dwattr $C$DW$1021, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16107                            .dwattr $C$DW$1021, DW_AT_decl_line(0x26c)
   16108                            .dwattr $C$DW$1021, DW_AT_decl_column(0x0d)
   16109                    
   16110                    $C$DW$1022      .dwtag  DW_TAG_member
   16111                            .dwattr $C$DW$1022, DW_AT_type(*$C$DW$T$30)
   16112                            .dwattr $C$DW$1022, DW_AT_name("Bssid")
   16113                            .dwattr $C$DW$1022, DW_AT_TI_symbol_name("Bssid")
   16114                            .dwattr $C$DW$1022, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   16115                            .dwattr $C$DW$1022, DW_AT_accessibility(DW_ACCESS_public)
   16116                            .dwattr $C$DW$1022, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16117                            .dwattr $C$DW$1022, DW_AT_decl_line(0x26d)
   16118                            .dwattr $C$DW$1022, DW_AT_decl_column(0x0d)
   16119                    
   16120                    $C$DW$1023      .dwtag  DW_TAG_member
   16121                            .dwattr $C$DW$1023, DW_AT_type(*$C$DW$T$6)
   16122                            .dwattr $C$DW$1023, DW_AT_name("ReasonCode")
   16123                            .dwattr $C$DW$1023, DW_AT_TI_symbol_name("ReasonCode")
   16124                            .dwattr $C$DW$1023, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   16125                            .dwattr $C$DW$1023, DW_AT_accessibility(DW_ACCESS_public)
   16126                            .dwattr $C$DW$1023, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16127                            .dwattr $C$DW$1023, DW_AT_decl_line(0x26e)
   16128                            .dwattr $C$DW$1023, DW_AT_decl_column(0x0d)
   16129                    
   16130                    $C$DW$1024      .dwtag  DW_TAG_member
   16131                            .dwattr $C$DW$1024, DW_AT_type(*$C$DW$T$6)
   16132                            .dwattr $C$DW$1024, DW_AT_name("GoDeviceNameLen")
   16133                            .dwattr $C$DW$1024, DW_AT_TI_symbol_name("GoDeviceNameLen")
   16134                            .dwattr $C$DW$1024, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   16135                            .dwattr $C$DW$1024, DW_AT_accessibility(DW_ACCESS_public)
   16136                            .dwattr $C$DW$1024, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16137                            .dwattr $C$DW$1024, DW_AT_decl_line(0x26f)
   16138                            .dwattr $C$DW$1024, DW_AT_decl_column(0x0d)
   16139                    
   16140                    $C$DW$1025      .dwtag  DW_TAG_member
   16141                            .dwattr $C$DW$1025, DW_AT_type(*$C$DW$T$28)
   16142                            .dwattr $C$DW$1025, DW_AT_name("GoDeviceName")
   16143                            .dwattr $C$DW$1025, DW_AT_TI_symbol_name("GoDeviceName")
   16144                            .dwattr $C$DW$1025, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
   16145                            .dwattr $C$DW$1025, DW_AT_accessibility(DW_ACCESS_public)
   16146                            .dwattr $C$DW$1025, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16147                            .dwattr $C$DW$1025, DW_AT_decl_line(0x270)
   16148                            .dwattr $C$DW$1025, DW_AT_decl_column(0x0d)
   16149                    
   16150                    $C$DW$1026      .dwtag  DW_TAG_member
   16151                            .dwattr $C$DW$1026, DW_AT_type(*$C$DW$T$35)
   16152                            .dwattr $C$DW$1026, DW_AT_name("Padding")
   16153                            .dwattr $C$DW$1026, DW_AT_TI_symbol_name("Padding")
   16154                            .dwattr $C$DW$1026, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
   16155                            .dwattr $C$DW$1026, DW_AT_accessibility(DW_ACCESS_public)
   16156                            .dwattr $C$DW$1026, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  337

   16157                            .dwattr $C$DW$1026, DW_AT_decl_line(0x271)
   16158                            .dwattr $C$DW$1026, DW_AT_decl_column(0x0d)
   16159                    
   16160                            .dwattr $C$DW$T$37, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16161                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x26a)
   16162                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
   16163                            .dwendtag $C$DW$T$37
   16164                    
   16165                    $C$DW$T$330     .dwtag  DW_TAG_typedef
   16166                            .dwattr $C$DW$T$330, DW_AT_name("SlWlanEventP2PDisconnect_t")
   16167                            .dwattr $C$DW$T$330, DW_AT_type(*$C$DW$T$37)
   16168                            .dwattr $C$DW$T$330, DW_AT_language(DW_LANG_C)
   16169                            .dwattr $C$DW$T$330, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   16170                            .dwattr $C$DW$T$330, DW_AT_decl_line(0x272)
   16171                            .dwattr $C$DW$T$330, DW_AT_decl_column(0x03)
   16172                    
   16173                    
   16174                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
   16175                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x48)
   16176                    $C$DW$1027      .dwtag  DW_TAG_member
   16177                            .dwattr $C$DW$1027, DW_AT_type(*$C$DW$T$30)
   16178                            .dwattr $C$DW$1027, DW_AT_name("Mac")
   16179                            .dwattr $C$DW$1027, DW_AT_TI_symbol_name("Mac")
   16180                            .dwattr $C$DW$1027, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16181                            .dwattr $C$DW$1027, DW_AT_accessibility(DW_ACCESS_public)
   16182                            .dwattr $C$DW$1027, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16183                            .dwattr $C$DW$1027, DW_AT_decl_line(0x276)
   16184                            .dwattr $C$DW$1027, DW_AT_decl_column(0x0d)
   16185                    
   16186                    $C$DW$1028      .dwtag  DW_TAG_member
   16187                            .dwattr $C$DW$1028, DW_AT_type(*$C$DW$T$6)
   16188                            .dwattr $C$DW$1028, DW_AT_name("ClDeviceNameLen")
   16189                            .dwattr $C$DW$1028, DW_AT_TI_symbol_name("ClDeviceNameLen")
   16190                            .dwattr $C$DW$1028, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
   16191                            .dwattr $C$DW$1028, DW_AT_accessibility(DW_ACCESS_public)
   16192                            .dwattr $C$DW$1028, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16193                            .dwattr $C$DW$1028, DW_AT_decl_line(0x277)
   16194                            .dwattr $C$DW$1028, DW_AT_decl_column(0x0d)
   16195                    
   16196                    $C$DW$1029      .dwtag  DW_TAG_member
   16197                            .dwattr $C$DW$1029, DW_AT_type(*$C$DW$T$28)
   16198                            .dwattr $C$DW$1029, DW_AT_name("ClDeviceName")
   16199                            .dwattr $C$DW$1029, DW_AT_TI_symbol_name("ClDeviceName")
   16200                            .dwattr $C$DW$1029, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
   16201                            .dwattr $C$DW$1029, DW_AT_accessibility(DW_ACCESS_public)
   16202                            .dwattr $C$DW$1029, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16203                            .dwattr $C$DW$1029, DW_AT_decl_line(0x278)
   16204                            .dwattr $C$DW$1029, DW_AT_decl_column(0x0d)
   16205                    
   16206                    $C$DW$1030      .dwtag  DW_TAG_member
   16207                            .dwattr $C$DW$1030, DW_AT_type(*$C$DW$T$6)
   16208                            .dwattr $C$DW$1030, DW_AT_name("OwnSsidLen")
   16209                            .dwattr $C$DW$1030, DW_AT_TI_symbol_name("OwnSsidLen")
   16210                            .dwattr $C$DW$1030, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   16211                            .dwattr $C$DW$1030, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  338

   16212                            .dwattr $C$DW$1030, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16213                            .dwattr $C$DW$1030, DW_AT_decl_line(0x279)
   16214                            .dwattr $C$DW$1030, DW_AT_decl_column(0x0d)
   16215                    
   16216                    $C$DW$1031      .dwtag  DW_TAG_member
   16217                            .dwattr $C$DW$1031, DW_AT_type(*$C$DW$T$28)
   16218                            .dwattr $C$DW$1031, DW_AT_name("OwnSsid")
   16219                            .dwattr $C$DW$1031, DW_AT_TI_symbol_name("OwnSsid")
   16220                            .dwattr $C$DW$1031, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   16221                            .dwattr $C$DW$1031, DW_AT_accessibility(DW_ACCESS_public)
   16222                            .dwattr $C$DW$1031, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16223                            .dwattr $C$DW$1031, DW_AT_decl_line(0x27a)
   16224                            .dwattr $C$DW$1031, DW_AT_decl_column(0x0d)
   16225                    
   16226                            .dwattr $C$DW$T$38, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16227                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x275)
   16228                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
   16229                            .dwendtag $C$DW$T$38
   16230                    
   16231                    $C$DW$T$331     .dwtag  DW_TAG_typedef
   16232                            .dwattr $C$DW$T$331, DW_AT_name("SlWlanEventP2PClientAdded_t")
   16233                            .dwattr $C$DW$T$331, DW_AT_type(*$C$DW$T$38)
   16234                            .dwattr $C$DW$T$331, DW_AT_language(DW_LANG_C)
   16235                            .dwattr $C$DW$T$331, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   16236                            .dwattr $C$DW$T$331, DW_AT_decl_line(0x27b)
   16237                            .dwattr $C$DW$T$331, DW_AT_decl_column(0x02)
   16238                    
   16239                    $C$DW$T$332     .dwtag  DW_TAG_typedef
   16240                            .dwattr $C$DW$T$332, DW_AT_name("SlWlanEventP2PClientRemoved_t")
   16241                            .dwattr $C$DW$T$332, DW_AT_type(*$C$DW$T$38)
   16242                            .dwattr $C$DW$T$332, DW_AT_language(DW_LANG_C)
   16243                            .dwattr $C$DW$T$332, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   16244                            .dwattr $C$DW$T$332, DW_AT_decl_line(0x27b)
   16245                            .dwattr $C$DW$T$332, DW_AT_decl_column(0x1f)
   16246                    
   16247                    
   16248                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
   16249                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x28)
   16250                    $C$DW$1032      .dwtag  DW_TAG_member
   16251                            .dwattr $C$DW$1032, DW_AT_type(*$C$DW$T$6)
   16252                            .dwattr $C$DW$1032, DW_AT_name("GoDeviceNameLen")
   16253                            .dwattr $C$DW$1032, DW_AT_TI_symbol_name("GoDeviceNameLen")
   16254                            .dwattr $C$DW$1032, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16255                            .dwattr $C$DW$1032, DW_AT_accessibility(DW_ACCESS_public)
   16256                            .dwattr $C$DW$1032, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16257                            .dwattr $C$DW$1032, DW_AT_decl_line(0x27f)
   16258                            .dwattr $C$DW$1032, DW_AT_decl_column(0x0d)
   16259                    
   16260                    $C$DW$1033      .dwtag  DW_TAG_member
   16261                            .dwattr $C$DW$1033, DW_AT_type(*$C$DW$T$28)
   16262                            .dwattr $C$DW$1033, DW_AT_name("GoDeviceName")
   16263                            .dwattr $C$DW$1033, DW_AT_TI_symbol_name("GoDeviceName")
   16264                            .dwattr $C$DW$1033, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16265                            .dwattr $C$DW$1033, DW_AT_accessibility(DW_ACCESS_public)
   16266                            .dwattr $C$DW$1033, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  339

   16267                            .dwattr $C$DW$1033, DW_AT_decl_line(0x280)
   16268                            .dwattr $C$DW$1033, DW_AT_decl_column(0x0d)
   16269                    
   16270                    $C$DW$1034      .dwtag  DW_TAG_member
   16271                            .dwattr $C$DW$1034, DW_AT_type(*$C$DW$T$30)
   16272                            .dwattr $C$DW$1034, DW_AT_name("Mac")
   16273                            .dwattr $C$DW$1034, DW_AT_TI_symbol_name("Mac")
   16274                            .dwattr $C$DW$1034, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
   16275                            .dwattr $C$DW$1034, DW_AT_accessibility(DW_ACCESS_public)
   16276                            .dwattr $C$DW$1034, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16277                            .dwattr $C$DW$1034, DW_AT_decl_line(0x281)
   16278                            .dwattr $C$DW$1034, DW_AT_decl_column(0x0d)
   16279                    
   16280                    $C$DW$1035      .dwtag  DW_TAG_member
   16281                            .dwattr $C$DW$1035, DW_AT_type(*$C$DW$T$6)
   16282                            .dwattr $C$DW$1035, DW_AT_name("WpsMethod")
   16283                            .dwattr $C$DW$1035, DW_AT_TI_symbol_name("WpsMethod")
   16284                            .dwattr $C$DW$1035, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
   16285                            .dwattr $C$DW$1035, DW_AT_accessibility(DW_ACCESS_public)
   16286                            .dwattr $C$DW$1035, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16287                            .dwattr $C$DW$1035, DW_AT_decl_line(0x282)
   16288                            .dwattr $C$DW$1035, DW_AT_decl_column(0x0d)
   16289                    
   16290                            .dwattr $C$DW$T$39, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16291                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x27e)
   16292                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
   16293                            .dwendtag $C$DW$T$39
   16294                    
   16295                    $C$DW$T$333     .dwtag  DW_TAG_typedef
   16296                            .dwattr $C$DW$T$333, DW_AT_name("SlWlanEventP2PDevFound_t")
   16297                            .dwattr $C$DW$T$333, DW_AT_type(*$C$DW$T$39)
   16298                            .dwattr $C$DW$T$333, DW_AT_language(DW_LANG_C)
   16299                            .dwattr $C$DW$T$333, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   16300                            .dwattr $C$DW$T$333, DW_AT_decl_line(0x283)
   16301                            .dwattr $C$DW$T$333, DW_AT_decl_column(0x02)
   16302                    
   16303                    $C$DW$T$334     .dwtag  DW_TAG_typedef
   16304                            .dwattr $C$DW$T$334, DW_AT_name("SlWlanEventP2PRequest_t")
   16305                            .dwattr $C$DW$T$334, DW_AT_type(*$C$DW$T$39)
   16306                            .dwattr $C$DW$T$334, DW_AT_language(DW_LANG_C)
   16307                            .dwattr $C$DW$T$334, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   16308                            .dwattr $C$DW$T$334, DW_AT_decl_line(0x283)
   16309                            .dwattr $C$DW$T$334, DW_AT_decl_column(0x1c)
   16310                    
   16311                    
   16312                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
   16313                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
   16314                    $C$DW$1036      .dwtag  DW_TAG_member
   16315                            .dwattr $C$DW$1036, DW_AT_type(*$C$DW$T$9)
   16316                            .dwattr $C$DW$1036, DW_AT_name("Status")
   16317                            .dwattr $C$DW$1036, DW_AT_TI_symbol_name("Status")
   16318                            .dwattr $C$DW$1036, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16319                            .dwattr $C$DW$1036, DW_AT_accessibility(DW_ACCESS_public)
   16320                            .dwattr $C$DW$1036, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16321                            .dwattr $C$DW$1036, DW_AT_decl_line(0x288)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  340

   16322                            .dwattr $C$DW$1036, DW_AT_decl_column(0x0d)
   16323                    
   16324                    $C$DW$1037      .dwtag  DW_TAG_member
   16325                            .dwattr $C$DW$1037, DW_AT_type(*$C$DW$T$9)
   16326                            .dwattr $C$DW$1037, DW_AT_name("Padding")
   16327                            .dwattr $C$DW$1037, DW_AT_TI_symbol_name("Padding")
   16328                            .dwattr $C$DW$1037, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16329                            .dwattr $C$DW$1037, DW_AT_accessibility(DW_ACCESS_public)
   16330                            .dwattr $C$DW$1037, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16331                            .dwattr $C$DW$1037, DW_AT_decl_line(0x289)
   16332                            .dwattr $C$DW$1037, DW_AT_decl_column(0x0d)
   16333                    
   16334                            .dwattr $C$DW$T$40, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16335                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x287)
   16336                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
   16337                            .dwendtag $C$DW$T$40
   16338                    
   16339                    $C$DW$T$335     .dwtag  DW_TAG_typedef
   16340                            .dwattr $C$DW$T$335, DW_AT_name("SlWlanEventP2PConnectFail_t")
   16341                            .dwattr $C$DW$T$335, DW_AT_type(*$C$DW$T$40)
   16342                            .dwattr $C$DW$T$335, DW_AT_language(DW_LANG_C)
   16343                            .dwattr $C$DW$T$335, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   16344                            .dwattr $C$DW$T$335, DW_AT_decl_line(0x28a)
   16345                            .dwattr $C$DW$T$335, DW_AT_decl_column(0x02)
   16346                    
   16347                    
   16348                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
   16349                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x09)
   16350                    $C$DW$1038      .dwtag  DW_TAG_member
   16351                            .dwattr $C$DW$1038, DW_AT_type(*$C$DW$T$6)
   16352                            .dwattr $C$DW$1038, DW_AT_name("Type")
   16353                            .dwattr $C$DW$1038, DW_AT_TI_symbol_name("Type")
   16354                            .dwattr $C$DW$1038, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16355                            .dwattr $C$DW$1038, DW_AT_accessibility(DW_ACCESS_public)
   16356                            .dwattr $C$DW$1038, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16357                            .dwattr $C$DW$1038, DW_AT_decl_line(0x23a)
   16358                            .dwattr $C$DW$1038, DW_AT_decl_column(0x0d)
   16359                    
   16360                    $C$DW$1039      .dwtag  DW_TAG_member
   16361                            .dwattr $C$DW$1039, DW_AT_type(*$C$DW$T$41)
   16362                            .dwattr $C$DW$1039, DW_AT_name("UserActionIdBitmap")
   16363                            .dwattr $C$DW$1039, DW_AT_TI_symbol_name("UserActionIdBitmap")
   16364                            .dwattr $C$DW$1039, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16365                            .dwattr $C$DW$1039, DW_AT_accessibility(DW_ACCESS_public)
   16366                            .dwattr $C$DW$1039, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16367                            .dwattr $C$DW$1039, DW_AT_decl_line(0x23b)
   16368                            .dwattr $C$DW$1039, DW_AT_decl_column(0x0d)
   16369                    
   16370                            .dwattr $C$DW$T$42, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16371                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x239)
   16372                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
   16373                            .dwendtag $C$DW$T$42
   16374                    
   16375                    $C$DW$T$336     .dwtag  DW_TAG_typedef
   16376                            .dwattr $C$DW$T$336, DW_AT_name("SlWlanEventRxFilterInfo_t")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  341

   16377                            .dwattr $C$DW$T$336, DW_AT_type(*$C$DW$T$42)
   16378                            .dwattr $C$DW$T$336, DW_AT_language(DW_LANG_C)
   16379                            .dwattr $C$DW$T$336, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   16380                            .dwattr $C$DW$T$336, DW_AT_decl_line(0x23c)
   16381                            .dwattr $C$DW$T$336, DW_AT_decl_column(0x02)
   16382                    
   16383                    
   16384                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
   16385                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x4c)
   16386                    $C$DW$1040      .dwtag  DW_TAG_member
   16387                            .dwattr $C$DW$1040, DW_AT_type(*$C$DW$T$13)
   16388                            .dwattr $C$DW$1040, DW_AT_name("Status")
   16389                            .dwattr $C$DW$1040, DW_AT_TI_symbol_name("Status")
   16390                            .dwattr $C$DW$1040, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16391                            .dwattr $C$DW$1040, DW_AT_accessibility(DW_ACCESS_public)
   16392                            .dwattr $C$DW$1040, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16393                            .dwattr $C$DW$1040, DW_AT_decl_line(0x298)
   16394                            .dwattr $C$DW$1040, DW_AT_decl_column(0x0d)
   16395                    
   16396                    $C$DW$1041      .dwtag  DW_TAG_member
   16397                            .dwattr $C$DW$1041, DW_AT_type(*$C$DW$T$13)
   16398                            .dwattr $C$DW$1041, DW_AT_name("SsidLen")
   16399                            .dwattr $C$DW$1041, DW_AT_TI_symbol_name("SsidLen")
   16400                            .dwattr $C$DW$1041, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16401                            .dwattr $C$DW$1041, DW_AT_accessibility(DW_ACCESS_public)
   16402                            .dwattr $C$DW$1041, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16403                            .dwattr $C$DW$1041, DW_AT_decl_line(0x299)
   16404                            .dwattr $C$DW$1041, DW_AT_decl_column(0x0d)
   16405                    
   16406                    $C$DW$1042      .dwtag  DW_TAG_member
   16407                            .dwattr $C$DW$1042, DW_AT_type(*$C$DW$T$28)
   16408                            .dwattr $C$DW$1042, DW_AT_name("Ssid")
   16409                            .dwattr $C$DW$1042, DW_AT_TI_symbol_name("Ssid")
   16410                            .dwattr $C$DW$1042, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16411                            .dwattr $C$DW$1042, DW_AT_accessibility(DW_ACCESS_public)
   16412                            .dwattr $C$DW$1042, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16413                            .dwattr $C$DW$1042, DW_AT_decl_line(0x29a)
   16414                            .dwattr $C$DW$1042, DW_AT_decl_column(0x0d)
   16415                    
   16416                    $C$DW$1043      .dwtag  DW_TAG_member
   16417                            .dwattr $C$DW$1043, DW_AT_type(*$C$DW$T$13)
   16418                            .dwattr $C$DW$1043, DW_AT_name("ReservedLen")
   16419                            .dwattr $C$DW$1043, DW_AT_TI_symbol_name("ReservedLen")
   16420                            .dwattr $C$DW$1043, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
   16421                            .dwattr $C$DW$1043, DW_AT_accessibility(DW_ACCESS_public)
   16422                            .dwattr $C$DW$1043, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16423                            .dwattr $C$DW$1043, DW_AT_decl_line(0x29b)
   16424                            .dwattr $C$DW$1043, DW_AT_decl_column(0x0d)
   16425                    
   16426                    $C$DW$1044      .dwtag  DW_TAG_member
   16427                            .dwattr $C$DW$1044, DW_AT_type(*$C$DW$T$28)
   16428                            .dwattr $C$DW$1044, DW_AT_name("Reserved")
   16429                            .dwattr $C$DW$1044, DW_AT_TI_symbol_name("Reserved")
   16430                            .dwattr $C$DW$1044, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
   16431                            .dwattr $C$DW$1044, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  342

   16432                            .dwattr $C$DW$1044, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16433                            .dwattr $C$DW$1044, DW_AT_decl_line(0x29c)
   16434                            .dwattr $C$DW$1044, DW_AT_decl_column(0x0d)
   16435                    
   16436                            .dwattr $C$DW$T$43, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16437                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x297)
   16438                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
   16439                            .dwendtag $C$DW$T$43
   16440                    
   16441                    $C$DW$T$338     .dwtag  DW_TAG_typedef
   16442                            .dwattr $C$DW$T$338, DW_AT_name("SlWlanEventProvisioningProfileAdded_t")
   16443                            .dwattr $C$DW$T$338, DW_AT_type(*$C$DW$T$43)
   16444                            .dwattr $C$DW$T$338, DW_AT_language(DW_LANG_C)
   16445                            .dwattr $C$DW$T$338, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   16446                            .dwattr $C$DW$T$338, DW_AT_decl_line(0x29d)
   16447                            .dwattr $C$DW$T$338, DW_AT_decl_column(0x03)
   16448                    
   16449                    
   16450                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
   16451                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
   16452                    $C$DW$1045      .dwtag  DW_TAG_member
   16453                            .dwattr $C$DW$1045, DW_AT_type(*$C$DW$T$6)
   16454                            .dwattr $C$DW$1045, DW_AT_name("Data")
   16455                            .dwattr $C$DW$1045, DW_AT_TI_symbol_name("Data")
   16456                            .dwattr $C$DW$1045, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16457                            .dwattr $C$DW$1045, DW_AT_accessibility(DW_ACCESS_public)
   16458                            .dwattr $C$DW$1045, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16459                            .dwattr $C$DW$1045, DW_AT_decl_line(0x2a1)
   16460                            .dwattr $C$DW$1045, DW_AT_decl_column(0x0a)
   16461                    
   16462                    $C$DW$1046      .dwtag  DW_TAG_member
   16463                            .dwattr $C$DW$1046, DW_AT_type(*$C$DW$T$6)
   16464                            .dwattr $C$DW$1046, DW_AT_name("TriggerId")
   16465                            .dwattr $C$DW$1046, DW_AT_TI_symbol_name("TriggerId")
   16466                            .dwattr $C$DW$1046, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
   16467                            .dwattr $C$DW$1046, DW_AT_accessibility(DW_ACCESS_public)
   16468                            .dwattr $C$DW$1046, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16469                            .dwattr $C$DW$1046, DW_AT_decl_line(0x2a2)
   16470                            .dwattr $C$DW$1046, DW_AT_decl_column(0x0a)
   16471                    
   16472                    $C$DW$1047      .dwtag  DW_TAG_member
   16473                            .dwattr $C$DW$1047, DW_AT_type(*$C$DW$T$33)
   16474                            .dwattr $C$DW$1047, DW_AT_name("Padding")
   16475                            .dwattr $C$DW$1047, DW_AT_TI_symbol_name("Padding")
   16476                            .dwattr $C$DW$1047, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
   16477                            .dwattr $C$DW$1047, DW_AT_accessibility(DW_ACCESS_public)
   16478                            .dwattr $C$DW$1047, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16479                            .dwattr $C$DW$1047, DW_AT_decl_line(0x2a3)
   16480                            .dwattr $C$DW$1047, DW_AT_decl_column(0x0a)
   16481                    
   16482                            .dwattr $C$DW$T$44, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16483                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2a0)
   16484                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
   16485                            .dwendtag $C$DW$T$44
   16486                    
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  343

   16487                    $C$DW$T$339     .dwtag  DW_TAG_typedef
   16488                            .dwattr $C$DW$T$339, DW_AT_name("SlWlanLinkQualityAsyncEvent_t")
   16489                            .dwattr $C$DW$T$339, DW_AT_type(*$C$DW$T$44)
   16490                            .dwattr $C$DW$T$339, DW_AT_language(DW_LANG_C)
   16491                            .dwattr $C$DW$T$339, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   16492                            .dwattr $C$DW$T$339, DW_AT_decl_line(0x2a4)
   16493                            .dwattr $C$DW$T$339, DW_AT_decl_column(0x02)
   16494                    
   16495                    
   16496                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
   16497                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x50)
   16498                    $C$DW$1048      .dwtag  DW_TAG_member
   16499                            .dwattr $C$DW$1048, DW_AT_type(*$C$DW$T$13)
   16500                            .dwattr $C$DW$1048, DW_AT_name("Id")
   16501                            .dwattr $C$DW$1048, DW_AT_TI_symbol_name("Id")
   16502                            .dwattr $C$DW$1048, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16503                            .dwattr $C$DW$1048, DW_AT_accessibility(DW_ACCESS_public)
   16504                            .dwattr $C$DW$1048, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16505                            .dwattr $C$DW$1048, DW_AT_decl_line(0x2bb)
   16506                            .dwattr $C$DW$1048, DW_AT_decl_column(0x19)
   16507                    
   16508                    $C$DW$1049      .dwtag  DW_TAG_member
   16509                            .dwattr $C$DW$1049, DW_AT_type(*$C$DW$T$45)
   16510                            .dwattr $C$DW$1049, DW_AT_name("Data")
   16511                            .dwattr $C$DW$1049, DW_AT_TI_symbol_name("Data")
   16512                            .dwattr $C$DW$1049, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16513                            .dwattr $C$DW$1049, DW_AT_accessibility(DW_ACCESS_public)
   16514                            .dwattr $C$DW$1049, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16515                            .dwattr $C$DW$1049, DW_AT_decl_line(0x2bc)
   16516                            .dwattr $C$DW$1049, DW_AT_decl_column(0x19)
   16517                    
   16518                            .dwattr $C$DW$T$46, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/wl
   16519                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2ba)
   16520                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
   16521                            .dwendtag $C$DW$T$46
   16522                    
   16523                    $C$DW$T$589     .dwtag  DW_TAG_typedef
   16524                            .dwattr $C$DW$T$589, DW_AT_name("SlWlanEvent_t")
   16525                            .dwattr $C$DW$T$589, DW_AT_type(*$C$DW$T$46)
   16526                            .dwattr $C$DW$T$589, DW_AT_language(DW_LANG_C)
   16527                            .dwattr $C$DW$T$589, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/w
   16528                            .dwattr $C$DW$T$589, DW_AT_decl_line(0x2bd)
   16529                            .dwattr $C$DW$T$589, DW_AT_decl_column(0x03)
   16530                    
   16531                    $C$DW$T$590     .dwtag  DW_TAG_pointer_type
   16532                            .dwattr $C$DW$T$590, DW_AT_type(*$C$DW$T$589)
   16533                            .dwattr $C$DW$T$590, DW_AT_address_class(0x20)
   16534                    
   16535                    
   16536                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
   16537                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x0c)
   16538                    $C$DW$1050      .dwtag  DW_TAG_member
   16539                            .dwattr $C$DW$1050, DW_AT_type(*$C$DW$T$13)
   16540                            .dwattr $C$DW$1050, DW_AT_name("Ip")
   16541                            .dwattr $C$DW$1050, DW_AT_TI_symbol_name("Ip")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  344

   16542                            .dwattr $C$DW$1050, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16543                            .dwattr $C$DW$1050, DW_AT_accessibility(DW_ACCESS_public)
   16544                            .dwattr $C$DW$1050, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16545                            .dwattr $C$DW$1050, DW_AT_decl_line(0xd7)
   16546                            .dwattr $C$DW$1050, DW_AT_decl_column(0x0a)
   16547                    
   16548                    $C$DW$1051      .dwtag  DW_TAG_member
   16549                            .dwattr $C$DW$1051, DW_AT_type(*$C$DW$T$13)
   16550                            .dwattr $C$DW$1051, DW_AT_name("Gateway")
   16551                            .dwattr $C$DW$1051, DW_AT_TI_symbol_name("Gateway")
   16552                            .dwattr $C$DW$1051, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16553                            .dwattr $C$DW$1051, DW_AT_accessibility(DW_ACCESS_public)
   16554                            .dwattr $C$DW$1051, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16555                            .dwattr $C$DW$1051, DW_AT_decl_line(0xd8)
   16556                            .dwattr $C$DW$1051, DW_AT_decl_column(0x0a)
   16557                    
   16558                    $C$DW$1052      .dwtag  DW_TAG_member
   16559                            .dwattr $C$DW$1052, DW_AT_type(*$C$DW$T$13)
   16560                            .dwattr $C$DW$1052, DW_AT_name("Dns")
   16561                            .dwattr $C$DW$1052, DW_AT_TI_symbol_name("Dns")
   16562                            .dwattr $C$DW$1052, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16563                            .dwattr $C$DW$1052, DW_AT_accessibility(DW_ACCESS_public)
   16564                            .dwattr $C$DW$1052, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16565                            .dwattr $C$DW$1052, DW_AT_decl_line(0xd9)
   16566                            .dwattr $C$DW$1052, DW_AT_decl_column(0x0a)
   16567                    
   16568                            .dwattr $C$DW$T$47, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16569                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xd6)
   16570                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
   16571                            .dwendtag $C$DW$T$47
   16572                    
   16573                    $C$DW$T$96      .dwtag  DW_TAG_typedef
   16574                            .dwattr $C$DW$T$96, DW_AT_name("SlIpV4AcquiredAsync_t")
   16575                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$47)
   16576                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
   16577                            .dwattr $C$DW$T$96, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16578                            .dwattr $C$DW$T$96, DW_AT_decl_line(0xda)
   16579                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x02)
   16580                    
   16581                    
   16582                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
   16583                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x20)
   16584                    $C$DW$1053      .dwtag  DW_TAG_member
   16585                            .dwattr $C$DW$1053, DW_AT_type(*$C$DW$T$48)
   16586                            .dwattr $C$DW$1053, DW_AT_name("Ip")
   16587                            .dwattr $C$DW$1053, DW_AT_TI_symbol_name("Ip")
   16588                            .dwattr $C$DW$1053, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16589                            .dwattr $C$DW$1053, DW_AT_accessibility(DW_ACCESS_public)
   16590                            .dwattr $C$DW$1053, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16591                            .dwattr $C$DW$1053, DW_AT_decl_line(0xe4)
   16592                            .dwattr $C$DW$1053, DW_AT_decl_column(0x0a)
   16593                    
   16594                    $C$DW$1054      .dwtag  DW_TAG_member
   16595                            .dwattr $C$DW$1054, DW_AT_type(*$C$DW$T$48)
   16596                            .dwattr $C$DW$1054, DW_AT_name("Dns")
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  345

   16597                            .dwattr $C$DW$1054, DW_AT_TI_symbol_name("Dns")
   16598                            .dwattr $C$DW$1054, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
   16599                            .dwattr $C$DW$1054, DW_AT_accessibility(DW_ACCESS_public)
   16600                            .dwattr $C$DW$1054, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16601                            .dwattr $C$DW$1054, DW_AT_decl_line(0xe5)
   16602                            .dwattr $C$DW$1054, DW_AT_decl_column(0x0a)
   16603                    
   16604                            .dwattr $C$DW$T$49, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16605                            .dwattr $C$DW$T$49, DW_AT_decl_line(0xe3)
   16606                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
   16607                            .dwendtag $C$DW$T$49
   16608                    
   16609                    $C$DW$T$97      .dwtag  DW_TAG_typedef
   16610                            .dwattr $C$DW$T$97, DW_AT_name("SlIpV6AcquiredAsync_t")
   16611                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$49)
   16612                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
   16613                            .dwattr $C$DW$T$97, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16614                            .dwattr $C$DW$T$97, DW_AT_decl_line(0xe6)
   16615                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x02)
   16616                    
   16617                    
   16618                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
   16619                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x10)
   16620                    $C$DW$1055      .dwtag  DW_TAG_member
   16621                            .dwattr $C$DW$1055, DW_AT_type(*$C$DW$T$13)
   16622                            .dwattr $C$DW$1055, DW_AT_name("IpAddress")
   16623                            .dwattr $C$DW$1055, DW_AT_TI_symbol_name("IpAddress")
   16624                            .dwattr $C$DW$1055, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16625                            .dwattr $C$DW$1055, DW_AT_accessibility(DW_ACCESS_public)
   16626                            .dwattr $C$DW$1055, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16627                            .dwattr $C$DW$1055, DW_AT_decl_line(0xea)
   16628                            .dwattr $C$DW$1055, DW_AT_decl_column(0x0d)
   16629                    
   16630                    $C$DW$1056      .dwtag  DW_TAG_member
   16631                            .dwattr $C$DW$1056, DW_AT_type(*$C$DW$T$13)
   16632                            .dwattr $C$DW$1056, DW_AT_name("LeaseTime")
   16633                            .dwattr $C$DW$1056, DW_AT_TI_symbol_name("LeaseTime")
   16634                            .dwattr $C$DW$1056, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
   16635                            .dwattr $C$DW$1056, DW_AT_accessibility(DW_ACCESS_public)
   16636                            .dwattr $C$DW$1056, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16637                            .dwattr $C$DW$1056, DW_AT_decl_line(0xeb)
   16638                            .dwattr $C$DW$1056, DW_AT_decl_column(0x0d)
   16639                    
   16640                    $C$DW$1057      .dwtag  DW_TAG_member
   16641                            .dwattr $C$DW$1057, DW_AT_type(*$C$DW$T$30)
   16642                            .dwattr $C$DW$1057, DW_AT_name("Mac")
   16643                            .dwattr $C$DW$1057, DW_AT_TI_symbol_name("Mac")
   16644                            .dwattr $C$DW$1057, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
   16645                            .dwattr $C$DW$1057, DW_AT_accessibility(DW_ACCESS_public)
   16646                            .dwattr $C$DW$1057, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16647                            .dwattr $C$DW$1057, DW_AT_decl_line(0xec)
   16648                            .dwattr $C$DW$1057, DW_AT_decl_column(0x0d)
   16649                    
   16650                    $C$DW$1058      .dwtag  DW_TAG_member
   16651                            .dwattr $C$DW$1058, DW_AT_type(*$C$DW$T$9)
TI ARM Assembler Unix v20.2.1 Wed Sep 16 12:09:22 2020

Copyright (c) 1996-2018 Texas Instruments Incorporated
slwificonn.asm                                                       PAGE  346

   16652                            .dwattr $C$DW$1058, DW_AT_name("Padding")
   16653                            .dwattr $C$DW$1058, DW_AT_TI_symbol_name("Padding")
   16654                            .dwattr $C$DW$1058, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
   16655                            .dwattr $C$DW$1058, DW_AT_accessibility(DW_ACCESS_public)
   16656                            .dwattr $C$DW$1058, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16657                            .dwattr $C$DW$1058, DW_AT_decl_line(0xed)
   16658                            .dwattr $C$DW$1058, DW_AT_decl_column(0x0d)
   16659                    
   16660                            .dwattr $C$DW$T$50, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16661                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xe9)
   16662                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
   16663                            .dwendtag $C$DW$T$50
   16664                    
   16665                    $C$DW$T$341     .dwtag  DW_TAG_typedef
   16666                            .dwattr $C$DW$T$341, DW_AT_name("SlIpLeasedAsync_t")
   16667                            .dwattr $C$DW$T$341, DW_AT_type(*$C$DW$T$50)
   16668                            .dwattr $C$DW$T$341, DW_AT_language(DW_LANG_C)
   16669                            .dwattr $C$DW$T$341, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/n
   16670                            .dwattr $C$DW$T$341, DW_AT_decl_line(0xee)
   16671                            .dwattr $C$DW$T$341, DW_AT_decl_column(0x02)
   16672                    
   16673                    
   16674                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
   16675                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x0c)
   16676                    $C$DW$1059      .dwtag  DW_TAG_member
   16677                            .dwattr $C$DW$1059, DW_AT_type(*$C$DW$T$13)
   16678                            .dwattr $C$DW$1059, DW_AT_name("IpAddress")
   16679                            .dwattr $C$DW$1059, DW_AT_TI_symbol_name("IpAddress")
   16680                            .dwattr $C$DW$1059, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
   16681                            .dwattr $C$DW$1059, DW_AT_accessibility(DW_ACCESS_public)
   16682                            .dwattr $C$DW$1059, DW_AT_decl_file("/vagrant/Q3_SDK_01/sdk_root/source/ti/drivers/net/wifi/ne
   16683                            .dwattr $C$DW$1059, DW_AT_decl_line(0xf2)
   16684                            .dwattr $C$DW$1059, DW_AT_decl_column(0x0d)
   16685                    
   16686                    $C$DW$1060      .dwtag  DW_TAG_member
   16687                            .dwattr $C$DW$1060, DW_AT_type(*$C$DW$T$30)
   16688                            .dwattr $C$DW$1060, DW_AT_name("Mac")
   16689                            .dwattr $C$DW$1060, DW_AT_TI_symbol_name("Mac")
   16690                            .dwattr $C$DW$1060, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
